[
    {
        "srcUrl": "4k-essential-01-02.mp3",
        "contentTranslation": "<h2>Sư tử và thỏ</h2>Một con sư tử độc ác sống trong rừng. Mỗi ngày, anh ta giết và ăn rất nhiều động vật.<br/>Những con vật khác sợ sư tử sẽ giết tất cả.<br/>Các con vật nói với sư tử, Hãy làm cho một thỏa thuận. Nếu bạn hứa chỉ ăn một con vật mỗi ngày, thì một trong số chúng tôi sẽ đến với bạn mỗi ngày. Sau đó, bạn không phải săn lùng và giết chúng tôi.<br/>Kế hoạch nghe có vẻ chu đáo với con sư tử, vì vậy anh ta đã đồng ý, nhưng anh ta cũng nói, nếu bạn không đi đến mỗi ngày, tôi hứa sẽ giết tất cả các bạn vào ngày hôm sau!<br/>Mỗi ngày sau đó, một con vật đi đến sư tử để sư tử có thể ăn nó. Sau đó, tất cả các động vật khác đã an toàn.<br/>Cuối cùng, đến lượt của thỏ, thỏ đi đến sư tử.<br/>Con thỏ đã đi rất chậm vào ngày hôm đó, vì vậy con sư tử đã tức giận khi con thỏ cuối cùng cũng đến.<br/>Con sư tử giận dữ hỏi con thỏ, tại sao bạn đến muộn?<br/>Tôi đã trốn khỏi một con sư tử khác trong rừng. Con sư tử đó nói ông là vua, nên tôi rất sợ.<br/>Con sư tử nói với con thỏ, tôi là vua duy nhất ở đây! Đưa tôi đến con sư tử khác, và tôi sẽ giết anh ta.<br/>Con thỏ trả lời, tôi sẽ rất vui khi được chỉ cho bạn biết nơi nó sống.<br/>Con thỏ dẫn sư tử đến một cái giếng cũ giữa rừng. Giếng rất sâu với nước ở đáy. Con thỏ nói với con sư tử, chú Hãy nhìn vào đó. Sư tử sống ở phía dưới.<br/>Khi con sư tử nhìn xuống giếng, anh ta có thể nhìn thấy khuôn mặt của chính mình trong nước. Anh nghĩ đó là con sư tử khác.<br/>Không đợi một lúc, con sư tử nhảy xuống giếng để tấn công con sư tử kia. Anh không bao giờ bước ra.<br/>Tất cả những người animals khác trong rừng đều rất hài lòng với trò lừa khéo léo của thỏ.",
        "contentTranscript": "<h2>The Lion and the Rabbit</h2>A cruel lion lived in the forest. Every day, he killed and ate a lot of animals.<br/>The other animals were afraid the lion would kill them all.<br/>The animals told the lion, “Let’s make a deal. If you promise to eat only one animal each day, then one of us will come to you every day. Then you don’t have to hunt and kill us.”<br/>The plan sounded well thought-out to the lion, so he agreed, but he also said, “If you don’t come every day, I promise to kill all of you the next day!”.<br/>Each day after that, one animal went to the lion so that the lion could eat it. Then, all the other animals were safe.<br/>Finally, it was the rabbit’s turn to go to the lion.<br/>The rabbit went very slowly that day, so the lion was angry when the rabbit finally arrived.<br/>The lion angrily asked the rabbit, “Why are you late?”<br/>“I was hiding from another lion in the forest. That lion said he was the king, so I was afraid.”<br/>The lion told the rabbit, “I am the only king here! Take me to that other lion, and I will kill him.<br/>The rabbit replied, “I will be happy to show you where he lives.”<br/>The rabbit led the lion to an old well in the middle of the forest. The well was very deep with water at the bottom. The rabbit told the lion, “Look in there. The lion lives at the bottom.”<br/>When the lion looked in the well, he could see his own face in-the water. He thought that was the other lion.<br/>Without waiting another moment, the lion jumped into the well to attack the other lion. He never came out.<br/>All of the other animals in the forest were very pleased with the rabbit’s clever trick.<br/>",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. How a clever rabbit tricked a cruel lion<br/>b. How rabbits learned to hide from lions<br/>c. How a rabbit pleased an angry lion<br/>d. How to be safe when you hunt in the forest<br/><br/>2. What did all the animals say to the lion?<br/>a. They said they wanted him to be their king.<br/>b. They said that the rabbit would be there in a moment.<br/>c. They said that they would allow him to eat one of them a day.<br/>d. They said that they would hide at the bottom of the well.<br/><br/>3. Why did the rabbit take the lion to the well in the middle of the forest?<br/>a. So a lot of animals could see the rabbit walking with the lion<br/>b. So the lion could attack the “other” lion<br/>c. So the lion could drink water<br/>d. So the other animals would be afraid of the rabbit<br/><br/>4. Which of the following is true at the end of the story?<br/>a. The lion attacked another lion, and they both got hurt.<br/>b. The lion cannot reply to the rabbit, so the rabbit wins.<br/>c. The lion finally dies.<br/>d. The lion is pleased by the rabbit’s words, so it does not eat the rabbit.<br/><br/>5. What did the lion see when it looked in the well?<br/>.............",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>agree</td><td>bottom</td><td>finally</td><td>afraid</td></tr><tr><td>arrive</td><td>lot</td><td>well&nbsp;</td><td>angry</td></tr><tr><td>attack</td><td>middle</td><td>&nbsp;</td><td>clever</td></tr><tr><td>hide</td><td>moment</td><td>&nbsp;</td><td>cruel</td></tr><tr><td>hunt</td><td>trick</td><td>&nbsp;</td><td>pleased</td></tr><tr><td>promise</td><td>&nbsp;</td><td>&nbsp;</td><td>safe</td></tr><tr><td>reply</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-01.json",
        "srcUrlReadingWold": "4k-essential-01-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-02-02.mp3",
        "contentTranslation": "<h2>Phòng thí nghiệm</h2>Cha Mia có một phòng thí nghiệm, nhưng cô không biết cái gì trong đó.<br/>Cha cô luôn đóng và khóa cửa khi ông đi vào. Cô biết rằng ông dùng nó để làm các dự án cho công việc.<br/>Anh ấy không bao giờ nói với Mia những dự án này là gì.<br/>Một đêm nọ, Mia đến gần cửa phòng thí nghiệm. Cô dừng lại và nghĩ, tôi tự hỏi giờ ông ấy đang làm thí nghiệm điên rồ nào.<br/>Đột nhiên, cô nghe thấy một tiếng động lớn. Nghe có vẻ như một tiếng cười xấu xa. Tiếng ồn làm cô sợ, nên cô bước nhanh về phòng.<br/>Tối hôm sau, cô bạn Liz đến nhà cô. Khi Liz đến, Mia kể cho cô về đêm hôm trước.<br/>\"thật là kinh khủng\" cô nói. Tại sao chúng ta không thấy những gì trong đó? Liz hỏi. Đây sẽ là một cuộc phiêu lưu thú vị!<br/>Mia cảm thấy lo lắng về việc đi vào phòng thí nghiệm của cha cô, nhưng cô đã đồng ý.<br/>Như mọi khi, cánh cửa đã bị khóa. Họ đợi cho đến khi cha Mia rời phòng thí nghiệm để ăn tối. Ông đã không khóa cửa! Liz nói. \"Đi nào.\"<br/>Phòng thí nghiệm tối đen. Các cô gái bước xuống cầu thang cẩn thận. Mia ngửi thấy mùi hóa chất lạ. Điều gì khủng khiếp là cha cô đã tạo ra?<br/>Đột nhiên, họ nghe thấy một tiếng cười xấu xa. Nó thậm chí còn tồi tệ hơn người mà Mia nghe thấy tối hôm trước.<br/>Điều gì nếu một con quái vật sẽ giết họ? Mia phải làm gì đó. Cô hét lên để được giúp đỡ.<br/>Bố Mia chạy vào phòng và bật đèn lên.<br/>Oh không, ông nói. Bạn chắc đã học được bí mật của tôi.<br/>Quái vật của bố đã cố gắng để giết chúng tôi, Mia nói.<br/>\"Quái vật?\" ông ấy hỏi. \"Ý bạn là?\" Anh ta có một con búp bê xinh xắn trong tay. Con búp bê cười. Tiếng cười không vang lên như vậy nữa.<br/>Tôi đã làm điều này cho ngày sinh nhật của bạn. Tôi muốn đưa nó cho bạn sau đó, nhưng bạn có thể có nó ngay bây giờ. Tôi hy vọng bạn thích nó!\"",
        "contentTranscript": "<h2>The Laboratory</h2>Mia’s father had a laboratory, but she had no idea what was in it.<br/>Her dad always closed and locked the door when he went in. She knew that he used it to do projects for work.<br/>He never told Mia what these projects were.<br/>One night, Mia approached the door to the laboratory. She stopped and thought, “I wonder what crazy experiment he is doing now.”<br/>Suddenly, she heard a loud noise. It sounded like an evil laugh. The noise scared her, so she walked quickly back to her room.<br/>The next night, her friend Liz came to her house. When Liz arrived, Mia told her about the night before.<br/>“Oh, it was terrible,” she said. “Why don’t we see what is in there?” Liz asked. “It will be a fun adventure!”<br/>Mia felt nervous about going into her father’s laboratory, but she agreed.<br/>As always, the door was locked. They waited until Mia’s father left the laboratory to eat dinner. “He didn’t lock the door!” Liz said. “Let’s go.”<br/>The laboratory was dark. The girls walked down the stairs carefully. Mia smelled strange chemicals. What terrible thing was her father creating?<br/>Suddenly, they heard an evil laugh. It was even worse than the one Mia heard the night before.<br/>What if a monster was going to kill them? Mia had to do something. She shouted for help.<br/>Mia’s father ran into the room and turned on the lights.<br/>“Oh, no,” he said. “You must have learned my secret.”<br/>“Your monster tried to kill us,” Mia said.<br/>“Monster?” he asked. “You mean this?” He had a pretty doll in his hands. The doll laughed. The laugh didn’t sound so evil anymore.<br/>“I made this for your birthday. I wanted to give it to you then, but you can have it now. I hope you like it!”",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. A girl’s terrible experiment<br/>b. A secret that two girls have<br/>c. A girl who gets nervous about what’s in a laboratory<br/>d. A man who creates chemicals<br/><br/>2. What scares Mia when she approaches the door?<br/>a. The room is very dark.<br/>b. She hears a person shout.<br/>c. She smells fire.<br/>d. She hears a loud noise.<br/><br/>3. What is true of Mia in the story?<br/>a. A monster kills her friend.<br/>b. She does not like adventures.<br/>c. She always locks the door of her room.<br/>d. Her birthday has not come yet.<br/><br/>4. What project was Mia’s father working on?<br/>a. A doll to give to Mia for her birthday<br/>b. A way to keep the door closed<br/>c. A chemical that smells worse than fire<br/>d. A monster that had an evil laugh<br/>5. When did Mia and Liz go into the laboratory?",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"80\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>approach</td><td>adventure</td><td>carefully</td><td>evil</td></tr><tr><td>create</td><td>chemical</td><td>&nbsp;</td><td>loud</td></tr><tr><td>kill</td><td>experiment</td><td>&nbsp;</td><td>nervous</td></tr><tr><td>scare</td><td>laboratory</td><td>&nbsp;</td><td>terrible</td></tr><tr><td>shout</td><td>laugh</td><td>&nbsp;</td><td>worse</td></tr><tr><td>smell</td><td>noise</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>project</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>secret</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-02.json",
        "srcUrlReadingWold": "4k-essential-volume1-02-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-03-02.mp3",
        "contentTranslation": "<h2>Báo cáo</h2>Lee ngồi giữa những cuốn sách ở thư viện và nghĩ về dự án nhóm của mình.<br/>Họ phải sớm quay lại, nhưng anh ấy thậm chí đã bắt đầu phần của mình!<br/>Jack và Claire ở trong nhóm của anh ấy. Họ đã làm việc chăm chỉ. Họ cũng rất thông minh, và Lee đã không muốn họ bị điểm kém.<br/>Jack đã làm báo cáo. Ông đã viết rất nhiều câu rất hay và mô tả những điều có tính từ tuyệt vời.<br/>Claire vẽ một bản đồ đẹp của các ngôi sao. Bây giờ, Lee cần phải thực hiện một phần của dự án.<br/>Hay, tôi cho rằng tôi cần bắt đầu mô hình của mình, Lee nghĩ.<br/>Làm một mô hình của một hành tinh thực sự khó khăn. Lee đã cố gắng đọc một vài cuốn sách, nhưng anh ta không thể hiểu được bất kỳ biểu đồ nào.<br/>chúng tôi sẽ thất bại vì tôi! Lee nghĩ.<br/>Anh gục đầu xuống bàn và nói, tôi ước mình có thể nhìn thấy một hành tinh, thay vì phải đọc về nó!<br/>Đột nhiên, có một ánh sáng rực rỡ. Lee bị kéo khỏi ghế, qua mái nhà, và phải vào một con tàu lạ!<br/>Chúc mừng, nhóc, một người ngoài hành tinh nói. Bạn có nhờ giúp đỡ không?<br/>Lee nói với người ngoài hành tinh thân thiện tất cả về dự án của mình. Người ngoài hành tinh đồng ý giúp Lee giải quyết vấn đề của mình.<br/>Trước tiên, chúng tôi bay trong không gian để xem vũ trụ. Sau đó, tôi có thể giúp bạn tạo ra một mô hình của hành tinh của tôi.<br/>Chẳng mấy chốc, họ đã đi qua những đám mây. Họ đã qua mặt trăng. Sau đó, họ xem Sao Hỏa.<br/>Lee rất phấn khích. Thay vì điểm kém, nhóm của anh ấy sẽ có dự án tốt nhất từ ​​trước đến nay!<br/>Sau một thời gian về nhà, người ngoài hành tinh đã nói. Trên đường về, anh đã giúp Lee tạo ra một mô hình của hành tinh sao Hỏa.<br/>Chẳng mấy chốc, họ đã ở trên Trái đất. Cảm ơn, Lee nói.<br/>Mô hình của tôi sẽ rất tuyệt Sau đó, anh lấy mô hình của mình và nói lời tạm biệt với người bạn mới.",
        "contentTranscript": "<h2>The Report</h2>Lee sat among the books at the library and thought about his group project.<br/>They had to turn it in soon, but he hadn’t even started his part!<br/>Jack and Claire were in his group. They had worked hard. They were also very smart, and Lee didn’t want them to get a bad grade.<br/>Jack did the report. He wrote a lot of very good sentences and described things with great adjectives.<br/>Claire drew a nice map of the stars. Now, Lee needed to do his part of the project.<br/>“Well, I suppose I need to start my model,” Lee thought.<br/>Making a model of a planet was really hard. Lee tried to read several books, but he couldn’t comprehend any of the charts.<br/>“We’re going to fail because of me!” Lee said.<br/>He put his head down on the table and said, “I wish I could see a planet, instead of having to read about it!”<br/>Suddenly, there was a bright light. Lee was pulled from his chair, through the roof, and right into a strange ship!<br/>“Hello, kid,” said an alien. “Did you ask for help?”<br/>Lee told the friendly alien all about his project. The alien agreed to help Lee solve his problem.<br/>“First, we’ll fly through space to view the universe. Then, I can help you make a model of my planet.”<br/>Soon, they were going through the clouds. They passed the moon. Then they viewed Mars.<br/>Lee was very excited. Instead of a bad grade, his group would have the best project ever!<br/>“It’s time to go home,” the alien finally said. On the way back, he helped Lee make a model of the planet Mars.<br/>Soon, they were on Earth. “Thanks,” Lee said.<br/>“My model will be awesome!” Then he took his model and said goodbye to his new friend.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. Why a smart boy fails a class<br/>b. A boy’s trip into the universe<br/>c. A boy who wants to write instead of draw<br/>d. An alien living in a library<br/><br/>2. What is Lee unable to comprehend?<br/>a. Howto make a model of a planet<br/>b. Why there are maps among the books<br/>c. Where the best place is to view the stars<br/>d. Howto read the information in a chart<br/><br/>3. What can you suppose is true of the group’s report?<br/>a. It has three sentences.<br/>b. It must describe clouds.<br/>c. It is not due until several days.<br/>d. It is about the stars and planets.<br/><br/>4. What did the alien want to do to help Lee?<br/>a. Get several books from the library<br/>b. Hear the best report ever<br/>c. Make the model of a planet<br/>d. Solve his own problems<br/><br/>5. What planet did Lee see on his trip?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td width=\"88\"><strong>Verb</strong></td><td width=\"64\"><strong>Prep</strong></td><td width=\"67\"><strong>Noun</strong></td><td width=\"68\"><strong>Adv</strong></td><td width=\"64\"><strong>Adj</strong></td></tr><tr><td>comprehend</td><td>among</td><td>alien</td><td>ever</td><td>friendly</td></tr><tr><td>describe</td><td>&nbsp;</td><td>chart</td><td>instead</td><td>several</td></tr><tr><td>fail</td><td>&nbsp;</td><td>cloud</td><td>suddenly</td><td>&nbsp;</td></tr><tr><td>solve</td><td>&nbsp;</td><td>grade</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>suppose</td><td>&nbsp;</td><td>library</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>view</td><td>&nbsp;</td><td>planet</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>report</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>universe</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-03.json",
        "srcUrlReadingWold": "4k-essential-volume1-03-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-04-02.mp3",
        "contentTranslation": "<h2>Chuông của Chó</h2>Chó John là một con chó xấu. Nó cắn người thường xuyên. John đã rất quan tâm về điều này.<br/>Đó không phải là một cách thích hợp để một con chó cư xử. Những người bạn của anh ta trong làng luôn mong con chó cắn họ.<br/>Tin tức về chú chó John nhiệt tình lan khắp làng. Không ai trong số họ muốn đến nhà John.<br/>John đã cố gắng hướng dẫn con chó cư xử, nhưng nó không bao giờ hoạt động. Anh cố gắng kiên nhẫn và dạy chú chó bình tĩnh.<br/>Điều đó cũng không làm việc. John không muốn trừng phạt con chó. Làm thế nào tôi có thể ngăn chặn con chó của tôi từ bỏ thói quen xấu? John tự hỏi mình.<br/>Người bạn của John đã đến nói chuyện với anh ta về vấn đề này.<br/>Trong cuộc họp quan trọng của họ, người bạn của anh cho biết, người dân trong làng yêu cầu tôi đại diện cho họ.<br/>Chúng tôi muốn con chó của bạn dừng thói quen này. Tại sao bạn không đặt chuông quanh cổ con chó? Bằng cách này, chúng tôi sẽ nghe thấy con chó của bạn đi xuống đường.<br/>John nghĩ rằng đây là một ý tưởng tuyệt vời. Bây giờ, mọi người có thể tránh xa con chó.<br/>Nó sẽ không thể cắn bất cứ ai nữa.<br/>Con chó cũng thích chuông. Mọi người nhìn nó khi nghe tiếng chuông của nó.<br/>Điều này làm cho con chó rất hài lòng. Nó thích bài hát mà tiếng chuông vang lên khi nó bước đi.<br/>Một ngày nọ, chú chó của John đi dạo trong làng và gặp một số chú chó khác.<br/>Nó mong họ muốn có một chiếc chuông như của nó. Nhưng họ đã cười vào tiếng chuông của anh.<br/>Họ nói tiếng chuông khiến mọi người tránh mặt anh. Con chó của John lắc đầu.<br/>Không, họ nhìn tôi vì họ thích chuông.<br/>Những con chó khác nói, bạn có ý tưởng sai về những gì làm cho bạn nổi tiếng.<br/>Tất nhiên họ thích chuông của bạn. Nó cho họ biết bạn đang ở đâu để họ có thể tránh bạn.<br/>Bạn không có thể cắn họ nữa!<br/>Bạn thấy đấy, việc trở nên phổ biến là một điều gì đó tích cực khi nó vì lý do sai.",
        "contentTranscript": "<h2>The Dog’s Bell</h2>John’s dog was a bad dog. He bit people frequently. John had great concern about this.<br/>It was not an appropriate way for a dog to behave. His friends in the village always expected the dog to bite them.<br/>The news about John’s dog spread through the village. None of the people wanted to go to John’s house.<br/>John tried to instruct the dog to behave, but it never worked. He tried to be patient and teach the dog to be calm.<br/>That also didn’t work. John didn’t want to punish the dog. “How will I stop my dog’s bad habit?” John asked himself.<br/>John’s friend came to talk to him about the issue.<br/>During their important meeting, his friend said, “The people in the village asked me to represent them.<br/>We want your dog to stop this habit. Why don’t you put a bell around the dog’s neck? This way, we would hear your dog coming down the street.”<br/>John thought this was a great idea. Now, people could stay away from the dog.<br/>It would not be able to bite anyone anymore.<br/>The dog liked the bell, too. People looked at him when they heard his bell.<br/>This made the dog very content. He liked the song the bell played when he walked.<br/>One day, John’s dog strolled through the village and met some other dogs.<br/>He expected them to want a bell like his. But they laughed at his bell.<br/>They said the bell made people avoid him. John’s dog shook his head.<br/>“No, they look at me because they like the bell.”<br/>The other dogs said, “You have the wrong idea of what makes you popular.<br/>Of course, they like your bell. It tells them where you are so they can avoid you.<br/>You aren’t able to bite them anymore!”<br/>You see, being popular isn’t something positive when it’s for the wrong reason.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story mainly about?<br/>a. A dog that is frequently bad<br/>b. A dog’s stroll through town<br/>c. A content man and his dog<br/>d. A village that liked John’s dog<br/><br/>2. What is true of the dog?<br/>a. He likes none of John’s friends.<br/>b. He shakes his head too much.<br/>c. He bites when it’s not appropriate.<br/>d. He expects people to be calm around him.<br/><br/>3. Why did the issue with the dog bother John?<br/>a. People didn’t think of John in a positive way.<br/>b. People avoided going to John’s house.<br/>c. People didn’t want John to represent them.<br/>d. People didn’t like the song that John played.<br/><br/>4. What did John do to stop the dog’s bad habit?<br/>a. He instructed the dog on learning tricks.<br/>b. He punished the dog for biting.<br/>c. He was patient and showed concern.<br/>d. He put a bell around the dog’s neck.<br/><br/>5. What did the other dogs say about the bell?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td width=\"73\"><strong>Verb</strong></td><td width=\"82\"><strong>Pronoun</strong></td><td width=\"83\"><strong>Noun</strong></td><td width=\"81\"><strong>Adv</strong></td><td width=\"91\"><strong>Adj</strong></td></tr><tr><td>avoid</td><td>none</td><td>concern</td><td>frequently</td><td>appropriate</td></tr><tr><td>behave</td><td>&nbsp;</td><td>habit</td><td>&nbsp;</td><td>calm</td></tr><tr><td>expect</td><td>&nbsp;</td><td>issue</td><td>&nbsp;</td><td>content</td></tr><tr><td>instruct</td><td>&nbsp;</td><td>village</td><td>&nbsp;</td><td>patient</td></tr><tr><td>punish</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>positive</td></tr><tr><td>represent</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>shake</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>spread</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>stroll</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-04.json",
        "srcUrlReadingWold": "4k-essential-volume1-04-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-05-02.mp3",
        "contentTranslation": "<h2>Con chó rừng và con mặt trời</h2>Chó rừng là một con chó hoang với cái lưng to màu đen. Nó cư trú trong sa mạc.<br/>Nhưng làm thế nào mà chó rừng có được màu đen của mình? Đây là cách nó đã xảy ra.<br/>Một ngày nọ, chó rừng nhìn thấy một cô gái. Cô đang ngồi trên một tảng đá. Cô ấy không phải là một đứa trẻ bình thường.<br/>Cô là một đứa trẻ mặt trời hiếm hoi và xinh đẹp. Cô tươi sáng và ấm áp như mặt trời. Đứa trẻ nhìn thấy chó rừng và mỉm cười.<br/>Cô ấy nói, Jackal, tôi đã thư giãn trên tảng đá này quá lâu. Tôi phải về nhà sớm. Nhưng, tôi chậm và bạn nhanh. Bạn có thể sẽ đưa tôi về nhà nhanh hơn.<br/>Sau đó cô ấy yêu cầu, bạn sẽ chở tôi về nhà chứ? Nếu bạn làm thế, tôi sẽ tặng bạn một món quà. Chiếc vòng cổ này thuộc về tôi, nhưng tôi sẽ tặng nó cho bạn.<br/>Chó rừng hoang dã đồng ý. Thế là đứa trẻ mặt trời ngồi trên lưng con chó. Họ bắt đầu đi bộ.<br/>Nhưng chẳng bao lâu, chó rừng cảm thấy bị bệnh. Đứa trẻ mặt trời rất nóng trên lưng.<br/>Cái nóng làm anh đau lưng vô cùng. Tôi đã phạm một lỗi khủng khiếp trong đánh giá. anh ta đã nghĩ.<br/>Anh ấy không nên đồng ý mang cô ấy. Vì vậy, anh yêu cầu cô xuống xe. Nhưng cô không làm thế.<br/>Lưng của jackal tiếp tục nóng hơn và nóng hơn.<br/>Anh phải tránh xa đứa trẻ mặt trời. Thế là anh lên kế hoạch.<br/>Đầu tiên, anh chạy nhanh hết mức có thể. Anh hy vọng đứa trẻ mặt trời sẽ rơi xuống. Nhưng cô không làm thế.<br/>Vì vậy, khi đứa trẻ mặt trời đang nhìn lên bầu trời, không biết kế hoạch tiếp theo của chó rừng, nó đã nhảy vào một cánh đồng hoa.<br/>Kết quả là đứa trẻ lăn ra khỏi lưng. Con chó rừng bỏ chạy.<br/>Nhưng đứa trẻ mặt trời đã để lại một dấu ấn trên lưng chó rừng, một vết đen có thể nhìn thấy.<br/>Kể từ khi trải nghiệm với đứa trẻ mặt trời, chó rừng đã có một cái lưng màu đen.",
        "contentTranscript": "<h2>The Jackal and the Sun Child</h2>A jackal is a wild dog with a big black back. It resides in the desert.<br/>But how did the jackal get his black back? This was how it happened.<br/>One day, the jackal saw a girl. She was sitting upon a rock. She was not a normal child.<br/>She was a rare and beautiful sun child. She was bright and warm like the sun. The child saw the jackal and smiled.<br/>She said, “Jackal, I have been relaxing on this rock for too long. I must get home soon. But, I am slow and you are fast. You will likely get me home more quickly.”<br/>Then she requested, “Will you carry me home? If you do, I’ll give you a gift. This necklace belongs to me, but I will give it to you.”<br/>The wild jackal agreed. So the sun child sat on the dog’s back. They started to walk.<br/>But soon, the jackal felt ill. The sun child was very hot on his back.<br/>The heat was hurting his back very badly. “I made a terrible error in judgment.” he thought.<br/>He shouldn’t have agreed to carry her. So he asked her to get off. But she did not.<br/>The jackal’s back continued to get hotter and hotter.<br/>He had to get away from the sun child. So he made a plan.<br/>First, he ran as fast as he could. He hoped the sun child would fall off. But she did not.<br/>So when the sun child was looking at the sky, not aware of the jackal’s next plan, he jumped into a field of flowers.<br/>As a result, the child rolled off his back. The jackal ran away.<br/>But the sun child left a mark on the jackal’s back, a visible black mark.<br/>Ever since his experience with the sun child, the jackal has had a black back.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. Why the sun child has a beautiful smile<br/>b. Why a wild dog hurt a sun child<br/>c. An error that the sun child once made<br/>d. How the jackal got his visible black mark<br/><br/>2. What kind of girl was the sun child?<br/>a. She was rare and beautiful.<br/>b. She was likely very shy.<br/>c. She was an ill child.<br/>d. She was a normal child.<br/><br/>3. Why did the jackal run into the field?<br/>a. To continue his journey<br/>b. It wanted a new place to reside.<br/>c. To take a nap and relax<br/>d. To get away from the sun child<br/><br/>4. What happened at the end of the story?<br/>a. The sun child forgot the experience.<br/>b. The sun child became aware of the jackal’s black back.<br/>c. The sun child rolled off the jackal’s back.<br/>d. The sun child has stayed upon the jackal’s back since then.<br/><br/>5. What did the sun child request?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"62\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"39\"><strong>Prep</strong></td><td style=\"text-align: center;\" width=\"77\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"41\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"51\"><strong>Adj</strong></td></tr><tr><td>belong</td><td>since</td><td>error</td><td>badly</td><td>aware</td></tr><tr><td>continue</td><td>&nbsp;</td><td>experience</td><td>likely</td><td>normal</td></tr><tr><td>hurt</td><td>&nbsp;</td><td>field</td><td>&nbsp;</td><td>rare</td></tr><tr><td>relax</td><td>&nbsp;</td><td>judgment</td><td>&nbsp;</td><td>visible</td></tr><tr><td>request</td><td>&nbsp;</td><td>result</td><td>&nbsp;</td><td>wild</td></tr><tr><td>reside</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>roll</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-05.json",
        "srcUrlReadingWold": "4k-essential-volume1-05-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-06-02.mp3",
        "contentTranslation": "<h2>Con ma thân thiện</h2>Một người phụ nữ tốt bụng sống bên một dòng sông lớn. Cô yêu trẻ con. Cô muốn giúp họ bằng mọi cách.<br/>Cô ấy yêu cộng đồng của mình, và mọi người trong cộng đồng đều yêu mến cô ấy. Cô sống một thời gian rất dài và trở nên rất khôn ngoan.<br/>Khi cô ấy chết, cô ấy trở thành một con ma. Cô ấy đã chết, nhưng mỗi đêm cô ấy trở lại cộng đồng của mình.<br/>Cô muốn giúp đỡ trẻ em và không khiến chúng sợ hãi. Nhưng cô có một giọng nói đáng sợ.<br/>Trẻ con sợ cô, nhưng hồn ma là một người tốt. Cô chỉ làm sợ họ để giúp họ.<br/>Một đêm nọ, một số trẻ em và một con chó đang chơi bên bờ sông. Họ đã vui vẻ với thú cưng của họ.<br/>Nhưng họ đã xa nhà. Rồi thời tiết trở nên tồi tệ. Trời mưa và mưa.<br/>Dòng sông đang lên. Trời rất tối. Bọn trẻ biết mình đã mất.<br/>Họ cần phải đi lên phía bắc, nhưng họ không biết đó là hướng nào.<br/>Khi mặt trăng xuất hiện, họ nhìn thấy một con ma bên bờ sông. Con ma nói, ra đi!<br/>Bọn trẻ cảm thấy vô cùng hoảng sợ. Họ biết đó là một con ma. Rồi con ma lại gần.<br/>Cô lại hét lên, hãy đi đi! Bọn trẻ trở nên rất buồn bã. Một số trong số họ bắt đầu khóc.<br/>Những đứa trẻ biết rằng chúng có một lựa chọn: chúng có thể trốn thoát, hoặc chúng có thể ở lại và đối mặt với cá thể đáng sợ này trong bóng tối.<br/>Bọn trẻ chạy một quãng xa. Con ma đi theo họ suốt chặng đường.<br/>Cuối cùng, các em về đến nhà. Con ma rất vui. Chẳng mấy chốc, dòng sông càng ngày càng dâng cao.<br/>Nó rất nguy hiểm. Con ma đã giúp những đứa trẻ sống sót! Cô đã cứu họ khỏi nước dâng cao.<br/>Cô cũng sử dụng sức mạnh của mình để dẫn họ về nhà. Đôi khi, gặp một con ma có lợi thế. Một con ma có thể cứu sống bạn!",
        "contentTranscript": "<h2>The Friendly Ghost</h2>A nice woman lived by a large river. She loved children. She wanted to help them in any way.<br/>She loved her community, and everyone in the community loved her. She lived a very long time and became very wise.<br/>When she died, she became a ghost. She was dead, but every night she returned to her community.<br/>She wanted to help children and not to cause them fright. But she had a scary voice.<br/>Children were afraid of her, but the ghost was a good one. She only scared them to help them.<br/>One night, some children and a dog were playing by the river. They were having fun with their pet.<br/>But they were far from home. Then the weather became bad. It rained and rained.<br/>The river was rising. It was very dark. The children knew they were lost.<br/>They needed to go north, but they didn’t know which direction it was.<br/>When the moon came out, they saw a ghost by the river. The ghost said, “Go away!”<br/>The children felt great fright. They knew it was a ghost. Then the ghost moved closer.<br/>She yelled again, “Go away!” The children became very upset. Some of them began to cry.<br/>The children knew they had a choice: they could escape, or they could stay and face this scary individual in the dark.<br/>The children ran a long distance away. The ghost followed them all the way.<br/>Finally, the children reached home. The ghost was very happy. Soon the river rose higher and higher.<br/>It was very dangerous. The ghost had helped the children survive! She had saved them from the rising water.<br/>She also used her power to lead them home. Sometimes, meeting a ghost has advantages. A ghost can save your life!",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. How a ghost returns to help her community<br/>b. How a wise pet helps children escape a ghost<br/>c. Why an individual has a job in the north<br/>d. How some children escaped bad weather<br/><br/>2. What caused fright in the children?<br/>a. The power of the moon at night<br/>b. The bad weather near the river<br/>c. The voice of the ghost<br/>d. Their dead pet<br/><br/>3. What was true of the children in the story?<br/>a. Their home was a short distance from the river.<br/>b. They had the advantage of being ghosts.<br/>c. They didn’t like to play near the river.<br/>d. They were upset when they saw the ghost.<br/><br/>4. Why did the ghost scare the children?<br/>a. She wanted to help them.<br/>b. She had no other choice.<br/>c. She was afraid of their pet.<br/>d. She didn’t want them to see her.<br/><br/>5. Where did the woman live?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"62\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"81\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>cause</td><td>advantage</td><td>dead</td></tr><tr><td>escape</td><td>choice</td><td>upset</td></tr><tr><td>face</td><td>community</td><td>wise</td></tr><tr><td>follow</td><td>distance</td><td>&nbsp;</td></tr><tr><td>reach</td><td>fright</td><td>&nbsp;</td></tr><tr><td>return</td><td>ghost</td><td>&nbsp;</td></tr><tr><td>survive</td><td>individual</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>pet</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>voice</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>weather</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-06.json",
        "srcUrlReadingWold": "4k-essential-volume1-06-01.mp3"
    }
]