[
    {
        "srcUrl": "4k-essential-volume1-25-02.mp3",
        "contentTranslation": "<h2>Ao của Joe</h2>Joe làm cho thế giới tốt đẹp hơn Anh ấy có ý tưởng để làm điều đó ở trường.<br/>Anh ấy đã xem một video ở đó. Đó là về một nhà máy. Nhà máy này sản xuất rất nhiều rác và đặt nó xuống sông.<br/>Thùng rác và nước là một hỗn hợp xấu. Người dân đã lấp đầy khu vực bên bờ sông và uống nước của nó.<br/>Điều này làm cho họ bị bệnh. Nhiều người trong số họ cần thuốc và thường xuyên đến bác sĩ.<br/>Nhưng video không phải là tin xấu. Nó chỉ ra những cách để nhặt rác và tại sao nó lại quan trọng để làm điều này.<br/>Nó nói mọi người có thể làm cho một sự khác biệt cho môi trường của họ. Các tính năng quan trọng của video Video khiến Joe liên tưởng đến rác rưởi.<br/>Một ngày nọ, Joe đi bộ qua một công viên. Ông nhận ra một số vấn đề từ video.<br/>Một ví dụ của những vấn đề này là rác trong ao. Nó đầy những cốc nhựa.<br/>Có quá nhiều rác. Joe didn lồng muốn nó làm tổn thương bất cứ ai. Anh nói với ông nội về công viên.<br/>Ông nội của anh cho biết, bạn biết đấy, đó là một truyền thống trong gia đình chúng tôi để giúp đỡ mọi người.<br/>Đó là lý do tại sao chúng tôi cung cấp thực phẩm cho người nghèo. Có lẽ bạn có thể giúp mọi người bằng cách dọn dẹp công viên.<br/>Làm sạch công viên sẽ liên quan đến công việc khó khăn. Joe quyết định tổ chức một nhóm để giúp anh ta.<br/>Anh chọn một khu vực rộng lớn của công viên. Nó có nhiều rác nhất. Anh nhờ gia đình và bạn bè đến.<br/>Vào thứ bảy, anh ấy đã cho mọi người một cây gậy sắc nét. Họ tự hỏi tại sao. Anh ấy nói, bạn hãy dùng mẹo từ gậy để nhặt rác.<br/>Điều này làm cho nó dễ dàng hơn. Họ đã làm việc trong sáu tuần. Những người khác nhau đã giúp đỡ mỗi lần, nhưng Joe luôn ở đó.<br/>Trong khoảng thời gian đó, Joe đã thấy một loạt kết quả. Không có rác trong nước.<br/>Mọi người có thể bơi trong đó. Joe biết đó là một dấu hiệu tốt. Anh hạnh phúc vì anh giúp môi trường của anh.",
        "contentTranscript": "<h2>Joe’s Pond</h2>Joe made the world a better place. He got the idea to do that at school.<br/>He watched a video there. It was about a factory. This factory produced a lot of trash and put it in a river.<br/>The trash and water were a bad mix. People populated the area by the river and drank its water.<br/>This made them sick. Many of them needed medicine and made regular visits to doctors.<br/>But the video wasn’t all bad news. It showed ways to pick up trash and why it’s important to do this.<br/>It said people can make a difference to their environment. The video’s important features made Joe associate trash with hurting people.<br/>One day Joe walked through a park. He recognized some of the problems from the video.<br/>One instance of these problems was the trash in the pond. It was full of plastic cups.<br/>There was too much trash. Joe didn’t want it to hurt anyone. He told his grandfather about the park.<br/>His grandfather said, “You know, it’s a tradition in our family to help people.<br/>That’s why we give food to poor people. Maybe you can help people by cleaning the park.”<br/>Cleaning the park would involve hard work. Joe decided to organize a group to help him.<br/>He chose a wide area of the park. It had the most trash. He asked his family and friends to come.<br/>On Saturday, he gave everyone a sharp stick. They wondered why. He said, “You use the stick’s tip to pick up trash.<br/>This makes it easier.” They worked for six weeks. Different people helped each time, but Joe was always there.<br/>In that period of time, Joe saw a range of results. There was no trash in the water.<br/>People could swim in it. Joe knew that was a good sign. He was happy because he helped his environment.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is the main idea of this story?<br/>a. A grandfather teaching traditions<br/>b. Howto recognize signs of sickness<br/>c. An instance of videos helping students study<br/>d. A boy helping the environment<br/><br/>2. When did the boy decide to clean the park?<br/>a. After he saw a video about a factory harming a river with its trash<br/>b. After he went there on regular visits<br/>c. After he saw a range of people cleaning it<br/>d. After he associated trash with harming people<br/><br/>3. Why did the people in the video get sick?<br/>a. A factory put trash in a river.<br/>b. They produced too much trash.<br/>c. They populated too many parks.<br/>d. They had no medicine for a long period.<br/><br/>4. Why was it easy to pick up the trash?<br/>a. It did not involve hard work.<br/>b. Joe did not organize the group.<br/>c. They used the tips of sharp sticks.<br/>d. The people had a good mix of tools to use.<br/><br/>5. What did the features of the video make Joe do?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"67\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"88\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"51\"><strong>Adj</strong></td></tr><tr><td>associate</td><td>environment</td><td>regular</td></tr><tr><td>involve</td><td>factory</td><td>wide</td></tr><tr><td>organize</td><td>feature</td><td>&nbsp;</td></tr><tr><td>populate</td><td>instance</td><td>&nbsp;</td></tr><tr><td>produce</td><td>medicine</td><td>&nbsp;</td></tr><tr><td>recognize</td><td>mix</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>period</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>range</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>sign</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>tip</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>tradition</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>trash</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-25.json",
        "srcUrlReadingWold": "4k-essential-volume1-25-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-26-02.mp3",
        "contentTranslation": "<h2>Archie và con lừa của anh ấy</h2>Archie cũ cần một số tiền. Anh quyết định bán con lừa của mình. Vì vậy, anh và con trai Tom đã đi đến thị trấn.<br/>Nó được nằm nhiều dặm. Chẳng mấy chốc, họ đã gặp một người phụ nữ. \"Bạn đi đâu?\" Cô hỏi.<br/>Archie đến thị trấn, Archie nói Archie. Bất cứ người thông minh nào cũng sẽ cưỡi lừa, cô nói.<br/>\"Bạn đang đề cập tới cái gì?\" Archie hỏi. \"Tôi rất thông minh!\" Archie muốn trông thông minh.<br/>Thế là anh ta trèo lên con lừa. Rồi họ tiếp tục đi về hướng thị trấn.<br/>Xa hơn dọc đường, họ gặp một người nông dân. Arch xin chào, Archie nói Archie.<br/>Chúng tôi muốn bán con lừa này. Bạn có muốn mua nó không?\" Tôi không cần một con lừa, người nông dân nói.<br/>Nếu bạn muốn lời khuyên của tôi, hãy ủng hộ nó. Con lừa cần ở trong tình trạng thể chất tốt.<br/>Arch ý tưởng tốt, Archie nói Archie. Tôi muốn bạn cưỡi nó. Bạn nhẹ hơn.<br/>Không cả bạn và con trai của bạn nên đi nó. Trông rất mệt mỏi. Bạn nên mang theo con lừa. đề nghị nông dân.<br/>Bạn có thể nói đúng, bạn nói Archie. Hãy đến, Tom! Chúng tôi sẽ thực hiện nó cho vài dặm cuối cùng!”<br/>Con lừa rất nặng và chúng không thể duy trì tốc độ tốt.<br/>Họ đã không đến nơi vào buổi tối. Cuối cùng, họ bước vào thị trấn.<br/>Nhưng ở đó, họ đã thu hút sự chú ý của một số cậu bé tuổi teen. Họ cười nhạo Tom và Archie.<br/>Họ bắt đầu ném đá vào họ. Con lừa đã phản ứng bằng cách đá.<br/>Tom và Archie thả con lừa. Nó rơi xuống đất rồi bỏ chạy.<br/>Archie bị mất con lừa của mình. Anh về nhà không có tiền. Câu chuyện này dạy chúng ta điều gì? Chúng ta không thể làm hài lòng tất cả mọi người trong xã hội của chúng ta.<br/>Don lời khuyên mọi người, nhưng đặt tiêu chuẩn của riêng bạn.<br/>Chứng minh cho mọi người rằng bạn có thể tự đưa ra quyết định. Nếu không, bạn có thể không có gì cả.",
        "contentTranscript": "<h2>Archie and His Donkey</h2>Old Archie needed some money. He decided to sell his donkey. So he and his son Tom went to town.<br/>It was situated many miles away. Soon, they met a woman. “Where are you going?” she asked.<br/>“To town,” said Archie. “Any smart person would ride the donkey,” she said.<br/>“What are you implying?” Archie asked. “I’m very smart!” Archie wanted to look smart.<br/>So he climbed onto the donkey. Then they continued in the direction of the town.<br/>Further along the road, they met a farmer. “Hello,” said Archie.<br/>“We want to sell this donkey. Do you want to buy it?” “I don’t need a donkey,” said the farmer.<br/>“But if you want my advice, don’t ride it. The donkey needs to be in good physical condition.”<br/>“Good idea,” said Archie. “Tom, I want you to ride it. You’re lighter.”<br/>“Neither you nor your son should ride it. It looks very tired. You should carry the donkey.” suggested the farmer.<br/>“You’re right,” said Archie. “Come on, Tom! We’ll carry it for the final few miles!”<br/>The donkey was very heavy, and they couldn’t maintain a good speed.<br/>They didn’t arrive until late in the evening. At last, they walked into the town.<br/>But there they attracted the attention of some teenage boys. They laughed at Tom and Archie.<br/>They started to throw stones at them. The donkey reacted by kicking.<br/>Tom and Archie dropped the donkey. It fell on the ground and then ran away.<br/>Archie lost his donkey. He went home with no money. What does this story teach us? We cannot please everyone in our society.<br/>Don’t take everyone’s advice, but set your own standards.<br/>Prove to everyone that you can make decisions by yourself. Otherwise, you may end up with nothing at all.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is the main idea of this story?<br/>a. You should always take the advice of older people.<br/>b. Teenage boys are the nicest people in society.<br/>c. You should set your own standards.<br/>d. You should neither ride nor carry a donkey.<br/><br/>2. Why did Archie get on the donkey?<br/>a. The woman implied that he wasn’t smart.<br/>b. The town was situated further away than he had thought.<br/>c. He did not want to climb the final hill.<br/>d. His walking speed was too slow.<br/><br/>3. Why did the farmer suggest carrying the donkey?<br/>a. To attract people’s attention<br/>b. To keep the donkey in good physical condition<br/>c. To maintain their speed<br/>d. To prove that Archie was strong<br/><br/>4. Why did the donkey start kicking?<br/>a. It didn’t want to be carried along the road.<br/>b. It didn’t want to go in the direction of the river.<br/>c. It reacted badly to a group of teenage boys’ teasing.<br/>d. It became very angry at Archie and Tom.<br/><br/>5. What did the teenage boys do when they saw Archie, Tom, and the donkey?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"62\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Prep</strong></td><td style=\"text-align: center;\" width=\"65\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"70\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>attract</td><td>along</td><td>advice</td><td>neither</td><td>final</td></tr><tr><td>climb</td><td>&nbsp;</td><td>attention</td><td>otherwise</td><td>further</td></tr><tr><td>drop</td><td>&nbsp;</td><td>society</td><td>&nbsp;</td><td>physical</td></tr><tr><td>imply</td><td>&nbsp;</td><td>standard</td><td>&nbsp;</td><td>situated</td></tr><tr><td>maintain</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>prove</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>react</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>ride</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>suggest</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-26.json",
        "srcUrlReadingWold": "4k-essential-volume1-26-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-27-02.mp3",
        "contentTranslation": "<h2>Nhện và chim</h2>Đã từng có một con nhện rất lớn. Nếu một lỗi vào trang web của anh ta, anh ta sẽ kiểm tra nó.<br/>Tuy nhiên, anh ấy đã ăn lỗi ngay lập tức. Anh ấy hỏi con bọ một câu hỏi trước.<br/>Nó luôn luôn là một câu đố khó. Nếu câu trả lời lỗi của Bug là chính xác, anh ta sẽ bỏ qua.<br/>Nếu không, anh đã ăn nó. Một ngày nọ, một con chim nhỏ trên hành trình bay vào mạng nhện Spider.<br/>Con nhện không thể tưởng tượng ăn một con chim. Nó thật to! Nhưng cơn đói của anh quá lớn.<br/>Anh nói với con chim, ăn Nếu bạn không thể cho tôi một câu trả lời cụ thể, tôi sẽ ăn bạn. Con chim cười.<br/>Tôi có thể ăn bạn Nhưng con chim đã thực sự sợ hãi. Cô đã sử dụng tất cả năng lượng của mình để cố gắng thoát ra khỏi trang web.<br/>Và một con nhện cắn có thể rất hiệu quả trong việc giết động vật. Hãy làm ơn hãy ăn thịt tôi, chú chim nói.<br/>Tôi muốn thỏa thuận với bạn. Cúc OK, con nhện nói.<br/>Nếu câu trả lời của bạn là đúng, tôi sẽ cho bạn đi. Nếu không, bạn phải cho tôi một món quà. Nó phải là một cái gì đó có giá trị lớn.<br/>Con chim cho biết, bạn có thể chọn bất cứ thứ gì bạn muốn ăn. Tôi sẽ tìm nó cho bạn. Con nhện đồng ý.<br/>Bạn có thể thực hiện một chuyến đi đến bờ biển, sa mạc và những ngọn núi cùng một lúc? Con nhện hỏi.<br/>Con chim hỏi, nơi này có động đất không? Nhưng con nhện không nói gì.<br/>Tôi có thể nhìn thấy những nơi đó khi tôi bay. Có phải ‘bầu trời là câu trả lời đúng? \"Sai!\" con nhện nói.<br/>Câu trả lời là Hawaii! Bây giờ bạn phải tìm một số lỗi cho tôi.<br/>Con nhện trèo lên lưng chim. Họ đã bay và ăn bọ cùng nhau. Họ đã tham quan rừng.<br/>Sau đó, con chim đưa con nhện về nhà. Từ ngày đó, họ là bạn. Và họ không bao giờ cố gắng ăn nhau nữa.",
        "contentTranscript": "<h2>The Spider and the Bird</h2>There was once a very big spider. If a bug got into his web, he would examine it.<br/>However, he didn’t eat the bug right away. He asked the bug a question first.<br/>It was always quite a difficult puzzle. If the bug’s answer was correct, he let it go.<br/>If not, he ate it. One day, a small bird on a journey flew into the spider’s web.<br/>The spider couldn’t imagine eating a bird. It was so big! But his hunger was too great.<br/>He said to the bird, “If you cannot give me a specific answer, I will eat you.” The bird laughed.<br/>“I could eat you!” But the bird was actually scared. She had used all her energy trying to get out of the web.<br/>And a spider’s bite can be very effective in killing animals. “Please don’t eat me,” the bird said.<br/>“I would rather make a deal with you.” “OK,” the spider said.<br/>“If your answer is right, I will let you go. If not, you must give me a gift. It must be something of great value.”<br/>The bird said, “You can pick anything you want to eat. I will find it for you.” The spider agreed.<br/>“Where can you take a trip to the coast, the desert, and the mountains at the same time?” the spider asked.<br/>The bird asked, “Does this place have earthquakes?” But the spider did not say anything.<br/>“I can see those places when I fly. Is the ‘sky’ the right answer?” “False!” said the spider.<br/>“The answer is Hawaii! Now you must find some bugs for me.”<br/>The spider climbed on the bird’s back. They flew and ate bugs together. They took a tour of the forest.<br/>Then the bird took the spider home. From that day on, they were friends. And they never tried to eat each other again.<br/>",
        "readingComprehension": "<h2>Answer the questions.</h2>1. Which is NOT part of the spider’s puzzle?<br/>a. The coast<br/>b. An earthquake<br/>c. A mountain<br/>d. The desert<br/><br/>2. Why does the bird make a deal instead of flying away?<br/>a. Her wings are quite effective in the web.<br/>b. She is too tired from trying to get out of the web.<br/>c. She cannot fly because of her hunger.<br/>d. She would rather take the spider on a trip.<br/><br/>3. What will be the bird’s gift to the spider?<br/>a. A tour of the coast<br/>b. A specific kind of web<br/>c. Anything the spider wants to eat<br/>d. Atrip to anywhere<br/><br/>4. What is the spider’s response to the bird’s answer?<br/>a. Your answer is false!<br/>b. Can you imagine!<br/>c. No deal!<br/>d. That has no value!<br/><br/>5. What is the first thing the spider does when a bug gets into his web?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"78\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"63\"><strong>Adj</strong></td></tr><tr><td>examine</td><td>bite</td><td>actually</td><td>effective</td></tr><tr><td>imagine</td><td>coast</td><td>quite</td><td>false</td></tr><tr><td>&nbsp;</td><td>deal</td><td>rather</td><td>specific</td></tr><tr><td>&nbsp;</td><td>desert</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>earthquake</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>gift</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>hunger</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>journey</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>puzzle</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>tour</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>trip</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>value</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-27.json",
        "srcUrlReadingWold": "4k-essential-volume1-27-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-28-02.mp3",
        "contentTranslation": "<h2>Bữa tiệc</h2>Gia đình Cody đã chuyển đến một ngôi nhà mới. Cha anh có một công việc mới là giáo sư.<br/>Cody thích thị trấn mới của mình, nhưng anh nhớ ông bà của mình. Sinh nhật của mình, Cody muốn tổ chức một bữa tiệc.<br/>Cha anh nói, thưa Có, chúng tôi thậm chí có thể có một ban nhạc chơi! Vào ngày của bữa tiệc, Cody thức dậy và vội vã chuẩn bị sẵn sàng.<br/>Anh bắt đầu kiểm tra danh sách những việc cần làm. Anh ấy đã rất vui mừng! Nhưng rồi anh nhận thấy một điều khủng khiếp.<br/>Có tuyết trên mặt đất và rất nhiều! \"Cha!\" anh hét lên. Ban nhạc Làm thế nào để ban nhạc có thể chơi nhạc cụ của họ bên ngoài?<br/>Bố nói, chúng tôi sẽ chuyển sân khấu vào bên trong. Nó hầu như không vừa trong nhà để xe vì có một số hộp và rác ở đó.<br/>Nhưng khi họ kết thúc, họ nhận được một cuộc gọi từ ban nhạc. Họ không muốn đến trong cơn bão tuyết.<br/>Bố nói, hãy để Let để ai đó thực hiện phép thuật. Nhưng không ai sẽ đến vì tuyết.<br/>Cuối cùng, bố nói, Cody Cody, có quá nhiều tuyết. Chúng tôi cần phải hủy bỏ bữa tiệc.<br/>Có, thưa ngài, Cody Cody buồn bã nói. Sinh ra nó sẽ là một sinh nhật nhàm chán, anh dự đoán.<br/>Cody muốn chia sẻ ngày sinh nhật của mình với ai đó. Anh muốn ở nhà cũ.<br/>Anh muốn gặp ông bà. Nhưng sau đó một cái gì đó đã nhận được sự chú ý của anh ấy. Anh nhận thấy một chiếc xe hơi ở đường lái xe.<br/>Ông bà anh sở hữu một chiếc xe như thế! Cody đã đúng.<br/>Ông bà đến sinh nhật anh! Chúc mừng sinh nhật, Cody! Chúng tôi xin lỗi vì chúng tôi đến trễ.<br/>Nhưng có quá nhiều tuyết. Nó làm cho chúng tôi đi ra khỏi lịch trình. Chúng tôi đã cố gắng để lại một tin nhắn để nói với bạn.<br/>Cody nói với họ những gì đã xảy ra. Tôi xin lỗi, tôi nói ông nội. Tôi đã rất buồn. Nhưng tôi không còn nữa.<br/>Tôi rất vui khi gặp bạn.\" Bố mang ra món quà sinh nhật Cody.<br/>Đó là loại yêu thích của anh ấy, một chiếc sundae với kem đánh trên đầu.<br/>Sau đó, Cody nói với ông bà về thị trấn mới. Đó là sinh nhật tuyệt nhất của anh ấy",
        "contentTranscript": "<h2>The Party</h2>Cody’s family moved to a new house. His dad got a new job as a professor.<br/>Cody liked his new town, but he missed his grandparents. For his birthday, Cody wanted to have a party.<br/>His dad said, “Yes, we could even have a band play!” On the day of the party, Cody woke up and rushed to get ready.<br/>He started to check his list of things to do. He was so excited! But then he noticed something terrible.<br/>There was snow on the ground and lots of it! “Dad!” he yelled. “How can the band play their instruments outside?”<br/>Dad said, “We’ll move the stage inside.” It barely fit within the garage because there were some boxes and garbage there.<br/>But when they finished, they got a call from the band. They did not want to come in the snow storm.<br/>Dad said, “Let’s get someone to perform magic.” But no one would come because of the snow.<br/>Finally, Dad said, “Cody, there’s too much snow. We need to cancel the party.”<br/>“Yes, sir,” Cody said sadly. “It’s going to be a boring birthday,” he predicted.<br/>Cody wanted to share his birthday with someone. He wanted to be at his old home.<br/>He wanted to see his grandparents. But then something got his attention. He noticed a car in the driveway.<br/>His grandparents owned a car like that! Cody was right.<br/>His grandparents came for his birthday! “Happy birthday, Cody! We’re sorry we are late.<br/>But there was so much snow. It made us go off schedule. We tried to leave a message to tell you.”<br/>Cody told them what happened. “I’m sorry,” said Grandpa. “I was sad,” Cody said. “But I’m not anymore.<br/>I’m so happy to see you.” Dad brought out Cody’s birthday treat.<br/>It was his favorite type, a sundae with whipped cream on top.<br/>Then Cody told his grandparents about the new town. It was his best birthday ever.<br/>",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What does Cody’s dad do as a job?<br/>a. His dad is a professor.<br/>b. His dad is in a band.<br/>c. His dad owns a restaurant.<br/>d. His dad does magic shows.<br/><br/>2. What does Cody want for his birthday?<br/>a. A musical instrument<br/>b. A stage to play music on<br/>c. Someone to share it with<br/>d. Everything on his list<br/><br/>3. What does Cody predict will happen?<br/>a. He will have a boring birthday.<br/>b. He will eat ice cream.<br/>c. No one will notice the snow storm.<br/>d. He will have to rush to get ready for the party.<br/><br/>4. What gets Cody’s attention?<br/>a. His dad calling him “sir”<br/>b. The car his grandparents own<br/>c. The stage within the garage<br/>d. That nothing is happening on schedule<br/><br/>5. Why did his grandparents try to leave a message?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Prep</strong></td><td style=\"text-align: center;\" width=\"76\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>cancel</td><td>within</td><td>band</td><td>barely</td><td>boring</td></tr><tr><td>notice</td><td>&nbsp;</td><td>driveway</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>own</td><td>&nbsp;</td><td>garbage</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>predict</td><td>&nbsp;</td><td>instrument</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>rush</td><td>&nbsp;</td><td>list</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>share</td><td>&nbsp;</td><td>magic</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>message</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>professor</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>schedule</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>stage</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>storm</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-28.json",
        "srcUrlReadingWold": "4k-essential-volume1-28-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-29-02.mp3",
        "contentTranslation": "<h2>Thế giới có ánh sáng như thế nào</h2>Chủ tịch của Darkland là một con lợn, một con lợn rất xấu. Ông là một con lợn có tầm quan trọng lớn.<br/>Anh ta giàu có, và anh ta có rất nhiều sức mạnh. Nhưng anh ta có ý với tất cả các loài động vật ở Darkland.<br/>Anh ta giữ tất cả ánh sáng thế giới trong một cái túi. Ông thích giữ cho thế giới mát mẻ và tối tăm.<br/>Ông muốn ngăn chặn sự tiến bộ của thành phố. Các động vật không thể làm việc trong bóng tối.<br/>Ông đã không tôn trọng họ. Ánh sáng của ông là quá tốt cho họ, ông nói.<br/>Chỉ có tôi nên có ánh sáng. Nhưng những con vật cần ánh sáng. Vì vậy, họ quyết định tổ chức một cuộc thi.<br/>Họ muốn tìm con vật thông minh nhất ở Darkland. Con vật đó đã phải đánh cắp ánh sáng từ tổng thống.<br/>Họ quảng cáo sự cạnh tranh ở khắp mọi nơi. Tất cả các động vật đã đến. Các con vật đều thể hiện kỹ năng của mình.<br/>Khán giả theo dõi và sau đó bình chọn cho con vật có kiến ​​thức nhất. Người chiến thắng là một con chim cao tên là Raven.<br/>Họ giao cho anh công việc lấy ánh sáng. Sáng hôm sau, Raven ăn sáng và sau đó rời khỏi nhà.<br/>Làm thế nào tôi có thể nhận được ánh sáng từ tổng thống? Raven nghĩ. Ông cần phải lừa tổng thống bằng cách nào đó.<br/>Sau đó, Raven có một ý tưởng. Raven có thể làm cho giọng nói của mình nghe giống như bất cứ điều gì! Raven bước tới cánh cửa tổng thống.<br/>Anh phát ra âm thanh của một đứa bé đang khóc. Anh khóc rất to. Chẳng mấy chốc, tổng thống đã mở cửa.<br/>\"Hãy yên lặng!\" Tổng thống hét lên. Ngay sau đó, Raven nhanh chóng thực hiện bước đi của mình. Anh bay theo con lợn và tìm thấy cái túi mềm.<br/>Anh lấy nó ra bên ngoài. Mặt trời đã ở trong túi! Raven bay cao và đưa mặt trời lên bầu trời. Tổng thống đã rất tức giận.<br/>Raven lừa anh! Nhưng những con vật khác rất hạnh phúc.<br/>Cuối cùng, họ đã có ánh sáng, tất cả vì suy nghĩ thông minh của Raven.",
        "contentTranscript": "<h2>How the World Got Light</h2>The president of Darkland was a pig—a very bad pig. He was a pig of major importance.<br/>He was rich, and he had a lot of strength. But he was mean to all the animals in Darkland.<br/>He kept all of the world’s light in a bag. He preferred to keep the world cool and dark.<br/>He wanted to stop the progress of the city. The animals couldn’t work in the dark.<br/>He didn’t have any respect for them. “Light is too good for them,” he said.<br/>“Only I should have light.” But the animals needed light. So they decided to hold a competition.<br/>They wanted to find the smartest animal in Darkland. That animal had to steal light from the president.<br/>They advertised the competition everywhere. All the animals came. The animals all showed off their skills.<br/>The audience watched and then voted for the animal with the most knowledge. The winner was a tall bird named Raven.<br/>They assigned him the job of getting light. The next morning, Raven ate breakfast and then left his home.<br/>“How will I gain light from the president?” thought Raven. He needed to trick the president somehow.<br/>Then, Raven had an idea. Raven could make his voice sound like anything! Raven walked up to the president’s door.<br/>He made the sound of a crying baby. He cried very loudly. Soon, the president opened the door.<br/>“Be quiet!” the president yelled. Right then, Raven quickly made his move. He flew by the pig and found the soft bag.<br/>He took it outside. The sun was inside the bag! Raven flew high and put the sun in the sky. The president was very mad.<br/>Raven tricked him! But the other animals were very happy.<br/>At last, they had light—all because of Raven's smart thinking.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. How a big, tall bird gave light to the world<br/>b. A rich president who helped the world stay cool<br/>c. How a competition helped animals gain skills<br/>d. The importance of gaining the president’s respect<br/><br/>2. Why did the pig hide the sun?<br/>a. To let the people assign a job to Raven<br/>b. To bring an audience to see his big house<br/>c. To prevent the animals from voting<br/>d. To stop progress<br/><br/>3. What is NOT true of the president?<br/>a. He kept the sun in a soft bag.<br/>b. He did not like the animals of Darkland.<br/>c. He found a baby outside his house.<br/>d. He became very angry at Raven.<br/><br/>4. How did Raven steal the sun?<br/>a. He used his strength to fight the president for it.<br/>b. He used his knowledge of the area to find it.<br/>c. He made a sound like a baby to make the pig open the door.<br/>d. He advertised a major competition and won it.<br/><br/>5. What was inside the soft bag?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"83\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"68\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>advertise</td><td>audience</td><td>somehow</td><td>cool</td></tr><tr><td>assign</td><td>breakfast</td><td>&nbsp;</td><td>major</td></tr><tr><td>gain</td><td>competition</td><td>&nbsp;</td><td>mean</td></tr><tr><td>prefer</td><td>importance</td><td>&nbsp;</td><td>rich</td></tr><tr><td>vote</td><td>knowledge</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>president</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>progress</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>respect</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>skill</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>strength</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-29.json",
        "srcUrlReadingWold": "4k-essential-volume1-29-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-30-02.mp3",
        "contentTranslation": "<h2>Mèo và bí mật</h2>Trong tiếng Anh, có một thành ngữ phổ biến là hãy để con mèo ra khỏi túi. Nó có nghĩa là để nói một bí mật.<br/>Nhưng thành ngữ này bắt đầu từ đâu? Nó đến từ một phần của nước Anh.<br/>Từ lâu, mọi người ở đó đã đi từ thị trấn này sang thị trấn khác để bán những thứ như rau, quần áo và lợn.<br/>Họ có niềm tin mạnh mẽ về sự trung thực. Họ không thích nói dối. Một ngày nọ, một người đàn ông đã đến trung tâm bộ phận để bán đồ.<br/>Tôi có một con lợn con để bán! Nó thắng được chi phí rất nhiều, anh ấy nói. Anh ta giữ con vật trên đầu.<br/>Phong cách của anh khác với những người trung thực theo phong cách. Ông là một bậc thầy lừa người và nói dối.<br/>Một người phụ nữ tên Beth đã quét con lợn của mình. Anh ta đưa cho cô con lợn lấy một đồng vàng.<br/>Đó là một số tiền rất nhỏ. Beth đưa cho anh ta đồng tiền. Anh bỏ nó vào túi.<br/>Anh đi trước Beth để lấy con lợn. Anh đưa cho cô một cái túi kín và nói, ở đây, con lợn của bạn. Sau đó anh ta rời đi rất nhanh.<br/>Beth nhìn vào bề mặt túi. Nó đã được di chuyển. Cô mở nó ra để cho lợn ra ngoài.<br/>Một con mèo đã ở bên trong! \"Anh ấy đã lừa tôi! Đó là điều đúng đắn, cô nói.<br/>Sau đó, người đàn ông quay lại lừa nhiều người hơn. Beth thấy anh ta và ký ức về con mèo quay trở lại.<br/>Cô nói với bạn bè của mình. Họ ngăn anh lại. Nhưng không ai biết phải làm gì tiếp theo.<br/>Có người nói, chúng tôi cần một người độc lập và công bằng để quyết định điều đó. Họ đã đi đến thẩm phán.<br/>Beth nói với anh ta về con mèo trong túi. Thẩm phán hỏi, có bằng chứng không? Bạn có thể chứng minh làm thế nào anh ấy làm điều đó?<br/>Nhìn vào túi của mình, ông Beth nói. Cô mở nó và để một con mèo ra khỏi túi. Họ đã học được bí mật của người đàn ông, và anh ta đã vào tù.<br/>Đó là cách mà thành ngữ đã để con mèo ra khỏi túi mà ý muốn nói ra một bí mật.",
        "contentTranscript": "<h2>Cats and Secrets</h2>In English, there is a common idiom “let the cat out of the bag.” It means to tell a secret.<br/>But where did this idiom start? It came from a section of England.<br/>Long ago, people there went from town to town to sell things like vegetables, clothes, and pigs.<br/>They had strong beliefs about honesty. They didn’t like lying. One day, a man went to the section’s center to sell things.<br/>“I have a baby pig for sale! It won’t cost much,” he said. He held the animal above his head.<br/>His style was different from honest people’s style. He was a master of tricking people and lying.<br/>A woman named Beth scanned his pig. He offered her the pig for one gold coin.<br/>That was a very small amount. Beth gave him the coin. He put it in his pocket.<br/>He walked ahead of Beth to get the pig. He gave her a closed bag and said, “Here’s your pig.” He then left very quickly.<br/>Beth looked at the bag’s surface. It was moving. She opened it to let the pig out.<br/>A cat was inside! “He tricked me! That isn’t proper,” she said.<br/>Later, the man returned to trick more people. Beth saw him and the memory of the cat came back.<br/>She told her friends. They stopped him. But no one knew what to do next.<br/>Someone said, “We need an independent and fair person to decide that.” They went to the judge.<br/>Beth told him about the cat in the bag. The judge asked, “Is there evidence? Can you demonstrate how he did it?”<br/>“Look in his bag,” said Beth. She opened it and let a cat out of the bag. They learned the man’s secret, and he went to jail.<br/>That’s how the idiom “let the cat out of the bag” came to mean to tell a secret.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is the main idea of this story?<br/>a. It is about a common belief about cats.<br/>b. People should scan evidence carefully.<br/>c. Masters of lying will go to jail.<br/>d. It is about the origin of an idiom.<br/><br/>2. What did Beth say after she was tricked?<br/>a. That’s not proper.<br/>b. That’s a very small amount.<br/>c. Can you demonstrate how he did it?<br/>d. We need an independent and fair person to help.<br/><br/>3. Where did the man hold the pig?<br/>a. In a pocket<br/>b. On the surface of the bag<br/>c. Above his head<br/>d. In the section’s center<br/><br/>4. Why did Beth look at the bag?<br/>a. The surface was moving.<br/>b. The man had a different style.<br/>c. The man was ahead of her.<br/>d. He offered the pig for so little money.<br/><br/>5. When did the memory of the cat come back to Beth?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"87\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Prep</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"88\"><strong>Adj</strong></td></tr><tr><td>cost</td><td>above</td><td>amount</td><td>ahead</td><td>common</td></tr><tr><td>demonstrate</td><td>&nbsp;</td><td>belief</td><td>&nbsp;</td><td>different</td></tr><tr><td>scan</td><td>&nbsp;</td><td>center</td><td>&nbsp;</td><td>independent</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>evidence</td><td>&nbsp;</td><td>proper</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>honesty</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>idiom</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>inside</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>master</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>memory</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>section</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>surface</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-30.json",
        "srcUrlReadingWold": "4k-essential-volume1-30-01.mp3"
    }
]