[
    {
        "srcUrl": "4k-essential-volume1-19-02.mp3",
        "contentTranslation": "<h2>Đắm tàu</h2>Simon Yates là một luật sư. Anh giúp đỡ nhiều người. Tuy nhiên, anh không phải là một người đàn ông tốt.<br/>Chính sách của ông là chỉ giúp đỡ những người giàu. Anh ấy đã không bận tâm về sự bất công xã hội.<br/>Anh ta kiếm được rất nhiều tiền, nhưng nhiều người đã không thích anh ta. Ngay cả những người trong đội ngũ nhân viên của anh ấy cũng không thích anh ấy.<br/>Họ muốn những điều xấu xảy ra với anh ta. Trên thực tế, họ rất vui khi anh gặp rắc rối.<br/>Simon đã có một ngày rất tồi tệ. Anh ấy đã làm nhiều điều sai trái và mất việc.<br/>Chẳng mấy chốc, anh đã không có tiền. Vợ ông, bà Yates, bắt đầu nghi ngờ về ông.<br/>Simon muốn bắt đầu một cuộc sống mới. Anh định rời khỏi đất nước.<br/>Ông đề cập kế hoạch của mình với thuyền trưởng của một con tàu. Thuyền trưởng đang khám phá thế giới.<br/>Thuyền trưởng cảm thấy tồi tệ với Simon và nói, tôi sẽ đưa bạn đến nước ngoài. Họ đã rời đi vào ngày hôm sau.<br/>Gần kết thúc chuyến đi quốc tế của họ, thời tiết trở nên tồi tệ.<br/>Một con sóng đẩy Simon ra khỏi thuyền. Nhưng anh vẫn còn sống. Anh bơi về phía một hòn đảo.<br/>Sau một thời gian dài anh ấy đã đến đó. Lúc đầu anh buồn bã. Anh lạc lối và cô đơn.<br/>Tôi không bao giờ về nhà nữa, anh nghĩ. Anh ấy đã có rất nhiều vấn đề, nhưng anh ấy đã sống sót.<br/>Ông đã xây một ngôi nhà trên cây. Ông sống bằng chế độ ăn kiêng. Ông làm công cụ từ gỗ và xương.<br/>Anh làm cốc để uống nước mưa. Dần dần anh học được cách hạnh phúc trên đảo.<br/>Anh ấy bơi lội mỗi ngày. Đôi khi anh gặp rắc rối, nhưng anh luôn tìm cách khắc phục vấn đề.<br/>Cuộc sống thật đơn giản. Anh thích nó. Cuối cùng, mọi người trên một con tàu đã nhìn thấy Simon trên đảo.<br/>Họ muốn đưa anh về nhà. Nhưng Simon rất vui. Ông đã cho họ một bài phát biểu dài về cuộc sống.<br/>Anh nói anh muốn ở lại. Anh thích cuộc sống mới, đơn giản của mình hơn cuộc sống cũ.",
        "contentTranscript": "<h2>Shipwrecked</h2>Simon Yates was a lawyer. He helped many people. However, he was not a nice man.<br/>His policy was to help only rich people. He didn’t bother about social injustice.<br/>He made a lot of money, but many people didn’t like him. Even people on his staff didn’t like him.<br/>They wanted bad things to happen to him. In fact, they were glad when he got into trouble.<br/>Simon had a very bad day. He did many things wrong and lost his job.<br/>Soon, he didn’t have any money. His wife, Mrs. Yates, began to have doubts about him.<br/>Simon wanted to start a new life. He planned to leave the country.<br/>He mentioned his plan to the captain of a ship. The captain was exploring the world.<br/>The captain felt bad for Simon and said, “I will take you to foreign countries.” They left the next day.<br/>Near the conclusion of their international trip, the weather turned bad.<br/>A wave pushed Simon off the boat. But he was alive. He swam toward an island.<br/>After a longtime he got there. At first he was upset. He was lost and alone.<br/>“I’ll never go home again,” he thought. He had a lot of problems, but he survived.<br/>He built a house in a tree. He lived on a diet offish. He made tools from wood and bones.<br/>He made a cup to drink rainwater. Slowly he learned to be happy on the island.<br/>He swam every day. He had trouble sometimes, but he always found a way to fix the problem.<br/>Life was simple. He liked it. Finally, people on a ship saw Simon on the island.<br/>They wanted to take him home. But Simon was happy. He gave them a long speech about life.<br/>He said he wanted to stay. He liked his new, simple life more than his old life.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. How the captain of a ship explored foreign places<br/>b. How a lawyer stayed alive alone on an island<br/>c. Why a man and a woman went on an international trip<br/>d. Why it is a good policy to worry about social problems<br/><br/>2. Why does Simon not stay on the boat?<br/>a. The staff do not like him.<br/>b. He wants to swim toward an island.<br/>c. A wave pushes him off the ship.<br/>d. He does not like the diet of only fish.<br/><br/>3. How does Simon stay alive on the island?<br/>a. He makes tools from bones and wood.<br/>b. He makes clothes from a tree.<br/>c. He eats food from the trees.<br/>d. He uses a cup to drink seawater.<br/><br/>4. What did Simon mention in his speech?<br/>a. He wanted to see Mrs. Yates.<br/>b. He was unhappy to be alone.<br/>c. He was glad to be on the island.<br/>d. He had doubts about staying on the island.<br/><br/>5. What happens nearthe conclusion of Simon’s trip?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Prep</strong></td><td style=\"text-align: center;\" width=\"73\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"88\"><strong>Adj</strong></td></tr><tr><td>bother</td><td>toward</td><td>bone</td><td>however</td><td>alive</td></tr><tr><td>explore</td><td>&nbsp;</td><td>captain</td><td>&nbsp;</td><td>foreign</td></tr><tr><td>mention</td><td>&nbsp;</td><td>conclusion</td><td>&nbsp;</td><td>glad</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>doubt</td><td>&nbsp;</td><td>international</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>injustice</td><td>&nbsp;</td><td>social</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>lawyer</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>policy</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>speech</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>staff</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>wood</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-19.json",
        "srcUrlReadingWold": "4k-essential-volume1-19-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-20-02.mp3",
        "contentTranslation": "<h2>Bảy thành phố vàng</h2>Nhiều năm trước, một sĩ quan Tây Ban Nha tên là corado đã nghe câu chuyện về các thành phố sevengreat.<br/>Các bức tường của những thành phố này được làm bằng vàng.<br/>Người dân ăn thịt từ những chiếc đĩa vàng và mặc quần áo đẹp, họ nói.<br/>Họ gọi những thành phố này là Bảy thành phố vàng. Các thành phố có thật không? Coronado không bao giờ xem xét hỏi bạn bè của mình.<br/>Coronado nghĩ thầm, những thứ ở những thành phố này phải đáng giá rất nhiều tiền.<br/>Vì vậy, ông đã đi tìm Bảy thành phố vàng. Anh ta mang theo ba trăm người, nhiều ngựa và thêm thức ăn.<br/>Họ đi về phía tây. Coronado muốn đạt được mục tiêu của mình rất tệ. Coronado và người đàn ông của mình cưỡi ngựa trong nhiều ngày.<br/>Sau đó, họ thấy một số thành phố. Chúng tôi đã tìm thấy bảy thành phố vàng! Người đàn ông của anh hét lên, nhưng coronado không vui.<br/>Ông có một ý kiến ​​khác. Những người này có thể là một trong bảy thành phố vàng, ông nói.<br/>Nhìn, họ làm bằng đất! Coronado đã đúng. Các thành phố weren sáng và vàng.<br/>Chúng bẩn và nâu. Người dân không ăn thịt từ đĩa vàng.<br/>Họ ăn rau từ bát thường xuyên. Họ mặc những bộ quần áo cơ bản nhất.<br/>Coronado coi các thành phố là những nơi xấu xí. Những gì đã xảy ra với các thành phố vàng? anh ta đã nghĩ.<br/>Có ai phá hủy chúng không? Có chiến tranh không? Có ai đó đã đến và lấy vàng chưa?<br/>Đêm đó, người dân thành phố đã chiêu đãi coronado và người của anh ta và phục vụ họ thức ăn.<br/>Họ khuyên coronado về nhà. Ở đây không có vàng. Họ nói với anh ấy.<br/>Coronado đã tức giận. Có phải bạn bè của anh ta nói dối anh ta? Anh rời đi vào sáng hôm sau.<br/>Anh nhìn lại các thành phố một lần nữa. Mặt trời phản chiếu ánh sáng bụi bẩn nhà cửa.<br/>Coronado nghĩ rằng anh ta thấy một chút vàng. Rốt cuộc là bạn của anh ấy?<br/>Không, anh nói với chính mình. Cẩu Nó chỉ là mặt trời. Rồi anh quay đi và về nhà.",
        "contentTranscript": "<h2>The Seven Cities of Gold</h2>Many years ago, a Spanish officer named Coronado heard the story of sevengreat cities.<br/>“The walls of these cities are made of gold” his friends told him.<br/>“The people eat meat from golden plates and dress in nice clothes” they said.<br/>They called these cities the Seven Cities of Gold. Were the cities real? Coronado never considered asking his friends.<br/>Coronado thought to himself, “The things in these cities must be worth a lot of money.”<br/>So he went to find the Seven Cities of Gold. He took along three hundred men, many horses, and extra food.<br/>They headed west. Coronado wanted to achieve his goal very badly. Coronado and his men rode for many days.<br/>Then they saw some cities. “We found the Seven Cities of Gold!” his men yelled, but Coronado wasn’t happy.<br/>He had a different opinion. “These can’t be the Seven Cities of Gold,” he said.<br/>“Look, they’re made of dirt!” Coronado was right. The cities weren’t bright and golden.<br/>They were dirty and brown. The people didn’t eat meat from golden plates.<br/>They ate vegetables from regular bowls. They wore the most basic clothes.<br/>Coronado regarded the cities as ugly places. “What happened to the cities of gold?” he thought.<br/>“Did someone destroy them? Was there a war? Did someone already come and take the gold?”<br/>That night, the people of the cities entertained Coronado and his men and served them food.<br/>They advised Coronado to go home. “There is no gold here” they told him.<br/>Coronado was angry. Did his friends lie to him? He left the next morning.<br/>He looked back at the cities one more time. The sun reflected light dirt houses.<br/>Coronado thought he saw a bit of gold. Were his friends right after all?<br/>“No,” he told himself. “It’s just the sun.” Then he turned away and went home.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. A man who achieves his goal<br/>b. An officer who looks for cities of gold<br/>c. Men who destroy cities<br/>d. People who entertain and serve<br/><br/>2. What did Coronado NOT consider asking his friends?<br/>a. How much money the cities were worth<br/>b. If the people of the cities ate meat<br/>c. If the Seven Cities of Gold were real<br/>d. How much extra food to take west<br/><br/>3. Why was Coronado unhappy when he saw the cities?<br/>a. They were not made of gold.<br/>b. They were at war with each other.<br/>c. Someone destroyed them.<br/>d. He had already been to the cities.<br/><br/>4. What did the people of the cities advise Coronado to do?<br/>a. Eat basic vegetables<br/>b. Go home<br/>c. Regard the cities as dirty places<br/>d. Talk about his opinion of the cities<br/><br/>5. What did Coronodo do when he thought he saw a bit of gold on the houses?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"69\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>achieve</td><td>bit</td><td>already</td><td>basic</td></tr><tr><td>advise</td><td>goal</td><td>&nbsp;</td><td>extra</td></tr><tr><td>consider</td><td>meat</td><td>&nbsp;</td><td>real</td></tr><tr><td>destroy</td><td>opinion</td><td>&nbsp;</td><td>worth</td></tr><tr><td>entertain</td><td>vegetable</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>lie</td><td>war</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>reflect</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>regard</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>serve</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-20.json",
        "srcUrlReadingWold": "4k-essential-volume1-20-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-21-02.mp3",
        "contentTranslation": "<h2>Katy</h2>Lần đầu tiên tôi gặp Katy 8 tuổi vào một buổi chiều mưa. Tôi là một y tá tại một bệnh viện.<br/>Nhân viên bán hàng ở bàn nói với tôi về Katy. Cô ấy ở đó vì cảm thấy rất đau đớn.<br/>Các bác sĩ đặt một vấn đề ở đáy não của cô.<br/>Tôi biết cô ấy thật đặc biệt, thậm chí trước khi cô ấy khỏe lại. Tôi luôn luôn nhớ Katy như một anh hùng.<br/>Khi tôi vào phòng Katy, cô ấy không ở trên giường. Cô ngồi trên ghế cạnh Tommy, một cậu bé.<br/>Mặc dù Katy cảm thấy không khỏe, cô vẫn chơi với Tommy và đồ chơi của anh.<br/>Cô ấy đã mất rất nhiều nỗ lực chỉ để ngồi trên ghế. Nhưng cô chơi với Tommy vì điều đó làm anh hạnh phúc.<br/>Katy luôn mỉm cười và không bao giờ tỏ ra đau đớn. Cô từ chối chỉ nằm trên giường.<br/>Một ngày nọ tôi thấy cô ấy vẽ một bức tranh. Sau đó, cô đưa nó cho một trong những bệnh nhân lớn tuổi.<br/>Một hôm khác cô đi ra ngoài để lấy hoa cho một cô bé ốm yếu khác.<br/>Katy làm mọi người mỉm cười. Các bác sĩ vội vàng khắc phục sự cố trong não Katy,.<br/>Ca phẫu thuật đã thành công! Các bác sĩ thông báo cho nhân viên bệnh viện tin tốt.<br/>Katy vẫn ổn. Cô sớm cảm thấy xuất sắc. Cô đã khỏe hơn và có thể rời bệnh viện một tháng sau đó.<br/>Tôi đã có một sự nghiệp lâu dài là một y tá. Tôi đã gặp nhiều bệnh nhân.<br/>Tuy nhiên, tôi chưa bao giờ gặp một cô gái khác như Katy. Ngay cả sau khi cô khỏe lại, cô vẫn đến bệnh viện.<br/>Cô đã chơi nhiều trò chơi với các bệnh nhân trẻ tuổi. Cô đọc nhiều sách cho các bệnh nhân lớn tuổi.<br/>Trái tim nhân hậu của Katy đã giúp cô ấy khỏe lại rất nhanh. Cô ấy là một anh hùng đối với tôi và mọi người khác tại bệnh viện.",
        "contentTranscript": "<h2>Katy</h2>I first met 8-year-old Katy on a rainy afternoon. I was a nurse at a hospital.<br/>The clerk at the desk told me about Katy. She was there because she felt a lot of pain.<br/>The doctors located a problem at the base of her brain.<br/>I knew she was special, even before she got better. I’ll always remember Katy as a hero.<br/>When I entered Katy’s room, she was not in her bed. She was in a chair next to Tommy, a little boy.<br/>Though Katy did not feel well, she was playing with Tommy and his toys.<br/>It took a lot of effort for her just to sit in the chair. But she played with Tommy because it made him happy.<br/>Katy was always smiling and never appeared to be in pain. She refused to just lie in bed.<br/>One day I found her painting a picture. Later, she gave it to one of the older patients.<br/>Another day she went outside to get flowers for another sick little girl.<br/>Katy made everyone smile. The doctors hurried to fix the problem in Katy’s brain.<br/>The operation was successful! The doctors informed the hospital staff of the good news.<br/>Katy was fine. She soon felt excellent. She got better and was able to leave the hospital a month later.<br/>I have had a long career as a nurse. I have met many patients.<br/>However, I have never met another girl like Katy. Even after she got well, she still came to the hospital.<br/>She played various games with the young patients. She read many books to the older patients.<br/>Katy’s kind heart helped her get better so quickly. She is a hero to me and everyone else at the hospital.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. A clerk with a brain problem<br/>b. A little girl who is a hero<br/>c. A little girl who wants a career as a nurse<br/>d. Tommy and his various toys<br/><br/>2. Why does everyone like Katy?<br/>a. She does good things, even though she is in pain.<br/>b. She enters the hospital and saves a patient’s life.<br/>c. She has a problem at the base of her brain.<br/>d. She hurries to help the clerk at his desk.<br/><br/>3. Which of the following is true at the end of the story?<br/>a. Katy refuses to go back to the hospital.<br/>b. Katy makes an effort to become a nurse.<br/>c. Katy feels excellent but goes back to the hospital to see other patients.<br/>d. Katy informs other patients of how to get better.<br/><br/>4. How did the nurse know Katy did not feel well?<br/>a. Katy appeared to be sad.<br/>b. Katy had to make an effort just to sit in a chair.<br/>c. The nurse located a problem in Katy’s brain.<br/>d. The nurse asked Katy how she felt.<br/><br/>5. What does Katy do to help people?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"68\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Conj</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"65\"><strong>Adj</strong></td></tr><tr><td>appear</td><td>base</td><td>though</td><td>later</td><td>excellent</td></tr><tr><td>enter</td><td>brain</td><td>&nbsp;</td><td>&nbsp;</td><td>various</td></tr><tr><td>hurry</td><td>career</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>inform</td><td>clerk</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>leave</td><td>effort</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>locate</td><td>hero</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>refuse</td><td>nurse</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>operation</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>pain</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-21.json",
        "srcUrlReadingWold": "4k-essential-volume1-21-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-22-02.mp3",
        "contentTranslation": "<h2>Phần thưởng tốt hơn</h2>Jenny giao thức ăn cho một nhà hàng. Cô đọc báo và nói, Ngay Uh oh. Có một câu chuyện về một tên trộm.<br/>Anh ta đã đánh cắp thức ăn, và không ai nhìn thấy anh ta. Ngay cả cảnh sát cũng không thể bắt được anh ta. Jenny có chút sợ hãi.<br/>Cô làm việc gần khu vực đó. Tờ báo có một tin nhắn từ cảnh sát: Nếu có bất cứ điều gì lạ xảy ra, hãy gọi cho chúng tôi.<br/>Nếu bạn giúp chúng tôi bắt được kẻ trộm, bạn sẽ kiếm được phần thưởng. Jenny đã nói chuyện với Jim. Anh quản lý nhà hàng.<br/>Bạn có biết gì về tên trộm không? Có, anh nói. Tuy nhiên, anh ta ăn cắp nhiều hơn một người có thể ăn.<br/>Và tại sao thiên đường lại cảnh sát ngăn chặn anh ta chưa? Nó là một bí ẩn. Nếu bạn nhìn thấy anh ta, liên hệ với cảnh sát.<br/>Don xông chạy theo anh. Jenny lái xe đến một nhà khách hàng. Cô bỏ xe và mở cổng vào nhà.<br/>Nhưng sau đó cô nghe thấy một tiếng động bằng xe của mình. Cô hét lên, ăn trộm! Cô ấy không sợ.<br/>Cô muốn phần thưởng! Cô ấy đã làm ngược lại với những gì Jim nói với herto.<br/>Này, Hey, cô hét lên. \"Quay lại đây!\" Cô đặt thức ăn xuống đất và chạy đến xe của mình.<br/>Nhưng tên trộm đã bỏ đi với thức ăn. Jenny theo một tiếng ồn xung quanh góc.<br/>Cô ngạc nhiên. Cô thấy một con chó và một vài con chó con. Họ đang ăn thức ăn của cô ấy! Họ trông gầy gò và sợ hãi.<br/>Tên trộm thực tế chỉ là một con chó. Cô ấy cho chó con ăn, cô ấy nói.<br/>Tại đó, cô ấy ăn trộm rất nhiều thức ăn. Jenny cảm thấy tồi tệ. Cô cố gắng an ủi những con chó bằng một đĩa thức ăn khác.<br/>Sau đó, cô đưa họ trở lại cửa hàng. Mọi người ở đó đưa một con chó con về nhà. Jenny gọi cảnh sát.<br/>Cô nói với họ rằng không có tên trộm thực sự. Jenny đã làm điều đó để nhận phần thưởng nữa. Cô ấy nói, đó chỉ là một con chó.<br/>Nhưng ở đó, Voi không mất phí khi bắt được tên trộm này. Con chó mới của tôi là một phần thưởng tốt hơn.",
        "contentTranscript": "<h2>A Better Reward</h2>Jenny delivered food for a restaurant. She read the newspaper and said, “Uh oh.” There was a story about a thief.<br/>He stole food, and no one had seen him. Even the police couldn’t catch him. Jenny was a little scared.<br/>She worked close to that area. The newspaper included a message from the police: “If anything strange occurs, call us.<br/>If you help us catch the thief, you’ll earn a reward.” Jenny talked to Jim. He managed the restaurant.<br/>“Do you know about the thief?” “Yes,” he said. “But he steals more than one person can eat.<br/>And why haven’t the police stopped him yet? It’s a mystery. If you see him, contact the police.<br/>Don’t run after him.” Jenny drove to a customer’s house. She left her car and opened the gate to the house.<br/>But then she heard a noise by her car. She yelled, “Thief!” She wasn’t scared.<br/>She wanted the reward! She did the opposite of what Jim told herto do.<br/>“Hey,” she yelled. “Get back here!” She set the food on the ground and ran to her car.<br/>But the thief had already left with the food. Jenny followed a noise around the corner.<br/>She was amazed. She saw a dog and some puppies. They were eating her food! They looked thin and scared.<br/>“The actual thief is just a dog. She’s feeding her puppies,” she said.<br/>“That’s why she steals so much food.” Jenny felt bad. She tried to comfort the dogs with another plate of food.<br/>Then she took them back to the store. Everyone there took a puppy home. Jenny called the police.<br/>She told them there was no real thief. Jenny didn’t do it to receive the reward anymore. She said, “It was just a dog.<br/>But there’s no charge for catching this ‘thief,’” she said. “My new dog is a better reward.”",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. A dog that steals a plate<br/>b. A man who tells a mystery<br/>c. A man who writes for a newspaper<br/>d. A girl who delivers food<br/><br/>2. Why did Jenny decide to run after the thief?<br/>a. She wanted to earn the reward.<br/>b. She knew that there was no actual thief.<br/>c. She always did the opposite of what Jim said.<br/>d. She wanted to charge a customer for that food.<br/><br/>3. What was true of Jim?<br/>a. He tried to comfort Jenny with food.<br/>b. He told Jenny that she should contact the police.<br/>c. He wrote a story that included a message from the police.<br/>d. He received a reward because he managed the store.<br/><br/>4. How did Jenny act when she heard the noise?<br/>a. She was amazed by the noise.<br/>b. She followed it around the corner.<br/>c. She ran through the gate to get away from it.<br/>d. She set the food on a table and ran to her car.<br/><br/>5. What did the police say to do if something strange occured?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\"><strong>Verb</strong></td><td style=\"text-align: center;\"><strong>Noun</strong></td><td style=\"text-align: center;\"><strong>Adj</strong></td></tr><tr><td>amaze</td><td>charge</td><td>actual</td></tr><tr><td>comfort</td><td>customer</td><td>&nbsp;</td></tr><tr><td>contact</td><td>gate</td><td>&nbsp;</td></tr><tr><td>deliver</td><td>mystery</td><td>&nbsp;</td></tr><tr><td>earn</td><td>opposite</td><td>&nbsp;</td></tr><tr><td>include</td><td>plate</td><td>&nbsp;</td></tr><tr><td>manage</td><td>reward</td><td>&nbsp;</td></tr><tr><td>occur</td><td>thief</td><td>&nbsp;</td></tr><tr><td>receive</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>set</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>steal</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-22.json",
        "srcUrlReadingWold": "4k-essential-volume1-22-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-23-02.mp3",
        "contentTranslation": "<h2>Trại</h2>Stacie muốn ở tại một khách sạn đẹp để nghỉ mát. Nhưng cha mẹ cô đã gửi cô đến một trại khủng khiếp thay thế.<br/>Đối với bữa sáng, Stacie thích nước trái cây tươi và sữa sô cô la, nhưng cô đã lấy nước ở trại.<br/>Buổi chiều cô muốn viết thơ, nhưng cô phải bơi.<br/>Trại gần một sân bay với những chiếc máy bay ồn ào. Nhện treo trên giường cô.<br/>Đối với cô, hành vi trung bình của những đứa trẻ rất tệ. Không có cô gái nào phù hợp với tính cách của cô.<br/>Cô ghét nó. Một ngày nọ, họ có một lớp học. Bài tập tinh thần nghe có vẻ tốt với Stacie.<br/>Nhưng đó là một khóa học về an toàn nước. Họ đã học được cách trở thành hành khách an toàn trên thuyền.<br/>Stacie didn không bao giờ lên kế hoạch đi thuyền. Ngày hôm sau, họ chơi một trò chơi.<br/>Có một đội màu đỏ và một đội màu xanh. Stacie ở trong đội màu xanh.<br/>Mỗi đội phải cố gắng gỡ cờ đội khác khỏi cột.<br/>Họ cũng phải sử dụng súng nước. Tôi không nói gì nhiều về vận động viên, cô nói.<br/>Nhưng cô vẫn phải chơi. Stacie lấy một khẩu súng nước và tìm nơi nào đó để trốn.<br/>Một cậu bé cho biết, St Stieie, bạn tiến lên giữa. Tôi sẽ đi ngay.<br/>Hai người đó sẽ đi bên trái. Stacie vẫn không muốn chơi.<br/>Cô đi vào rừng và thấy một cầu thủ đội đỏ đến.<br/>Stacie trốn sau một cái cây và sau đó nhảy ra và bắn người chơi khác. Đây là một niềm vui Stacie nghĩ.<br/>Vài phút sau khi tiến xa hơn, Stacie nhìn thấy lá cờ đỏ.<br/>Một thành viên đội đỏ đang theo dõi nó. Cô bắn anh bằng súng nước.<br/>Sau đó, cô hạ cờ và chạy về đội của mình. \"Tôi hiểu rồi!\" cô ta đã hét lên.<br/>Đội xanh đã thắng! Stacie là anh hùng.<br/>Trong phần còn lại của tuần, Stacie vui vẻ. Cô thậm chí còn kết bạn mới.",
        "contentTranscript": "<h2>The Camp</h2>Stacie wanted to stay at a nice hotel for vacation. But her parents sent her to a terrible camp instead.<br/>For breakfast, Stacie liked fresh juice and chocolate milk, but she got water at the camp.<br/>In the afternoon she wanted to write poems, but she had to swim.<br/>The camp was near an airport with loud planes. Spiderwebs hung over her bed.<br/>To her, the kids’ average behavior was very bad. No girl matched her personality.<br/>She hated it. One day, they had a class. Mental exercise sounded good to Stacie.<br/>But it was a course on water safety. They learned how to be safe passengers on a boat.<br/>Stacie didn’t ever plan to go on a boat. The next day, they played a game.<br/>There were a red team and a blue team. Stacie was on the blue team.<br/>Each team had to try to remove the other team’s flag from a pole.<br/>They also had to use water guns. “I’m not much of an athlete,” she said.<br/>But she still had to play. Stacie took a water gun and looked for somewhere to hide.<br/>A boy said, “Stacie, you advance to the middle. I will go right.<br/>Those two will go left.” Stacie still didn’t want to play.<br/>She walked into the forest and saw a red team player coming.<br/>Stacie hid behind a tree and then jumped out and shot the other player. “This is fun!” Stacie thought.<br/>Several minutes after advancing further, Stacie saw the red flag.<br/>A red team member was watching over it. She shot him with her water gun.<br/>Then she lowered the flag and ran back to her team. “I got it!” she yelled.<br/>The blue team won! Stacie was the hero.<br/>For the rest of the week, Stacie had fun. She even made new friends.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. How did Stacie win the game?<br/>a. She advanced to the right.<br/>b. She lowered the red team’s flag.<br/>c. She hit the red team with her water gun.<br/>d. She swam all afternoon.<br/><br/>2. Because of her personality, what would Stacie likely NOT want to do?<br/>a. Read a poem<br/>b. Play a mental game<br/>c. Become an athlete<br/>d. Stay at a nice hotel<br/><br/>3. Instead of camp, where did Stacie want to be?<br/>a. At a fancy hotel<br/>b. At the airport<br/>c. On a boat as a passenger<br/>d. With an average student<br/><br/>4. What did Stacie start to like about the camp?<br/>a. The other kids’ behavior<br/>b. Having chocolate milk<br/>c. Spider webs over her bed<br/>d. Beating the red team<br/><br/>5. What was Stacie’s course about?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Prep</strong></td><td style=\"text-align: center;\" width=\"77\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>advance</td><td>behind</td><td>athlete</td><td>average</td></tr><tr><td>lower</td><td>&nbsp;</td><td>behavior</td><td>mental</td></tr><tr><td>match</td><td>&nbsp;</td><td>course</td><td>&nbsp;</td></tr><tr><td>remove</td><td>&nbsp;</td><td>member</td><td>&nbsp;</td></tr><tr><td>shoot</td><td>&nbsp;</td><td>passenger</td><td>&nbsp;</td></tr><tr><td>sound</td><td>&nbsp;</td><td>personality</td><td>&nbsp;</td></tr><tr><td>swim</td><td>&nbsp;</td><td>poem</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>pole</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>safety</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>&nbsp;</td><td>web</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-23.json",
        "srcUrlReadingWold": "4k-essential-volume1-23-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-24-02.mp3",
        "contentTranslation": "<h2>Một tình bạn bền chặt</h2>Tim là người đàn ông mạnh nhất trong thị trấn. Khi anh ấy chơi thể thao, anh ấy luôn thắng.<br/>Anh biểu diễn và tập thể dục trong công viên. Anh ấy đã làm điều này để cho mọi người thấy anh ấy mạnh mẽ như thế nào.<br/>Hầu hết mọi người thích anh ấy, nhưng một người đàn ông đã làm. Tên anh ấy là Jack. Jack ghét Tim.<br/>Jack là một nhà phê bình phim và là người đàn ông thông minh nhất trong thị trấn. Anh ta có thể giải các bài toán phức tạp.<br/>Nhưng không ai quan tâm. Jack muốn nổi tiếng như Tim.<br/>Một ngày nọ, có một sự kiện bất thường. Một cơn bão lớn ập đến bất ngờ. Tuyết phủ kín thị trấn.<br/>Không ai có thể thoát ra. Họ cần thức ăn.<br/>Người ta nói, Đây là nhiệm vụ của một người đàn ông mạnh mẽ. Tim đã chịu áp lực để cứu họ.<br/>Nhưng Jack muốn trở thành anh hùng, nên cả hai cùng đi.<br/>Tim nói, bạn có thể giúp bạn vì bạn không đủ sức. Nhưng Jack đã tìm thấy một số lối đi nhỏ dưới tuyết.<br/>Một trong số họ dẫn đến một thị trấn khác. Thị trấn đó có thức ăn.<br/>Vì Tim quá to lớn và mạnh mẽ, anh ta gần như không thể phù hợp với bên trong.<br/>Họ đi bộ cho đến khi có một khối băng cản đường họ.<br/>Jack nói, chúng tôi có thể vượt qua nó. Nhưng nếu bạn tấn công nó, nó có thể phá vỡ. Tim biết rằng có thể xảy ra.<br/>Anh ấy đã phá vỡ nó. Khi có nhiều khối băng hơn, Tim đã phá vỡ chúng. Điều đó làm anh mệt mỏi.<br/>Anh không thể đi bộ nữa. Jack cho biết, hãy để Let đoàn kết và hỗ trợ lẫn nhau.<br/>Tôi sẽ nhận thức ăn một mình. Bạn nghỉ ngơi tại đây. Jack trở lại với thức ăn.<br/>Tim không thể nhớ được lối đi nào dẫn về nhà. Anh cần Jack làm người dẫn đường.<br/>Những người đàn ông trở thành bạn bè bằng cách làm việc cùng nhau. Trong thị trấn, mọi người nhìn thấy Jack với thức ăn và cổ vũ.<br/>Họ gọi Jack là anh hùng. Nhưng Jack đã không quan tâm. Anh đang nghĩ về điều gì khác.<br/>Anh nói với Tim, tôi nghĩ tôi thông minh, nhưng tôi đã học được một thuật ngữ mới ngày hôm nay: tình bạn.",
        "contentTranscript": "<h2>A Strong Friendship</h2>Tim was the strongest man in the town. When he played sports, he always won.<br/>He performed and exercised in the public park. He did this to show everyone how strong he was.<br/>Most people liked him, but one man didn’t. His name was Jack. Jack hated Tim.<br/>Jack was a movie critic and the smartest man in town. He could solve complex math problems.<br/>But no one cared. Jack wanted to be famous like Tim.<br/>One day, there was an unusual event. A big storm came suddenly. Snow covered the town.<br/>No one could get out. They needed food.<br/>The people said, “This is a task for a strong man.” Tim was under pressure to save them.<br/>But Jack wanted to be the hero, so they both went.<br/>Tim said, “You can’t help because of your lack of strength.” But Jack found some small passages under the snow.<br/>One of them led toward another town. That town had food.<br/>Because Tim was so big and strong, he almost couldn’t fit inside.<br/>They walked until there was a block of ice in their way.<br/>Jack said, “We can’t get past it. But if you strike it, it might break.” Tim knew that was probable.<br/>He broke it. When there were more ice blocks, Tim broke them. That made him tired.<br/>He couldn’t walk anymore. Jack said, “Let’s unite and support each other.<br/>I’ll get the food alone. You rest here.” Jack came back with food.<br/>Tim couldn’t remember which passage led home. He needed Jack to be his guide.<br/>The men became friends by working together. In town, people saw Jack with the food and cheered.<br/>They called Jack a hero. But Jack didn’t care. He was thinking of something else.<br/>He said to Tim, “I thought I was smart, but I learned a new term today: friendship.”",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is the main idea of this story?<br/>a. The best way to strike blocks<br/>b. How a strong man learned a new term<br/>c. How two men unite and support each other<br/>d. Howto solve complex problems<br/><br/>2. How did Tim show people he was strong?<br/>a. He struck the critic in front of them.<br/>b. He performed and exercised in public places.<br/>c. He found a passage in the snow.<br/>d. He lifted a block of ice for them.<br/><br/>3. Why did Jack become a hero?<br/>a. He fit inside the passage.<br/>b. He brought food to the town.<br/>c. He put pressure on Tim to save the town.<br/>d. He won every sport he played.<br/><br/>4. What did Tim thinkwhile in the passage?<br/>a. He thought breaking the ice was probable.<br/>b. He thought the storm was an unusual event.<br/>c. He thought he was a good guide for Jack.<br/>d. He thought it was a very difficult task.<br/><br/>5. What happened when Jack was called a hero?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"59\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"71\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>cheer</td><td>block</td><td>complex</td></tr><tr><td>exercise</td><td>critic</td><td>probable</td></tr><tr><td>fit</td><td>event</td><td>public</td></tr><tr><td>perform</td><td>friendship</td><td>&nbsp;</td></tr><tr><td>strike</td><td>guide</td><td>&nbsp;</td></tr><tr><td>support</td><td>lack</td><td>&nbsp;</td></tr><tr><td>unite</td><td>passage</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>pressure</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>task</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>term</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-24.json",
        "srcUrlReadingWold": "4k-essential-volume1-24-01.mp3"
    }
]