[
    {
        "srcUrl": "4k-essential-volume1-07-02.mp3",
        "contentTranslation": "<h2>Hoàng tử tốt nhất</h2>Vua Minos bị bệnh nặng. Tình trạng của ông ngày càng tồi tệ. Ông có ba người con trai.<br/>Ông yêu tất cả. Ông phải thông báo ai sẽ trở thành vua.<br/>Hai trong số các hoàng tử đứng đợi bên ngoài phòng vua. Theseus là người già nhất và mạnh nhất.<br/>Anh nghĩ cha anh sẽ biến anh thành vua. Pelias, con trai thứ hai, nghĩ khác.<br/>Ông là một chuyên gia về vũ khí. Anh nghĩ nhà vua sẽ chọn anh.<br/>Khi tôi là vua, thì ông Theseus nói với Pelias, tôi sẽ cho phép bạn đóng góp cho việc bảo vệ đất nước chúng ta. Bạn có thể lãnh đạo quân đội.<br/>Pelias trở nên tức giận. Cha biết tôi nổi tiếng về kỹ năng kiếm thuật của mình. Anh ấy sẽ làm cho tôi trở thành vua.<br/>\"Bạn?\" Theseus hét lên. Anh ấy đã thắng, chọn bạn!<br/>Vương quốc là của tôi! Pelias tuyên bố. Cha sẽ tặng nó cho tôi, hoặc tôi dùng vũ lực để lấy nó!<br/>Theseus làm một động tác bất ngờ để lấy thanh kiếm của mình ra. Sau đó, Pelias cũng làm như vậy.<br/>Đánh bại tôi sẽ là một thử thách. Hãy chiến đấu với tôi ngay bây giờ. Người chiến thắng có được vương quốc! Pelias đồng ý.<br/>Vua Minos có thể nghe thấy những đứa con trai của mình chiến đấu. Con trai út, Jason, đứng bên cạnh anh.<br/>Anh cảm nhận được nỗi buồn của cha mình. Nhà vua đặt tay lên bàn tay Jason.<br/>Anh em của bạn chiến đấu quá nhiều, vua nói với anh ta. Tôi phải bảo vệ vương quốc của mình khỏi mọi tác hại.<br/>Họ sẽ chia nó giữa họ. Người dân giành chiến thắng đã biết phải làm gì. Có một cuộc chiến.<br/>Tôi có thể cho phép một trong hai người trở thành vua. Do đó, tôi làm cho bạn trở thành vua.<br/>Lòng tốt của bạn luôn làm cho bạn đặc biệt. Nó khác biệt giữa bạn và anh em của bạn.<br/>Bạn có thể mang lại hòa bình. Họ có thể GẠCH. Sau đó, nhà vua qua đời. Theseus và Pelias nghe nói rằng em trai út của họ là vua.<br/>Họ bị bât ngơ. Họ nhận ra rằng chiến đấu của họ là sai.<br/>Nó đã ngăn họ nói lời tạm biệt với cha của họ. Họ đồng ý để Jason làm vua.<br/>Ông là sự lựa chọn tốt nhất.",
        "contentTranscript": "<h2>The Best Prince</h2>King Minos was very sick. His condition was getting worse. He had three sons.<br/>He loved them all. He had to announce who would become king.<br/>Two of the princes stood waiting outside the king’s room. Theseus was the oldest and strongest.<br/>He thought his father would make him king. Pelias, the second son, thought differently.<br/>He was an expert with weapons. He thought the king would choose him.<br/>“When I’m king,” Theseus told Pelias, “I’ll let you contribute to the defense of our country. You can lead the army.”<br/>Pelias became angry. “Father knows I’m famous for my sword skills. He’ll make me king.”<br/>“You?” Theseus yelled. “He won’t choose you!”<br/>“The kingdom is mine!” Pelias claimed. “Father will give it to me—or I’ll use force to take it!”<br/>Theseus made a sudden move to take out his sword. Then Pelias did the same.<br/>“Beating me will be a challenge,” Theseus said. “Fight me now. The winner gets the kingdom!” Pelias agreed.<br/>King Minos could hear his sons fighting. The youngest son, Jason, stood beside him.<br/>He sensed his father’s sadness. The king laid his hand flat on Jason’s arm.<br/>“Your brothers fight too much,” the king told him. “I must protect my kingdom from all harm.<br/>They’ll divide it between them. The people won’t know what to do. There’ll be war.<br/>I can’t allow either of them to be king. Therefore, I’m making you king.<br/>Your kindness has always made you special. It’s the difference between you and your brothers.<br/>You can bring peace. They can’t.” Then the king died. Theseus and Pelias heard that their youngest brother was king.<br/>They were surprised. They realized that their fighting was wrong.<br/>It had kept them from saying goodbye to their father. They agreed to have Jason as their king.<br/>He was the best choice. ",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. A sudden fight between kings<br/>b. A kind prince who got a kingdom<br/>c. An expert sister and a famous king<br/>d. The challenge to divide the kingdom<br/><br/>2. What did the king need to protect the kingdom from?<br/>a. The fighting between the two princes<br/>b. The harm caused by sudden fights<br/>c. The differences between the three brothers<br/>d. The poor condition of the king’s army<br/><br/>3. What was probably true of Jason in the story?<br/>a. He wanted to bring peace to the kingdom.<br/>b. The challenge of being king was too much for him.<br/>c. He wanted harm to come to his brothers.<br/>d. He hoped to divide the kingdom.<br/><br/>4. What was the difference between Jason and his brothers?<br/>a. He was an expert with weapons.<br/>b. He was older and stronger.<br/>c. He made more sense.<br/>d. He had always been kind.<br/><br/>5. What did the king have to announce?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"82\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Prep</strong></td><td style=\"text-align: center;\" width=\"82\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"79\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>allow</td><td>beside</td><td>challenge</td><td>therefore</td><td>famous</td></tr><tr><td>announce</td><td>&nbsp;</td><td>condition</td><td>&nbsp;</td><td>sudden</td></tr><tr><td>claim</td><td>&nbsp;</td><td>difference</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>contribute</td><td>&nbsp;</td><td>expert</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>divide</td><td>&nbsp;</td><td>force</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>lay</td><td>&nbsp;</td><td>harm</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>protect</td><td>&nbsp;</td><td>peace</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>sense</td><td>&nbsp;</td><td>prince</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-07.json",
        "srcUrlReadingWold": "4k-essential-volume1-07-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-08-02.mp3",
        "contentTranslation": "<h2>Mặt trời và mặt trăng được tạo ra như thế nào</h2>Bạn có bao giờ tự hỏi mặt trăng và mặt trời đến từ đâu không? Người Inuit ở Alaska có một lý thuyết.<br/>Họ kể một câu chuyện về một cô gái xinh đẹp. Cô ấy rất tốt Ngược lại, anh trai cô là một cậu bé đáng ghét.<br/>Một ngày nọ anh đề xuất một cái gì đó. Chúng tôi nên đến một bữa tiệc, anh ấy nói. Cô gái chấp nhận.<br/>Đầu tiên, nó là cần thiết để cô ấy chuẩn bị. Cô sắp xếp tóc và mặc quần áo đẹp.<br/>Điều này đòi hỏi rất nhiều thời gian. Nhưng cô gái đã làm việc chăm chỉ, và chẳng mấy chốc cô đã thành công. Cô ấy trông thật hoàn hảo.<br/>Họ tham dự bữa tiệc cùng nhau. Cô gái vui vẻ. Sau đó, cô bước vào phòng tắm.<br/>Đột nhiên, đèn bị tắt! Ai đó túm tóc cô và xé quần áo.<br/>Cô chạy ra khỏi phòng tắm. Cô muốn biết ai đã làm điều này với cô.<br/>Sau đó, cô đã có một ý tưởng. Cô lại cố định mái tóc của mình. Lần này nó còn đẹp hơn nữa.<br/>Cô thậm chí còn cân bằng những viên ngọc tuyệt đẹp trong đó. Cô muốn khuyến khích người lấy nó một lần nữa.<br/>Cô bôi bụi bẩn đen lên tóc. Mục đích của việc này là để bắt người.<br/>Cô đi vào phòng tắm một lần nữa, và đó là mô hình tương tự. Đèn tắt, và ai đó túm tóc cô.<br/>Khi anh thả nó ra, tay anh màu đen. Cô gái trở lại bữa tiệc.<br/>Cô biết chỉ có một người duy nhất với bàn tay đen. Khi cô nhìn thấy người đó, anh rất quen.<br/>Đó là anh trai cô! Anh chạy vào rừng. Cô gái chạy theo anh. Cả hai đều mang theo lửa để có thể nhìn thấy trong bóng tối.<br/>Khói bay vào không trung. Khi họ chạy, họ lớn lên. Họ trở nên khổng lồ. Sau đó, họ đi vào không gian.<br/>Khi cô gái Lửa bùng cháy, cô treo lơ lửng trên bầu trời. Cô trở thành mặt trăng, và anh trai cô trở thành mặt trời.<br/>Họ đuổi nhau mãi mãi.",
        "contentTranscript": "<h2>How the Sun and the Moon Were Made</h2>Do you ever wonder where the moon and the sun came from? The Inuit people of Alaska have a theory.<br/>They tell a story about a beautiful girl. She was very nice. In contrast, her brother was a mean little boy.<br/>One day he proposed something. “We should go to a party,” he said. The girl accepted.<br/>First, it was necessary for her to prepare. She arranged her hair and put on nice clothes.<br/>This required a lot of time. But the girl worked hard, and soon she had success. She looked perfect.<br/>They attended the party together. The girl was having fun. Later, she walked into the bathroom.<br/>Suddenly, the lights were turned off! Someone grabbed her hair and tore her clothes.<br/>She ran out of the bathroom. She wanted to know who did this to her.<br/>Then she had an idea. She fixed her hair again. This time it was even more beautiful.<br/>She even balanced beautiful jewels in it. She wanted to encourage the person to grab it again.<br/>She put black dirt in her hair. The purpose of this was to catch the person.<br/>She went to the bathroom again, and it was the same pattern. The lights went off, and someone grabbed her hair.<br/>When he released it, his hand was black. The girl returned to the party.<br/>She knew there was only a single person with a black hand. When she saw that person, he was very familiar.<br/>It was her brother! He ran into the woods. The girl ran after him. They both carried fire so they could see in the dark.<br/>The smoke went into the air. As they ran, they grew. They became huge. Then they went into space.<br/>When the girl’s fire went out, she hung in the sky. She became the moon, and her brother became the sun.<br/>They chase each other forever.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. The contrast between the sun and the moon<br/>b. A theory of how the moon and the sun were made<br/>c. The purpose of the sun and the moon<br/>d. Why it is necessary for the moon to balance in the sky<br/><br/>2. Why does the girl encourage someone to grab her hair?<br/>a. She doesn’t want him to tear her dress.<br/>b. She wants to become huge and hang in the sky.<br/>c. She wants to know who grabbed her hair.<br/>d. She wants the party to be a success.<br/><br/>3. What was true of the boy in the story?<br/>a. He accepted the invitation when his sister proposed a party.<br/>b. He didn’t want to attend the party.<br/>c. He was the only person with a black hand.<br/>d. He wore a shirt with a beautiful pattern.<br/><br/>4. Why does the girl become angry?<br/>a. The boy doesn’t release her hair.<br/>b. She is required to arrange her hair.<br/>c. The smoke from her fire went into the air.<br/>d. She sees someone familiar with a black hand.<br/><br/>5. How does the girl get ready for the party?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"80\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"68\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"77\"><strong>Adj</strong></td></tr><tr><td>accept</td><td>contrast</td><td>familiar</td></tr><tr><td>arrange</td><td>pattern</td><td>huge</td></tr><tr><td>attend</td><td>purpose</td><td>necessary</td></tr><tr><td>balance</td><td>success</td><td>single</td></tr><tr><td>encourage</td><td>theory</td><td>&nbsp;</td></tr><tr><td>grab</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>hang</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>propose</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>release</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>require</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>tear</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-08.json",
        "srcUrlReadingWold": "4k-essential-volume1-08-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-09-02.mp3",
        "contentTranslation": "<h2>Sao biển</h2>Mùa hè năm ngoái tôi đã có một chuyến đi đến một hòn đảo. Tôi đã có rất nhiều niềm vui. Tôi ngồi và nhìn những con sóng và lắng nghe đại dương.<br/>Tôi đã học cách xác định các loài chim. Tôi phát hiện ra những điều đẹp và thưởng thức hương vị của thực phẩm mới. Đó là một thời gian rất tốt đẹp.<br/>Một buổi tối tôi đi dạo dễ chịu bên đại dương. Khi sóng đến, nhiều con sao biển rơi xuống bãi biển.<br/>Một số con sao biển đã trở lại vào nước và chúng vẫn an toàn. Nhưng những con sao biển khác vẫn ở trên cát.<br/>Họ sẽ chết nếu không xuống nước. Có rất nhiều sao biển trên bãi biển đêm đó.<br/>Nó làm tôi buồn, nhưng tôi biết tôi không thể khắc phục vấn đề. Tôi bước rất cẩn thận để tôi không làm hỏng chúng.<br/>Rồi tôi thấy một cô bé. Cô cũng buồn về con sao biển. Cô muốn ngăn tất cả bọn họ chết.<br/>Cô ấy hỏi tôi có lẽ có thể giúp cô ấy không. Thẳng thắn mà nói, tôi không nghĩ chúng ta có thể làm bất cứ điều gì, tôi đã nói.<br/>Cô bé bắt đầu khóc. Cô ngồi dựa vào một tảng đá và suy nghĩ một lúc.<br/>Cuối cùng, cảm xúc đã biến mất. Cô ngừng khóc và đứng dậy.<br/>Sau đó, cô nhặt một con sao biển và ném nó xuống nước. \"Bạn đang làm gì đấy?\" Tôi hỏi cô ấy.<br/>Nhưng cô ấy không trả lời tôi. Cô ấy đã ném càng nhiều sao biển càng tốt. Bạn không thể cứu tất cả chúng! Tôi đã nói.<br/>Cô dừng lại nhìn tôi. Không, tôi không thể cứu tất cả họ, cô ấy trả lời.<br/>Sau đó, cô nhặt một con sao biển rất to và nói, nhưng tôi có thể cứu con này. Và rồi cô mỉm cười và ném con sao biển hết mức có thể xuống đại dương.",
        "contentTranscript": "<h2>The Starfish</h2>Last summer I took a trip to an island. I had a lot of fun. I sat and watched the waves and listened to the ocean.<br/>I learned to identify birds. I discovered pretty things and enjoyed the taste of new foods. It was a very nice time.<br/>One evening I took a pleasant walk by the ocean. When the waves came in, many starfish* fell on the beach.<br/>Some starfish went back into the water, and they were safe. But other starfish were still on the sand.<br/>They would die if they did not get into the water. There were many starfish on the beach that night.<br/>It made me sad, but I knew I could not fix the problem. I stepped very carefully so I did not damage them.<br/>Then I saw a little girl. She was also sad about the starfish. She wanted to prevent all of them from dying.<br/>She asked me if I could perhaps help her. “To be frank, I don’t think we can do anything,” I said.<br/>The little girl started to cry. She sat back against a rock and thought for a while.<br/>Finally, the emotion was gone. She stopped crying and stood up.<br/>Then she picked up a starfish and threw it into the water. “What are you doing?” I asked her.<br/>But she did not answer me. She just threw as many starfish as she could. “You cannot save all of them!” I said.<br/>She stopped to look at me. “No, I cannot save them all,” she replied.<br/>Then she picked up a very big starfish and said, “But I can save this one.” And then she smiled and threw the starfish as far as she could into the ocean.<br/>",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. A girl who wants to save starfish<br/>b. How to throw starfish<br/>c. A girl who is too frank<br/>d. Birds and animals at the ocean<br/><br/>2. What causes the little girl’s emotion?<br/>a. She cannot fix the damage she finds to homes.<br/>b. She cannot prevent starfish from dying in the sand.<br/>c. She discovers starfish in the water.<br/>d. She steps on a rock and hurts her foot.<br/><br/>3. What does the man think is NOT good about the island?<br/>a. Watching the waves<br/>b. Identifying birds<br/>c. The starfish dying on the sand<br/>d. Tasting new food<br/><br/>4. What does the girl think the man can perhaps do?<br/>a. Identify birds<br/>b. Take a walk on the beach<br/>c. Discover something pretty<br/>d. Help her save starfish<br/><br/>5. Which starfish were safe on the beach?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"68\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Prep</strong></td><td style=\"text-align: center;\" width=\"68\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"70\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"74\"><strong>Adj</strong></td></tr><tr><td>damage</td><td>against</td><td>beach</td><td>perhaps</td><td>frank</td></tr><tr><td>discover</td><td>&nbsp;</td><td>emotion</td><td>still</td><td>pleasant</td></tr><tr><td>fix</td><td>&nbsp;</td><td>island</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>identify</td><td>&nbsp;</td><td>ocean</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>prevent</td><td>&nbsp;</td><td>rock</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>save</td><td>&nbsp;</td><td>taste</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>step</td><td>&nbsp;</td><td>wave</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>throw</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-09.json",
        "srcUrlReadingWold": "4k-essential-volume1-09-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-10-02.mp3",
        "contentTranslation": "<h2>Con công đầu tiên</h2>Argos sống ở Hy Lạp cổ đại. Ông là một người chồng và một người cha tự hào. Anh ấy làm việc chăm chỉ và làm tốt công việc của mình.<br/>Nhưng có một điều về anh ấy là không bình thường. Ông được sinh ra với 100 con mắt. Có nhiều mắt thường là một lợi ích cho anh ta.<br/>Anh có cơ hội nhìn thấy nhiều thứ. Ngoài ra, vì anh ta có rất nhiều mắt, anh ta rất giỏi trong việc bảo vệ mọi thứ.<br/>Trong khi ngủ, anh chỉ nghỉ một vài mắt một lúc. Những người khác vẫn thức.<br/>Anh ta làm việc cho Hera, một nữ thần vĩ đại. Chức năng chính của anh là bảo vệ một con bò đặc biệt.<br/>Con bò rất quan trọng đối với Hera. Đó là thú cưng yêu thích của cô.<br/>Phần thiết yếu nhất trong công việc của anh là giữ bò một mình.<br/>Nó phải được tách biệt với tất cả những con bò khác và cách xa mọi người.<br/>Đây là một công việc dễ dàng cho Argos. Con bò chỉ ăn cỏ cả ngày.<br/>Nhưng thần Zeus muốn con bò. Anh muốn mang nó đi khỏi Hera.<br/>Anh đã có một kế hoạch. Ông tìm thấy một máy nghe nhạc tuyệt vời. Anh ấy yêu cầu người đàn ông chơi một bài hát hay cho Argos.<br/>Zeus chắc chắn rằng Argos sẽ đi ngủ. Bài hát đã có tác dụng ngay lập tức.<br/>Argos không thể tập trung vào công việc của mình. Anh ngủ thiếp đi. Zeus nhìn thấy điều này, và anh ta lấy con bò.<br/>Hera rất tức giận với Argos. Cô biến anh thành một con công.<br/>Cô đặt nhiều mắt lên đuôi anh. Argos đã rất buồn.<br/>Zeus đã thấy bao nhiêu rắc rối mà anh ta đã gây ra cho Argos. Anh ấy thực hiện một kế hoạch khác.<br/>Ông đã biến Argos thành một nhóm các ngôi sao. Anh muốn Argos ở lại trên bầu trời mãi mãi.<br/>Thậm chí ngày nay, hình ảnh của Argos vẫn còn đó, phía trên vị trí nơi mọi vấn đề của anh bắt đầu.<br/>Chúng ta vẫn có thể nhìn thấy anh ta trên bầu trời đêm.",
        "contentTranscript": "<h2>The First Peacock</h2>Argos lived in Ancient Greece. He was a husband and a proud father. He worked hard and did well at his job.<br/>But one thing about him wasn’t normal. He was born with 100 eyes. Having many eyes was usually a benefit to him.<br/>He had a chance to see many things. Also, since he had so many eyes, he was very good at guarding things.<br/>While sleeping, he only rested a few eyes at a time. The others stayed awake.<br/>He worked for Hera, a great goddess. His primary function was to guard a special cow.<br/>The cow was very important to Hera. It was her favorite pet.<br/>The most essential part of his job was to keep the cow alone.<br/>It had to be kept separate from all the other cows and far away from people.<br/>This was an easy job for Argos. The cow just ate grass all day.<br/>But the god Zeus wanted the cow. He wanted to take it away from Hera.<br/>He had a plan. He found a great music player. He asked the man to play a beautiful song for Argos.<br/>Zeus was certain Argos would go to sleep. The song had an immediate effect.<br/>Argos couldn’t focus on his job. He fell asleep. Zeus saw this, and he took the cow.<br/>Hera was very angry with Argos. She turned him into a peacock.<br/>She put his many eyes on his tail. Argos was very sad.<br/>Zeus saw how much trouble he had caused Argos. He made another plan.<br/>He turned Argos into a group of stars. He wanted Argos to remain in the sky forever.<br/>Even today, Argos’ image remains there, above the site where all his problems began.<br/>We can still see him in the night sky.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. Why it is essential to guard cows<br/>b. How to play beautiful music<br/>c. How the image of a peacock in the sky came about<br/>d. How being born with 100 eyes benefited a man<br/><br/>2. Why was guarding Hera’s cow easy for Argos?<br/>a. All it did was eat grass all day.<br/>b. It was kept separate from all the other cows.<br/>c. He had a chance to listen to music.<br/>d. He was able to sleep instead of focusing on it.<br/><br/>3. Why did Zeus turn Argos into a group of stars?<br/>a. He wanted Argos to see the site of his trouble.<br/>b. He was certain that Argos would fall asleep.<br/>c. He wanted to make Argos remain in the sky forever.<br/>d. He wanted to cause Argos immediate trouble.<br/><br/>4. What was the primary function of Argos’ job?<br/>a. To make sure the cow was never sad<br/>b. To keep the cow far away from people<br/>c. To see the effects of music on the cow<br/>d. Work for a proud goddess named Hera<br/><br/>5. How did Argos sleep?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"86\"><strong>Adj</strong></td></tr><tr><td>focus</td><td>benefit</td><td>certain</td></tr><tr><td>guard</td><td>chance</td><td>essential</td></tr><tr><td>remain</td><td>effect</td><td>far</td></tr><tr><td>rest</td><td>function</td><td>immediate</td></tr><tr><td>&nbsp;</td><td>grass</td><td>primary</td></tr><tr><td>&nbsp;</td><td>image</td><td>proud</td></tr><tr><td>&nbsp;</td><td>site</td><td>separate</td></tr><tr><td>&nbsp;</td><td>tail</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>trouble</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-10.json",
        "srcUrlReadingWold": "4k-essential-volume1-10-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-11-02.mp3",
        "contentTranslation": "<h2>Công chúa hoa hồng và sinh vật</h2>Đã từng có một nàng công chúa xinh đẹp tên là Rose.<br/>Tuy nhiên, mẹ cô, nữ hoàng không xinh đẹp như công chúa.<br/>Nữ hoàng cảm thấy tồi tệ vì mình không còn là người phụ nữ đẹp nhất vương quốc nữa.<br/>Cô mệt mỏi vì phải cạnh tranh với con gái. Cô ấy đã đưa ra quyết định.<br/>Cô chuẩn bị đồ uống cho công chúa. Sau khi công chúa uống nó, cô ngủ thiếp đi.<br/>Sau đó, nữ hoàng đưa công chúa vào rừng. Cô để công chúa ở đó.<br/>Đó là một điều rất nghiêm trọng để làm. Cô ấy sẽ bị giết bởi động vật hoặc cô ấy sẽ bị lạc trong rừng, nữ hoàng nghĩ.<br/>Công chúa đã có một giấc mơ. Cô mơ về một người đàn ông có mái tóc nâu và đôi mắt nâu. Đó là người đàn ông cô sẽ cưới.<br/>Công chúa tỉnh dậy. Cô nhìn thấy một sinh vật kỳ lạ trên mặt đất. Nó trông giống như một người đàn ông, nhưng anh ta có lông và màu xanh lá cây.<br/>Anh ta có sừng trên đầu và mũi lợn.<br/>Sinh vật nói, tôi có sợ bạn không? Tôi hy vọng là không. Hãy để tôi tự giới thiệu. Tôi là Henry.<br/>\"Tôi không sợ. Nói thật với bạn, tôi nghĩ bạn thật dễ thương, anh nói Rose.<br/>Rose và Henry đã dành cả ngày với nhau. Họ thu thập các loại quả mọng, bắt cá và ăn trưa.<br/>Họ đã có một ngày rất tốt với những cuộc trò chuyện tốt đẹp.<br/>Bông hồng, tôi phải về nhà, Henry nói. Tàu của tôi sẽ ra khơi sớm. Tôi có thể để bạn ở đây trong rừng một mình. Bạn sẽ đi cùng tôi chứ?\"<br/>Rose rất hạnh phúc. Cô trao cho Henry một nụ hôn ngay trên mũi lợn của anh.<br/>Ngay khi cô hôn Henry, anh bắt đầu thay đổi. Mũi lợn của anh biến thành mũi người đàn ông.<br/>Sừng và tóc xanh của anh đã biến mất. Đứng trước mặt cô là người đàn ông mà Rose mơ ước.<br/>Rose và Henry đã kết hôn, và họ sống hạnh phúc.",
        "contentTranscript": "<h2>Princess Rose and the Creature</h2>There was once a beautiful princess named Rose.<br/>Her mother, the queen, however, was not as beautiful as the princess.<br/>The queen felt bad that she was not the most beautiful woman in the kingdom anymore.<br/>She was tired of competing with her daughter. She made a decision.<br/>She prepared a drink for the princess. After the princess drank it, she fell asleep.<br/>Then the queen took the princess to the forest. She left the princess there.<br/>It was a very serious thing to do. “Either she will be killed by animals or she will get lost in the forest,” the queen thought.<br/>The princess had a dream. She dreamed about a man with brown hair and brown eyes. It was the man she would wed.<br/>The princess woke up. She saw a strange creature on the ground. It looked like a man, but he was hairy and green.<br/>He had horns on his head and a pig’s nose.<br/>The creature said, “Did I scare you? I hope not. Let me introduce myself. I am Henry.”<br/>“I am not scared. To tell you the truth, I think you are cute,” said Rose.<br/>Rose and Henry spent the day together. They collected berries, caught fish, and had lunch.<br/>They had a very good day filled with nice conversations.<br/>“Rose, I have to go home,” said Henry. “My ship will sail home soon. I can’t leave you here in the forest alone. Will you come with me?”<br/>Rose was very happy. She gave Henry a kiss right on his pig nose.<br/>As soon as she kissed Henry, he began to change. His pig nose turned into a man’s nose.<br/>His horns and green hair went away. Standing in front of her was the man Rose had dreamt about.<br/>Rose and Henry were married, and they lived happily.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. A strange creature that competes with a princess<br/>b. Why a queen had a conversation with a princess<br/>c. How a princess met a creature in a forest<br/>d. A serious decision made by a princess<br/><br/>2. Which of the following is NOT true in the story?<br/>a. The queen fell asleep in the forest.<br/>b. The princess had a dream.<br/>c. The creature wasn’t mean or scary.<br/>d. Henry said he was going to sail away on a ship.<br/><br/>3. What did the queen want to happen to the princess?<br/>a. A creature would wake the princess.<br/>b. A creature would prepare a drink for the princess.<br/>c. An animal would kill the princess if she was left on the ground.<br/>d. Rose and a creature would collect either berries or fruits.<br/><br/>4. Which of the following is true at the end of the story?<br/>a. Rose introduces Henry to the queen.<br/>b. Rose and Henry wed.<br/>c. The queen learns the truth about Rose.<br/>d. The queen sails away on a ship.<br/><br/>5. What did the princess dream in the forest?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"76\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"94\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Conj</strong></td><td style=\"text-align: center;\" width=\"71\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>collect</td><td>berry</td><td>either</td><td>anymore</td><td>asleep</td></tr><tr><td>compete</td><td>conversation</td><td>&nbsp;</td><td>&nbsp;</td><td>serious</td></tr><tr><td>introduce</td><td>creature</td><td>&nbsp;</td><td>&nbsp;</td><td>strange</td></tr><tr><td>marry</td><td>decision</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>prepare</td><td>forest</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>sail</td><td>ground</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>spend</td><td>truth</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>wake</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-11.json",
        "srcUrlReadingWold": "4k-essential-volume1-11-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-12-02.mp3",
        "contentTranslation": "<h2>Nghệ sĩ điên</h2>Frenhofer là nghệ sĩ giỏi nhất thế giới. Mọi người đều yêu mến anh.<br/>Chất lượng tranh của ông rất cao. Ông luôn sử dụng những vật liệu tốt nhất.<br/>Ông đã kiếm được lợi nhuận lớn từ các bức tranh của mình. Ông đã có những bữa ăn ngon với những người hàng xóm giàu có.<br/>Ông dạy các lớp nghệ thuật. Cuộc sống thật tốt. Rồi thái độ của anh thay đổi.<br/>Ông ngừng bán tranh và dạy học.<br/>Ông đã thử một phương pháp vẽ mới. Ông ở một mình trong căn hộ cả ngày.<br/>Ông làm việc cả ngày lẫn đêm, ít khi ăn. Chẳng mấy chốc Frenhofer trở nên rất gầy.<br/>Nhưng ông vẫn tiếp tục làm việc trên cùng một bức tranh trong nhiều năm. Ông ấy làm việc chăm chỉ nhất có thể.<br/>Cuối cùng, Ông đã hoàn thành bức tranh. Ông rất vui và mời các nghệ sĩ khác đến xem.<br/>Tôi muốn có ý kiến ​​chuyên môn của bạn, ông nói. Ông muốn họ đánh giá nó và so sánh nó với những bức tranh khác.<br/>Mọi người rất phấn khích khi họ đi lên cầu thang đến căn hộ của mình.<br/>Frenhofer đã rất hào hứng khi thể hiện bức tranh của mình, và các nghệ sĩ đã rất hào hứng khi xem nó.<br/>Họ rất thích nó, anh nghĩ. Nhưng họ đã không làm thế. Họ ngạc nhiên trước bức tranh của anh.<br/>Không có màu trắng ở bất cứ đâu. Frenhofer lấp đầy toàn bộ bức tranh với các đường nét và màu sắc.<br/>Không có không gian cho một bức tranh bình thường. Nó đầy những hình thù kỳ lạ.<br/>Nó trông tệ cho các nghệ sĩ khác. Anh ấy đã sử dụng các biểu tượng, và họ đã không hiểu chúng.<br/>Họ nghĩ nó thật kinh khủng. Tại sao bạn lại vẽ bức tranh kỳ lạ này? có người hỏi.<br/>Họ đã không hiểu được vẻ đẹp của nó. Nhưng sau một thời gian, nhiều người bắt đầu thích bức tranh của anh.<br/>Mọi người đã viết bài về nó trên các tạp chí. Họ nói rằng đó là công việc tốt nhất của anh ấy.<br/>Họ yêu những biểu tượng kỳ lạ của anh. Họ yêu màu sắc kỳ lạ của anh ấy.<br/>Bức tranh Frenhofer đã nhắc nhở mọi người rằng chỉ vì một cái gì đó mới không có nghĩa là nó xấu.<br/>Ông cũng giúp họ nhận ra rằng đôi khi mọi người phải mất một ít thời gian để hiểu những điều tuyệt vời.",
        "contentTranscript": "<h2>The Crazy Artist</h2>Frenhoferwas the best artist in the world. Everyone loved him.<br/>The quality of his paintings was very high. He always used the best materials.<br/>He made a big profit from his paintings. He had delicious meals with his rich neighbors.<br/>He taught art classes. Life was good. Then his attitude changed.<br/>He stopped selling paintings and teaching.<br/>He tried a new method of painting. He stayed alone in his apartment all day.<br/>He worked all day and all night, rarely eating. Soon Frenhofer became very thin.<br/>But he kept working on the same painting for many years. He worked as hard as he could.<br/>Finally, he finished the painting. He was very happy and invited other artists to see it.<br/>“I want your professional opinion,” he said. He wanted them to judge it and compare it to other paintings.<br/>Everyone was very excited as they went up the stairs to his apartment.<br/>Frenhofer was excited to show his painting, and the artists were excited to see it.<br/>“They’ll love it,” he thought. But they did not. They were surprised by his painting.<br/>There was no white anywhere. Frenhofer filled the whole painting with lines and colors.<br/>There was no space for a normal picture. It was full of strange shapes.<br/>It looked bad to the other artists. He used symbols, and they didn’t understand them.<br/>They thought it was terrible. “Why did you paint this strange picture?” someone asked.<br/>They didn’t understand its beauty. But after some time, many people began to like his painting.<br/>People wrote articles about it in magazines. They said it was his best work.<br/>They loved his strange symbols. They loved his strange colors.<br/>Frenhofer’s painting reminded everyone that just because something was new didn’t mean that it was bad.<br/>He also helped them to realize that sometimes it takes people a little time to understand great things.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. A painter whose neighbors judge his art as poor quality<br/>b. An artist who teaches art classes in his apartment<br/>c. A man who writes articles for a magazine<br/>d. A thin man who eats meals with friends<br/><br/>2. Why does Frenhofer want the artists to see his painting?<br/>a. He wants to sell it to them for a profit.<br/>b. He wants them to judge his materials.<br/>c. He wants them to give their professional opinion.<br/>d. He wants to compare his new method to theirs.<br/><br/>3. What is true of Frenhofer’s painting?<br/>a. It is made with low-quality materials.<br/>b. It is full of strange colors and shapes.<br/>c. It does not have any symbols in it.<br/>d. It is a picture of other artists.<br/><br/>4. Where do the other artists see his painting?<br/>a. It is alone in the space used for art classes.<br/>b. They go to Frenhofer’s apartment.<br/>c. Frenhofer takes it to their apartment.<br/>d. It is on sale at a famous store.<br/><br/>5. How do the artists feel as they go up the stairs?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"87\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"96\"><strong>Adj</strong></td></tr><tr><td>compare</td><td>apartment</td><td>alone</td></tr><tr><td>judge</td><td>article</td><td>professional</td></tr><tr><td>&nbsp;</td><td>artist</td><td>thin</td></tr><tr><td>&nbsp;</td><td>attitude</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>magazine</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>material</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>meal</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>method</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>neighbor</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>profit</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>quality</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>shape</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>space</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>stair</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>symbol</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-12.json",
        "srcUrlReadingWold": "4k-essential-volume1-12-01.mp3"
    }
]