[
    {
        "srcUrl": "4k-essential-volume1-13-02.mp3",
        "contentTranslation": "<h2>Nông dân và Mèo</h2>Arthur là một nông dân có trách nhiệm và Maria là một phụ nữ tốt bụng. Nhưng họ nghèo.<br/>Họ nợ tiền chúa tể thị trấn. Một mùa hè, trang trại của họ bị đốt cháy.<br/>Một cấu trúc bốc cháy, và hầu hết các động vật bỏ chạy. Chỉ có những con mèo ở lại.<br/>Vì vậy, Arthur và Maria phải mang lại mùa màng của họ mà không cần sự giúp đỡ của động vật.<br/>Vào một ngày mùa thu, lãnh chúa đòi tiền của mình. Arthur hỏi liệu lãnh chúa có thể đợi cho đến khi anh ta mang lại mùa màng của mình không.<br/>Chúa đã tức giận. Anh ta giơ tay lên cao và hét lên, trả tiền cho tôi vào cuối tuần.<br/>Nếu không, tôi sẽ tăng số tiền bạn phải trả. Tôi có thể đưa bạn vào một phòng giam.<br/>Vì vậy, Arthur và Maria làm việc cho đến khi có máu trên tay.<br/>Họ đã hoàn thành bốn dòng ngô và đi ngủ.<br/>Nhưng sáng hôm sau, tám dòng đã hoàn thành! Maria, không phải chúng ta dừng lại ở đây sao? Arthur hỏi.<br/>Có, đúng vậy. Và các công cụ cũng ở một vị trí khác, ông Maria nói.<br/>Họ ngạc nhiên và hạnh phúc. Ngày hôm đó, họ làm việc chăm chỉ và hoàn thành năm dòng.<br/>Nhưng vào buổi sáng, mười dòng đã được thực hiện! Mỗi ngày họ làm rất nhiều việc.<br/>Mỗi đêm, một người khác làm một công việc tương đương. Trong một tuần, toàn bộ lĩnh vực đã hoàn thành.<br/>Ngày mai tôi sẽ bán các loại cây trồng và trả lương cho lãnh chúa, ông Arthur nói.<br/>Nhưng sáng hôm đó, mùa màng đã mất. Một cái túi nằm giữa cánh đồng.<br/>Nó chứa tiền. Hãy để Maria xem ai đã giúp chúng tôi làm việc. Qua một cái lỗ trên tường, họ thấy một cảnh tượng ngộ nghĩnh.<br/>Những con mèo đang nhảy trên cánh đồng và ăn ngô! Bây giờ Arthur đã biết chuyện gì đã xảy ra.<br/>Những con mèo đã làm việc vào ban đêm! Sau đó, Arthur rất tốt với những con mèo của mình và cho chúng ăn rất nhiều ngô.",
        "contentTranscript": "<h2>The Farmer and the Cats</h2>Arthur was a responsible farmer, and Maria was a nice lady. But they were poor.<br/>They owed the town lord money for their land. One summer, their farm burned.<br/>One structure caught fire, and most of the animals ran away. Only the cats stayed.<br/>So Arthur and Maria had to bring in their crops without an animal’s help.<br/>On a fall day, the lord demanded his money. Arthur asked if the lord could wait until he brought in his crops.<br/>The lord was angry. He raised his hands high and yelled, “Pay me by the end of the week.<br/>If you don’t, I will increase the money you have to pay. I might put you in a jail cell.”<br/>So Arthur and Maria worked until there was blood on their hands.<br/>They finished four lines of corn and went to bed.<br/>But the next morning, eight lines were finished! “Maria, didn’t we stop in this spot here?” Arthur asked.<br/>“Yes, that is correct. And the tools were in a different position, too,” Maria said.<br/>They were surprised and happy. That day, they worked hard and finished five lines.<br/>But in the morning, ten lines were done! Each day they did a lot of work.<br/>Each night, someone else did an equal amount of work. In a week, the whole field was finished.<br/>“Tomorrow I will sell the crops and pay the lord,” Arthur said.<br/>But that morning, the crops were gone. A bag was in the middle of the field.<br/>It contained money. “Maria, let’s see who has helped us work.” Through a hole in the wall, they saw a funny sight.<br/>The cats were dancing in the field and eating corn! Now Arthur knew what had happened.<br/>The cats had worked at night! After that, Arthur was very nice to his cats and fed them lots of corn.<br/>",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What does Arthur do in the story?<br/>a. Put the lady in a jail cell<br/>b. Raise his hands high<br/>c. Demand money from people<br/>d. Work until there is blood on his hands<br/><br/>2. What is true of the cats in the story?<br/>a. They burn the farm and scare the animals.<br/>b. They do work equal to Arthur’s work.<br/>c. They think Arthur is very responsible.<br/>d. They put all the tools in one spot.<br/><br/>3. What does the bag contain?<br/>a. A gift for the lady<br/>b. Corn to feed the animals<br/>c. Money for the lord<br/>d. A new kind of crop<br/><br/>4. What sight did Maria and Arthur see in the morning?<br/>a. A hole in the wall of their house<br/>b. A whole new structure on the farm<br/>c. The lord working in their fields<br/>d. The cats dancing on the farm<br/><br/>5. When will the lord increase the money that Arthur has to pay?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"80\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"109\"><strong>Adj</strong></td></tr><tr><td>burn</td><td>blood</td><td>correct</td></tr><tr><td>demand</td><td>cell</td><td>equal</td></tr><tr><td>feed</td><td>contain</td><td>responsible</td></tr><tr><td>increase</td><td>crop</td><td>whole&nbsp;</td></tr><tr><td>owe</td><td>hole</td><td>&nbsp;</td></tr><tr><td>raise</td><td>lord</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>position</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>sight</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>spot</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>structure</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-13.json",
        "srcUrlReadingWold": "4k-essential-volume1-13-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-14-02.mp3",
        "contentTranslation": "<h2>Một cuốn sách ma thuật</h2>Sarah thích đọc sách. Cô đọc tiểu thuyết và thơ. Cô ấy yêu những mô tả và cụm từ đẹp.<br/>Cô thích đọc tác phẩm từ các nhà thơ và tiểu thuyết gia. Cô ấy không thích trò chơi điện tử hay công nghệ.<br/>Cô ấy ở trong đội bóng rổ, nhưng cô ấy không thích thể thao. Bố mẹ cô bắt cô chơi bóng rổ.<br/>Trên thực tế, bố mẹ Sarah, đã khiến cô làm nhiều việc. Nhưng cô ấy không muốn làm những điều đó.<br/>Cô chỉ muốn ngồi và đọc cả ngày. Một ngày nọ, một cuốn sách nhỏ đến trong thư.<br/>Đó là cho Sarah. Cuốn sách trông rất đặc biệt. Nó được in trên các tấm vàng.<br/>Sarah bắt đầu đọc. Các phác thảo của câu chuyện là đơn giản. Đó là về một nơi huyền diệu.<br/>Những điều kỳ lạ đã xảy ra ở đó. Một ví dụ từ cuốn sách là về một cậu bé có thể điều khiển mọi người.<br/>Trong một cảnh, anh ấy đã khiến bạn bè của mình kể những câu chuyện cười hài hước. Sarah yêu cuốn sách.<br/>Cô ấy đọc nó mọi lúc. Rồi một chuyện lạ xảy ra. Cuốn sách đã cho Sarah một sức mạnh đặc biệt.<br/>Cô ấy có thể kiểm soát người khác. Cô ấy giống như cậu bé trong cuốn sách.<br/>Trong một kỳ thi, cô đã khiến bạn mình kể những câu chuyện cười ngớ ngẩn. Bạn của cô gặp rắc rối.<br/>Sau giờ học, Sarah không thực hiện một chuyến đi trực tiếp về nhà. Trên đường đi, cô đến cửa hàng địa phương.<br/>Cô muốn chơi nhiều mánh khóe hơn với mọi người. Cô ấy gây ra vấn đề.<br/>Cô làm mọi người ngã xuống. Cô cười và vui vẻ.<br/>Cuối cùng cô rời đi và bắt đầu đi bộ về nhà. Rồi cô nhìn thấy một cái gì đó.<br/>Huấn luyện viên bóng rổ của cô chuẩn bị đi bộ trước một chiếc xe buýt. Anh đang nhìn theo một cách khác.<br/>Cô phải ngăn anh lại! Cô ấy đã sử dụng sức mạnh của mình. Cô khống chế anh.<br/>Cô bắt anh dừng bước. Sarah đã học được điều gì đó ngày hôm đó.<br/>Nó là tốt hơn để giúp đỡ mọi người hơn là làm cho họ đau khổ. Vì vậy, cô đã đặt ra giới hạn về cách cô sử dụng sức mạnh của mình.<br/>Cô không muốn làm điều xấu với nó nữa. Cô chỉ muốn làm điều tốt.",
        "contentTranscript": "<h2>A Magical Book</h2>Sarah loved to read. She read novels and poems. She loved the beautiful descriptions and phrases.<br/>She loved reading work from poets and novelists. She didn’t like video games or technology.<br/>She was on the basketball team, but she didn’t like sports. Her parents made her play basketball.<br/>In fact, Sarah’s parents made her do many things. But she didn’t want to do those things.<br/>She just wanted to sit and read all day. One day, a small book came in the mail.<br/>It was for Sarah. The book looked very special. It was printed on sheets of gold.<br/>Sarah began to read. The outline of the story was simple. It was about a magical place.<br/>Strange things happened there. One example from the book was about a boy who could control people.<br/>In one scene, he made his friends tell funny jokes. Sarah loved the book.<br/>She read it all the time. Then something strange happened. The book gave Sarah a special power.<br/>She could control other people. She was like the boy in the book.<br/>During one exam, she made her friend tell silly jokes. Her friend got in trouble.<br/>After school, Sarah did not make a direct trip home. On the way, she went to the local store.<br/>She wanted to play more tricks on people. She caused problems.<br/>She made people fall down. She laughed and had fun.<br/>Finally she left and started to walk home. Then she saw something.<br/>Her basketball coach was about to walk in front of a bus. He was looking the other way.<br/>She had to stop him! She used her power. She controlled him.<br/>She made him stop walking. Sarah learned something that day.<br/>It was better to help people than make them suffer. So, she put a limit on how she used her power.<br/>She did not want to do bad things with it anymore. She only wanted to do good.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. A girl who gets a novel about technology in the mail<br/>b. A basketball coach who tells jokes to people<br/>c. A man who takes a direct trip to the local store<br/>d. A girl who can control other people<br/><br/>2. Why does Sarah love to read?<br/>a. It gives her control over other people.<br/>b. She likes the phrases and descriptions in books.<br/>c. She likes to tell jokes to her teachers.<br/>d. She wants to be a poet.<br/><br/>3. What does Sarah learn in the end?<br/>a. She should make other people suffer.<br/>b. Simple stories are the best.<br/>c. She must limit her power.<br/>d. She should not read during an exam.<br/><br/>4. What is true about the magical book?<br/>a. It is printed on sheets of gold.<br/>b. Its outline is hard to understand.<br/>c. It gives examples of good jokes.<br/>d. Sarah doesn’t want to write in it.<br/><br/>5. Why is Sarah on the basketball team?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"86\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>control</td><td>coach</td><td>direct</td></tr><tr><td>print</td><td>description</td><td>local</td></tr><tr><td>suffer</td><td>exam</td><td>magical</td></tr><tr><td>&nbsp;</td><td>example</td><td>silly</td></tr><tr><td>&nbsp;</td><td>limit</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>mail</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>novel</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>outline</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>poet</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>scene</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>sheet</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>store</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>technology</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-14.json",
        "srcUrlReadingWold": "4k-essential-volume1-14-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-15-02.mp3",
        "contentTranslation": "<h2>Cuộc đua lớn</h2>Một con chó nhìn thấy một nhóm động vật trên đường. Anh bước tới gặp họ.<br/>\"Bạn đang làm gì đấy?\" Anh hỏi họ. Tôi vừa bán vé cho một cuộc đua giữa thỏ và rùa, vịt đã trả lời.<br/>Tin tức này làm con chó phấn khích. Anh cảm thấy may mắn vì anh tình cờ ở đó. Tôi không có gì để làm hôm nay, chú chó nói.<br/>Tôi cũng muốn mua vé. Con chó ngồi xuống quan sát cuộc đua. Cuộc đua sẽ là cực đoan.<br/>Nó sẽ dài nhiều km. Con thỏ và con rùa đứng cạnh nhau.<br/>Họ chờ đợi cuộc đua bắt đầu. Con chó tự hỏi tại sao con rùa đồng ý chạy lại với con thỏ.<br/>Nhanh không phải là một đặc điểm của rùa. Con thỏ sẽ chiến thắng dễ dàng.<br/>Đột nhiên, cuộc đua bắt đầu. Con thỏ chạy rất nhanh. Con rùa bước chậm.<br/>Sau một phút, con thỏ nhìn lại.<br/>Anh ta thấy rằng con rùa ở đằng sau anh ta rất nhanh và thở rất nhanh vì anh ta quá mệt mỏi. Con thỏ mỉm cười và đi chậm lại.<br/>Một phút sau, con thỏ nói, tôi đã thắng, vì vậy tôi sẽ nghỉ ngơi. Anh ngồi xuống và bắt đầu ăn một ít cỏ.<br/>Sau đó, anh để mắt mình nhắm lại. Anh ấy không phải là người chiến thắng. Nhưng không có nguy cơ anh ta thua cuộc đua.<br/>Anh ta đã đi ngủ. Vài giờ sau, một âm thanh lớn đánh thức anh. Tất cả các con vật đang la hét và nhìn vào cánh đồng.<br/>Anh cảm thấy sợ lần đầu tiên. Con rùa đã gần về đích.<br/>Bây giờ, thỏ nhận ra sai lầm của mình. Nhưng cuộc đua đã kết thúc.<br/>Ông đã cho rùa một cơ hội để chiến thắng, và rùa đã lấy nó. Con vịt trao cho chú rùa giải thưởng của mình.<br/>Đó là ngày hạnh phúc nhất trong cuộc đời rùa rùa. Con chó mừng cho rùa.<br/>Anh ấy rất nhanh, người chó nghĩ. Tuy nhiên, anh ấy đã cố gắng hết sức và làm một điều gì đó tuyệt vời.",
        "contentTranscript": "<h2>The Big Race</h2>A dog saw a group of animals across the road. He walked over to meet them.<br/>“What are you doing?” he asked them. “I just sold them tickets to a race between the rabbit and the turtle,” the duck responded.<br/>This news excited the dog. He felt fortunate that he happened to be there. “I don’t have anything to do today,” the dog said.<br/>“I want to buy a ticket, too.” The dog sat down to observe the race. The race would be extreme.<br/>It would be many kilometers in length. The rabbit and the turtle stood next to each other.<br/>They waited for the race to start. The dog wondered why the turtle agreed to run against the rabbit.<br/>Being fast was not a characteristic of turtles. The rabbit was going to win easily.<br/>Suddenly, the race began. The rabbit ran extremely quickly. The turtle walked slowly.<br/>After a minute, the rabbit looked back.<br/>He saw that the turtle was far behind him and was breathing quickly because he was so tired. The rabbit smiled and slowed to a walk.<br/>A minute later, the rabbit said, “I’m winning, so I’ll take a rest.” He sat and began to consume some grass.<br/>Then, he let his eyes close. He wasn’t the winner yet. But there was no risk of him losing the race.<br/>He went to sleep. Hours later, a loud sound woke him. All of the animals were yelling and looking at the field.<br/>He felt fear for the first time. The turtle was almost at the finish line.<br/>Now, the rabbit realized his mistake. But the race was over.<br/>He gave the turtle an opportunity to win, and the turtle took it. The duck handed the turtle his prize.<br/>It was the happiest day of the turtle’s life. The dog was happy for the turtle.<br/>“He isn’t fast,” the dog thought. “But he tried his best and did something great.” ",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. A race between a rabbit and a turtle<br/>b. The risk of running in a race<br/>c. The extreme speed of rabbits<br/>d. How to observe a turtle<br/><br/>2. What did the duck do for the other animals?<br/>a. He told them the news.<br/>b. He gave them a prize.<br/>c. He responded to their questions.<br/>d. He sold tickets to them.<br/><br/>3. Why did the dog think the turtle had no opportunity to win the race?<br/>a. The turtle hadn’t won a race yet.<br/>b. The turtle couldn’t walk across such a length.<br/>c. Being fast was not a characteristic of turtles.<br/>d. The turtle was not fortunate.<br/><br/>4. What did the rabbit do after he woke up?<br/>a. He consumed some grass.<br/>b. He realized his mistake.<br/>c. He breathed quickly.<br/>d. He excited the animals.<br/><br/>5. What did the rabbit see to make him feel fear?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"69\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Prep</strong></td><td style=\"text-align: center;\" width=\"89\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>breathe</td><td>across</td><td>characteristic</td><td>yet</td><td>extreme</td></tr><tr><td>consume</td><td>&nbsp;</td><td>fear</td><td>&nbsp;</td><td>fortunate</td></tr><tr><td>excite</td><td>&nbsp;</td><td>length</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>happen</td><td>&nbsp;</td><td>mistake</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>observe</td><td>&nbsp;</td><td>opportunity</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>realize</td><td>&nbsp;</td><td>prize</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>respond</td><td>&nbsp;</td><td>race</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>wonder</td><td>&nbsp;</td><td>risk</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-15.json",
        "srcUrlReadingWold": "4k-essential-volume1-15-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-16-02.mp3",
        "contentTranslation": "<h2>Adams County từ vàng</h2>Học viện Adams là một trường học tốt. Chàng trai sống ở đó và tham gia các lớp học. Tom làm việc chăm chỉ cả tuần.<br/>Vào một ngày thứ bảy mùa xuân, anh muốn làm một cái gì đó vui vẻ! Anh rủ bạn mình là Jeff đi xem phim.<br/>Xin lỗi, leo Jeff trả lời. Tôi đang đi đến một buổi hòa nhạc. Vì vậy, Tom yêu cầu Joe đi xem phim.<br/>Nhưng đội bóng Joe Joe đã có một trò chơi. Tiếp theo, Tom đi xuống hành lang đến phòng Brad Hay.<br/>Brad đang đọc một cuốn sách cũ rất lớn. Chúc mừng, Brad, xông Tom nói.<br/>Bạn đang đọc một cuốn từ điển? Trông nó thật cổ kính.<br/>\"Không. Đây được gọi là Sự giàu có của Hạt Adams. Nó nói về vàng ẩn trong Quận Adams.<br/>Nó có hơn một thế kỷ. Nó được xuất bản vào năm 1870! Hãy nhìn xem, nó thậm chí còn có bìa gốc trên đó.<br/>Tom hỏi, bạn đã lấy nó ở đâu? Mùi nó từ người cha của tôi.<br/>Anh ta là một quý ông tốt bụng, một sĩ quan trong quân đội, đã trả lời Brad.<br/>Vàng không phải là vàng thực sự tồn tại, phải không? Tom hỏi.<br/>Tôi không biết, nhưng có lẽ! Có những manh mối về nó trong cuốn sách này. Hãy cùng tìm kiếm! Tìm vàng nghe có vẻ vui.<br/>Manh mối đầu tiên là tìm một cái cây bằng phẳng dưới lòng đất. Đây phải là một khu rừng.<br/>Brad cho biết, cây thông phẳng có thể là một tấm ván dưới đất. Nó có thể bao phủ vàng.<br/>Tom và Brad đào trong đất cả buổi sáng. Quá trình tìm kiếm vàng khiến họ đói.<br/>Họ đã sẵn sàng dừng lại để ăn trưa. Nhưng sau đó Brad đã đánh một cái gì đó khó khăn. Đó là một bảng!<br/>Brad đập mạnh lên bảng cho đến khi nó vỡ. Có một cái lỗ nhỏ bên dưới nó.<br/>\"Nhìn!\" Anh giơ một đồng tiền vàng lên. Tom nhìn thấy một mảnh giấy trong lỗ.<br/>Cạn Brad, có thêm nữa. Nó có một bản đồ cho phần còn lại của vàng! Brad mỉm cười.<br/>\"Đi nào!\" Và họ vội vã đi tìm sự giàu có của Hạt Adams.",
        "contentTranscript": "<h2>Adams County’s Gold</h2>Adams Academy was a good school. Boys lived there and took classes. Tom worked hard all week.<br/>On a spring Saturday, he wanted to do something fun! He asked his friend Jeff to go to the movie theater.<br/>“Sorry,” Jeff answered. “I’m going to a concert.” So Tom asked Joe to go to the movies.<br/>But Joe’s soccer team had a game. Next, Tom went down the hall to Brad’s room.<br/>Brad was reading a very large old book. “Hi, Brad,” Tom said.<br/>“Are you reading a dictionary? It looks ancient.”<br/>“No. This is called The Wealth of Adams County. It’s about hidden gold in Adams County.<br/>It’s more than a century old. It was published in 1870! Look, it even has the original cover on it.”<br/>Tom asked, “Where did you get it?” “It’s from my dad’s friend.<br/>He is a nice gentleman, an officer in the army,” answered Brad.<br/>“The gold doesn’t really exist, does it?” Tom asked.<br/>“I don’t know, but maybe! There are clues to it in this book. Let’s find it!” Looking for gold sounded like fun.<br/>The first clue was to find a flat tree underground. “It must be in the forest,” Tom said.<br/>Brad said, “The flat tree could be a board under the dirt. It could cover the gold.”<br/>Tom and Brad dug in the dirt all morning. The process of looking for gold made them hungry.<br/>They were ready to stop for lunch. But then Brad hit something hard. It was a board!<br/>Brad pounded on the board until it broke. There was a small hole under it.<br/>“Look!” He held up a gold coin. Tom saw a piece of paper in the hole.<br/>“Brad, there’s more. It’s a map to the rest of the gold!” Brad smiled.<br/>“Let’s go!” And they hurried to find the wealth of Adams County.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. Where do the boys look for the gold?<br/>a. At Adams Academy<br/>b. At the movie theater<br/>c. In the forest<br/>d. In a concert hall<br/><br/>2. What is NOT true of The Wealth of Adams County?<br/>a. It was published more than a century ago.<br/>b. It was written by an army officer.<br/>c. It still has its original cover.<br/>d. It tells about a board in the forest floor.<br/><br/>3. Why does Brad think the gold really exists?<br/>a. Because there are clues to it in a book<br/>b. Because a gentleman told him it did<br/>c. Because he was given an ancient dictionary<br/>d. Because it was hidden in the spring<br/><br/>4. Where will the boys probably go at the end of the story?<br/>a. To get tools to carry the gold<br/>b. To continue the process of finding gold<br/>c. To watch Joe’s soccer team<br/>d. To pound on more boards<br/><br/>5. Why can’t Jeff go to the movie theater?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"64\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"81\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>exist</td><td>academy</td><td>maybe</td><td>ancient</td></tr><tr><td>pound</td><td>board</td><td>&nbsp;</td><td>flat</td></tr><tr><td>publish</td><td>century</td><td>&nbsp;</td><td>hidden</td></tr><tr><td>&nbsp;</td><td>clue</td><td>&nbsp;</td><td>original</td></tr><tr><td>&nbsp;</td><td>concert</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>county</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>dictionary</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>gentleman</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>officer</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>process</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>theater</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>&nbsp;</td><td>wealth</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-16.json",
        "srcUrlReadingWold": "4k-essential-volume1-16-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-17-02.mp3",
        "contentTranslation": "<h2>Cuộc đua vì nước</h2>Có một thị trấn bên cạnh một dòng sông. Người dân ở đó đã có rất nhiều nước.<br/>Nhưng họ đã lãng phí nó. Điều đó khiến Sky tức giận. Nó nói, nếu bạn lãng phí nước, tôi sẽ lấy nó từ bạn. Nhưng người dân đã không nghe.<br/>Khi mùa thay đổi từ mùa xuân sang mùa hè, những đám mây biến mất.<br/>Mặt trời sáng chói và làm cho dòng sông khô cạn. Không có nước.<br/>Mọi người hỏi, khi nào thì mưa rơi? Phản ứng của Sky lồng là, bạn không đánh giá cao nước. Bạn lãng phí nó, và bây giờ tôi sẽ không bao giờ làm mưa nữa.<br/>Một cậu bé xác định rằng đây không phải là hội chợ. Anh nghĩ ra một giải pháp.<br/>Anh ta yêu cầu Sky đua anh ta. Anh ấy nói, nếu tôi lên đỉnh đồi trước khi cơn mưa của bạn có thể hình thành những vũng nước, bạn phải lấp đầy dòng sông của chúng tôi.<br/>Bầu trời cười. Cậu bé nhỏ, tôi là bầu trời. Tôi ở trên mọi thứ khác. Bạn không thể đánh bại tôi.\" Nhưng cậu bé biết mình sẽ thắng.<br/>Khi cuộc đua bắt đầu, cậu bé chạy về phía trước. Bầu trời bắt đầu mưa trên đồi.<br/>Nhưng vũng nước không hình thành ở đó. Khi trời mưa trên đồi, nước chảy xuống.<br/>Bầu trời cứ mưa. Nước chảy xuống sông.<br/>Khi cậu bé lên đến đỉnh đồi, dòng sông đã đầy. Mọi người bắt đầu ăn mừng.<br/>Đó là mức cao nhất mà dòng sông từng có trước đây.<br/>Bầu trời giận dữ. Một cậu bé có thể đánh bại tôi! Tôi đã giành chiến thắng trên sông của bạn.<br/>Bây giờ cậu bé cười. Ông nói điều đó không quan trọng dù bạn có muốn lấp đầy hay không, ông nói. Bạn đã làm. Bầu trời nhìn toàn cảnh dòng sông.<br/>Bạn đã lừa tôi, nó nói. Nó hỏi người dân, bạn có đánh giá cao nước không?<br/>Có, họ nói. Chúng tôi đã thắng lãng phí. Đó là cách một cậu bé đơn độc cứu thị trấn của mình và chiến thắng cuộc đua giành nước.",
        "contentTranscript": "<h2>The Race for Water</h2>There was a town next to a river. The people there had a lot of water.<br/>But they wasted it. That made the Sky angry. It said, “If you waste water, I will take it away from you.” But the people didn’t listen.<br/>When the season changed from spring to summer, the clouds disappeared.<br/>The bright sun was hot and made the river dry. There was no water available.<br/>People asked, “When will the rain fall?” The Sky’s response was, “You don’t appreciate water. You waste it, and now I will never make rain again.”<br/>A boy determined that this wasn’t fair. He thought of a solution.<br/>He asked the Sky to race him. He said, “If I get to the top of that hill before your rain can form puddles, you must fill our river.”<br/>The Sky laughed. “Little boy, I am the Sky. I am above everything else. You cannot beat me.” But the boy knew he would win.<br/>When the race began, the boy ran forward. The Sky started raining on the hill.<br/>But puddles did not form there. When it rained on the hill, the water went down.<br/>The Sky kept raining. The water flowed down into the river.<br/>When the boy reached the top of the hill, the river was full. The people began to celebrate.<br/>It was the highest level the river had ever been at before.<br/>The Sky was angry. “A boy can’t beat me! I won’t fill your river,” it said.<br/>Now the boy laughed. “It doesn’t matter whether you want to fill it or not,” he said. “You already did.” The Sky looked at the full river.<br/>“You tricked me,” it said. It asked the people, “Do you appreciate water now?”<br/>“Yes,” they said. “We won’t waste it.” That is how a lone boy saved his town and won the race for water.",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is this story about?<br/>a. A boy who swims in a river<br/>b. People who celebrate at a party<br/>c. A boy with the solution to a problem<br/>d. People who learn to appreciate a hill<br/><br/>2. The river became dry when_______________ .<br/>a. the water went somewhere else<br/>b. the bright sun became very hot<br/>c. the people found available water nearby<br/>d. the season changed from summer to spring<br/><br/>3. How did the boy save the town?<br/>a. He made the clouds disappear.<br/>b. He beat the rain to the top of the hill.<br/>c. He moved forward faster than the sun.<br/>d. He promised not to waste any more water.<br/><br/>4. What was the last thing the Sky did in the story?<br/>a. It raced a lone boy to the top of the hill.<br/>b. It saw the river at its highest level.<br/>c. It asked the people for a response about water.<br/>d. It determined the people wasted too much water.<br/><br/>5. What did the boy say when he reached the top of the hill?",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"73\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Conj</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adv</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>appreciate</td><td>hill</td><td>whether</td><td>forward</td><td>available</td></tr><tr><td>beat</td><td>puddle</td><td>&nbsp;</td><td>&nbsp;</td><td>bright</td></tr><tr><td>celebrate</td><td>response</td><td>&nbsp;</td><td>&nbsp;</td><td>else</td></tr><tr><td>determine</td><td>season</td><td>&nbsp;</td><td>&nbsp;</td><td>fair</td></tr><tr><td>disappear</td><td>solution</td><td>&nbsp;</td><td>&nbsp;</td><td>lone</td></tr><tr><td>flow</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>level</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>waste</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-17.json",
        "srcUrlReadingWold": "4k-essential-volume1-17-01.mp3"
    },
    {
        "srcUrl": "4k-essential-volume1-18-02.mp3",
        "contentTranslation": "<h2>Con gà nhỏ màu đỏ</h2>Một con gà nhỏ màu đỏ có một cửa hàng trong một thị trấn nhỏ.<br/>Cô đã bán nhiều mặt hàng khác nhau cho người dân trong thị trấn.<br/>Những người yêu thích sản phẩm của cô. Một ngày nọ, một con mèo đến tài sản của cô.<br/>Anh ta nhìn thấy tấm biển chỉ ra nơi đặt cửa hàng gà.<br/>Anh muốn mua bánh mì, nhưng cửa hàng gà gần như trống rỗng. Cô chỉ có một túi lúa mì.<br/>Bạn có thể sử dụng lúa mì để làm bánh mì, gà nói.<br/>Không, tôi không muốn làm việc, mèo nói. Tôi chỉ muốn mua bánh mì. Con mèo trở nên tức giận và rời khỏi cửa hàng.<br/>Sau đó, con gà nhỏ màu đỏ nhìn thấy con mèo trong một đám đông.<br/>Tôi sẽ giúp bạn làm bánh mì, cô ấy nói.<br/>Nhưng con mèo đối xử tệ với cô. Anh thậm chí còn không liên lạc với cô.<br/>Anh không muốn làm bất cứ việc gì. Thế là gà quyết định làm bánh mì.<br/>Cô chọn số lượng chính xác của lúa mì để làm bánh mì tươi.<br/>Cô đã sử dụng một hòn đá để giã lúa mì để sẵn sàng. Chẳng mấy chốc, bánh mì của cô đã sẵn sàng.<br/>Con mèo đến và nhìn thấy bánh mì trên một món ăn. Hãy cho tôi một ít bánh mì của bạn, anh ấy nói.<br/>Gà Không, Sọ nói con gà nhỏ màu đỏ. Bạn không giúp tôi làm bánh mì.<br/>Vì vậy, bạn sẽ không có bất kỳ để ăn. Con mèo cãi nhau với con gà.<br/>Ông đã cố gắng đưa ra một mức giá cho nó. Nhưng con gà nhỏ màu đỏ không muốn bán bánh mì của cô.<br/>Giáo Don Don phụ thuộc vào người khác để làm việc cho bạn, anh ấy nói con gà nhỏ màu đỏ.<br/>Làm thế nào để tôi có được bánh mì? Con mèo hỏi.<br/>Tôi khuyên bạn nên thực hiện một số công việc, chú gà nhỏ nói. Sử dụng một công cụ để trồng lúa mì của riêng bạn.<br/>Khi nó lớn lên, bạn có thể thu thập nó và tự làm bánh mì.<br/>Bạn cần học cách làm việc cho những gì bạn muốn.",
        "contentTranscript": "<h2>The Little Red Chicken</h2>A little red chicken had a store in a small town.<br/>She sold many different items to people in the town.<br/>The people loved her products. One day, a cat came to her property.<br/>He saw the sign that indicated where the chicken’s store was located.<br/>He wanted to purchase bread, but the chicken’s store was almost empty. She had only a bag of wheat.<br/>“You can use the wheat to make bread,” the chicken said.<br/>“No, I don’t want to work,” the cat said. “I just want to buy bread.” The cat became angry and left the store.<br/>Later, the little red chicken saw the cat in a crowd.<br/>“I will help you make the bread,” she said.<br/>But the cat treated her badly. He did not even communicate with her.<br/>He did not want to do any work. So the chicken decided to make the bread.<br/>She selected the exact amount of wheat to make fresh bread.<br/>She used a stone to pound the wheat to get it ready. Soon, her bread was ready.<br/>The cat came and saw the bread on a dish. “Give me some of your bread,” he said.<br/>“No,” said the little red chicken. “You did not help me make the bread.<br/>So you shall not have any to eat.” The cat argued with the chicken.<br/>He tried to offer a price for it. But the little red chicken did not want to sell her bread.<br/>“Don’t depend on others to do work for you,” said the little red chicken.<br/>“Then how will I get bread?” the cat asked.<br/>“I recommend doing some work,” said the little red chicken. “Use a tool to plant your own wheat.<br/>When it grows big, you can gather it and make your own bread.<br/>You need to learn to do work for what you want.”",
        "readingComprehension": "<h2>Answer the questions.</h2>1. What is the story about?<br/>a. A chicken finding a friend to depend on<br/>b. A chicken making bread out of wheat<br/>c. Why a cat’s store did not have any items<br/>d. The exact amount of wheat needed to make bread<br/><br/>2. What did the cat do when the chicken asked him to help make the bread?<br/>a. He did not communicate with her.<br/>b. He argued with the little red chicken.<br/>c. He said that he would gather all the things needed to make the bread.<br/>d. He treated her very nicely.<br/><br/>3. How did the cat find the chicken’s store?<br/>a. He saw tools being sold outside of the store.<br/>b. He saw a stone with the store’s name.<br/>c. His friend told him to purchase bread there.<br/>d. He saw a sign that indicated her property.<br/><br/>4. What did the cat do when he saw the fresh bread?<br/>a. He selected the product for himself.<br/>b. He tried to buy some of it for a price.<br/>c. He brought a crowd of friends with him to eat.<br/>d. He asked why her store was empty.<br/><br/>5. What did the little red chicken recommend the cat to do to have some bread?<br/>...",
        "tableWordType": "<table border=\"1\" cellspacing=\"5\" cellpadding=\"10\"><tbody><tr><td style=\"text-align: center;\" width=\"92\"><strong>Verb</strong></td><td style=\"text-align: center;\" width=\"61\"><strong>Noun</strong></td><td style=\"text-align: center;\" width=\"64\"><strong>Adj</strong></td></tr><tr><td>argue</td><td>crowd</td><td>empty</td></tr><tr><td>communicate</td><td>dish</td><td>exact</td></tr><tr><td>depend</td><td>item</td><td>fresh</td></tr><tr><td>gather</td><td>price</td><td>&nbsp;</td></tr><tr><td>indicate</td><td>product</td><td>&nbsp;</td></tr><tr><td>offer</td><td>property</td><td>&nbsp;</td></tr><tr><td>purchase</td><td>tool</td><td>&nbsp;</td></tr><tr><td>recommend</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>select</td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td>treat</td><td>&nbsp;</td><td>&nbsp;</td></tr></tbody></table>",
        "linkedWordFile": "4k-essential-volume1-18.json",
        "srcUrlReadingWold": "4k-essential-volume1-18-01.mp3"
    }
]