[
    {
        "srcUrl": "2t5hz.mp3",
        "contentTranslation": "Do có vấn đề về ánh sáng, nên buổi hòa nhạc sẽ bị hoãn lại cho đến thứ Sáu ngày 22. Buổi hòa nhạc cũng sẽ được chuyển từ sảnh A sang sảnh C lớn hơn. Địa điểm lớn hơn có nghĩa là sẽ có thêm 500 vé được bán, gấp đôi con số ban đầu. Vì có thêm vé nên vé sẽ có giá thấp hơn, là 20 đô.",
        "contentTranscript": "Due to problems with the lighting, the concert has to be postponed until Friday the 22nd. The concert will also be moved from hall A to the larger hall C. A bigger venue means a further five hundred tickets will now be available, twice the original number. Because of the extra tickets, tickets will now be priced at the lower cost of twenty dollars."
    },
    {
        "srcUrl": "39kdG.mp3",
        "contentTranslation": "Số bào ngày mai sẽ là số cuối cùng của tờ báo chúng ta. Tất cả chúng ta đều biết ngày này sẽ đến, và nó đúng là một ngày buồn bã. Chúng ta mất gần $20 triệu trong năm qua và chủ báo đã cố bán tờ báo nhưng không ai muốn mua trong tình hình kinh tế như thế này. Tôi muốn cám ơn tất cả các bạn, tất cả biên tập viên, nhà văn, nhiếp ảnh gia, thiết kế trang báo, in ấn,... tất cả những người đã giúp đỡ biến tờ báo này thành một truyền thống của thành phố trong 150 năm qua. Thật là một hân hạnh và niềm vui khi được làm việc và giám sát các bạn. Như các bạn đã nghe, chúng ta sẽ tiếp tục có một trang báo mạng với dàn nhân viên gồm 25 người. Trang web được thiết kế lại này sẽ bắt đầu vào ngày mai. Chúng ta hi vọng là nó sẽ giúp lắp vào khoảng trống do sản phẩm in để lại. Còn giờ, chúng ta còn một tờ báo nữa cần in. Chúng ta hãy cùng làm cho nó trở nên hay nhất có thể nào.",
        "contentTranscript": "Tomorrow's issue will be the last one for our newspaper. We all knew this day was coming, and it is a sad day. We lost almost $20 million last year, and the owners have tried to sell the paper but no one wants to buy it in this economy. I want to thank all of you, all the editors, writers, photographers, page designers, printers -- everyone who helped make this paper a city institution for the past 150 years. It's been a pleasure and an honor working with you and supervising you. As you've heard, we will continue to have an online news site with a staff of 25. This re-designed website will begin tomorrow. We hope that it will help fill the gap left by the departed print product. Meanwhile, we have one more issue to put out. Let's get to work and make it the best it can be."
    },
    {
        "srcUrl": "zT97O.mp3",
        "contentTranslation": "Xin chào, tin nhắn này dành cho Tayna Smith. Tayna, tên tôi là Karl Klaussen ở công ty bảo hiểm Premium. Cô có nhờ tôi gửi bản báo giá cho xe hai cửa 2007 Toyaki Turbo. Tôi đã xử lý thông tin của cô và chúng tôi có thể nhận bảo hiểm cho nó với giá $600 một năm. Đó nghĩa là $50 một tháng, và cô có thể chọn trả theo tháng hay trả trước. Giá này là giá đã được giảm vì có lý lịch lái xe tốt, và vì có bảo hiểm nhà cũng ở chỗ chúng tôi cũng như bảo hiểm xe hơi. Nó là bảo hiểm toàn diện, không kèm bảo hiểm cho người lái, và lên đến $50000 bảo hiểm trách nhiệm. Chúng tôi có thể bắt đầu bảo hiểm vào đầu tháng sau. Nếu cô có bất cứ câu hỏi nào, tôi rất vui khi được trả lời chúng. Cô có thể gọi cho tôi theo số 590-095-6446 hoặc điện thoại riêng ở số 342-768-0120. Cám ơn đã chọn bảo hiểm Premium.",
        "contentTranscript": "Hello, this message is for Tayna Smith. Tayna, my name is Karl Klaussen with Premium Insurance Company. You had asked me to give you a quotation for your 2007 Toyaki Turbo coupe. I've processed your information, and we could insure this vehicle for $600 a year. That's $50 a month, and you have the choice of paying monthly or in advance. This price includes discounts for having a good driving record, and for also having your homeowner's insurance with us as well as your auto insurance. It includes comprehensive coverage, uninsured motorist protection, and up to $50,000 liability. We could begin coverage at the first of next month. If you have more questions I'd be happy to answer them. You can reach me at 590-095-6446 or on my cell at 342-768-0120. Thank you for considering Premium Insurance."
    },
    {
        "srcUrl": "XpCLj.mp3",
        "contentTranslation": "Tôi là một người tổ chức lễ cưới. Công việc của tôi mang đến cho tôi rất nhiều niềm vui. Hôm nay là một ngày tuyệt vời. Tôi đang tổ chức lễ cưới của em gái tôi. Nó sẽ mặc một cái váy màu trắng xinh đẹp. Tôi cũng sẽ mặc một cái váy rất xinh. Sau lễ cưới, tất cả khách ăn tối và khiêu vũ hàng giờ. Vào buổi tối, em tôi và chồng mới cưới sẽ cắt bánh do tôi thiết kế. Tôi hy vọng họ thích nó.",
        "contentTranscript": "I'm a wedding planner. My job brings me a lot of pleasure. Today is an amazing day. I am planning my sister's wedding. She will wear a beautiful white dress. I also get to wear a lovely dress. After the wedding, all the guests will have a nice dinner and will dance for hours. In the evening my sister and her new husband will cut a cake that I designed. I hope they like it a lot."
    },
    {
        "srcUrl": "7PVex.mp3",
        "contentTranslation": "Xin chú ý. Chúng tôi muốn nhắc các bạn rằng thứ Hai tuần sau lúc 9 giờ, chúng ta sẽ có buổi dã ngoại dành cho nhân viên hàng năm. Tất cả nhân viên và gia đình đều được mời tham gia. Rất nhiều thức ăn và nước uống sẽ được phục vụ cho tất cả mọi người và chúng ta sẽ có tiệc nướng. Chúng ta cũng sẽ có sự vui vẻ và những trò chơi hàng năm.Phần thưởng gồm có một đầu DVD mới và một kỳ nghỉ.",
        "contentTranscript": "Attention, please. We would like to remind you that next Monday at nine o'clock, we will be having our yearly staff picnic. All staff and their families are invited to attend. Plenty of food and drink will be provided for everyone, and we will be having our famous barbecue. We will also have our annual fun and games. Prizes include a new DVD player and a holiday."
    },
    {
        "srcUrl": "g0fZO.mp3",
        "contentTranslation": "Trạm tiếp theo là Main Street. Cửa xuống nằm bên trái. Bạn có thể chuyển sang line màu trắng, line số 4 để đi sân bóng đá Seoul. Xin vui lòng cẩn thận khi rời tàu.",
        "contentTranscript": "The next stop is Main Street. The exit doors are on the left side. You can transfer to the white line, line number 4, to Seoul soccer stadium. Please be careful as you leave the train."
    },
    {
        "srcUrl": "2g4y8.mp3",
        "contentTranslation": "Đây là bản tin dự báo thời tiết đặc biệt. Xin lưu ý rằng cả khu vực đang trong tầm ngắm của cơn lũ. Chúng ta đang chịu trận mưa to, và chúng tôi dự báo mưa sẽ còn diễn ra tiếp tục trong vòng 24 giờ tới. Hiện tại có gió nhẹ, tuy nhiên các cơn gió lớn có thể sẽ quét qua khu vực trong đêm, mang theo mưa to hơn và có thể có mưa đá. Ngày mai, lũ được dự đoán sẽ quét qua các khu vực địa hình thấp và lan rộng ra nếu các cơn mưa to vẫn tiếp tục. Mọi người sống trong bán kính một dặm của sông Green nên theo dõi vào ngày mai để biết lệnh sơ tán.",
        "contentTranscript": "This is a special weather report. Please be aware that the entire region is under a flood watch. We are currently experiencing heavy rains, which we expect to continue for the next twenty-four hours. While there is little wind now, heavy winds may move into the area overnight, bringing even more rain and possibly hailstorm with them. By tomorrow, flooding is expected in low-lying areas and may become widespread if the heavy rain continues. Everyone living within a mile of the Green River should listen tomorrow for evacuation orders."
    },
    {
        "srcUrl": "IjSJi.mp3",
        "contentTranslation": "Xin chào moi người. Ngày hôm nay là một ngày đẹp trời phải không ạ? tôi tên là Richard Benson và tôi được phân làm người hướng dẫn đoàn cho hôm nay. Chúng ta sẽ bắt đầu ngày tham quan bằng việc đi bộ một đoạn ngắn lên núi để quan sát những loài động vật hoang dã và những loài thực vật đặc biệt mà bạn không thể tìm thấy chúng ở nơi nào khác trên trái đất này. Sau đó chúng ta sẽ qua một số ngôi đền phật giáo được xây dựng ở thế kỷ thứ 18. Chúng ta sẽ nghỉ ngơi ở đó và cảm nhận sự tĩnh lặng của nơi đây. Sau đó, chúng ta sẽ đi về khu chợ của thành phố dùng bữa trưa. Khi đến đó, bạn sẽ cảm nhận được hết tất cả sự duyên dáng của con người địa phương. Sau đó chúng ta sẽ đến nông trại rắn để ngắm nhìn một vài loài sinh vật độc nhất trên trái đất này. Nào mọi người, hãy chuẩn bị sẵn sàng. Và cũng đừng quên mang theo máy quay phim hoặc máy ảnh kỹ thuật số nhé.",
        "contentTranscript": "Good morning, everyone. It's a bright, beautiful day today, isn't it? My name is Richard Benson and I'm your assigned tour guide for today. We'll start off the day by taking a short hike up the mountain to observe the wild animals and exotic forestry, which are found in no other region of the earth than this one. Then we'll pass some Buddhist temples, which were constructed in the 18th century. We will spend some time there to relax and feel the serenity of the place. Afterwards, we will head toward the city market for lunch. Once there, you will get to enjoy all kinds of delicacies of the local people. After lunch, we'll take you to a snake farm to take a look at some of the most venomous creatures on this earth. So everyone, let's all get ready to leave. Also, don't forget to pack your video or digital cameras.",
        "AskOne": "Who is the speaker?",
        "AskOneTrans": "Người nói là ai?",
        "AnswerOne": "A tour guide.",
        "AnswerOneTrans": "Hướng dẫn viên du lịch.",
        "AskTwo": "What will they do first?",
        "AskTwoTrans": "Đầu tiên họ sẽ làm gì?",
        "AnswerTwo": "Walk up the mountain.",
        "AnswerTwoTrans": "Leo núi.",
        "AskThree": "What does the speaker remind the listeners to do?",
        "AskThreeTrans": "Người nói nhắc nhở người nghe làm gì?",
        "AnswerThree": "To bring along their cameras.",
        "AnswerThreeTrans": "Mang theo máy chụp ảnh."
    },
    {
        "srcUrl": "XiPyC.mp3",
        "contentTranslation": "Con trai tôi là họa sĩ. Nó luôn thích vẽ, thậm chí từ hồi chỉ là một đứa trẻ. Khi nó còn đang học tiểu học, nó giành được giải thưởng hội họa đầu tiên trong đời. Nó vẽ một con mèo và giành được giải nhất. Khi về nhà, nó đã rất vui vì đã cố thử vẽ chú mèo ở nhà! Kể từ đó nó đã vẽ nhiều tranh. Giờ thì nó đã có xưởng cho riêng mình và vẽ ra những bức tranh mà được khách sạn và nhà hàng mua để trang trí trên tường. Hầu hết là nó vẽ tranh phong cảnh nhưng nó có thể vẽ bất cứ thứ gì. Bạn chỉ cần nói ra là nó sẽ vẽ được ngay. Lần sau, khi đi đến nhà hàng, hãy nhìn vào tranh trên tường... có thể nó là do con trai tôi vẽ đấy.",
        "contentTranscript": "My son is a painter. He always liked painting, even as a little child. When he was a student in elementary school he won his first art competition. He painted a picture of a cat and won first prize. When he came home he was so happy that he actually tried to paint our cat! Since then he has done many paintings. Now, he has his own studio, and he makes paintings that are bought by hotels and restaurants to decorate their walls. Mostly he does landscapes, but he can paint anything. You name it, he can paint it. Next time you go to a restaurant, look at the painting on the wall... it may have been done by my son.",
        "AskOne": "What did the speaker's son paint in elementary school?",
        "AskOneTrans": "Con trai người nói đã vẽ gì hồi còn học tiểu học?",
        "AnswerOne": "A painting of a cat.",
        "AnswerOneTrans": "Tranh về một chú mèo.",
        "AskTwo": "Who buys his son's paintings?",
        "AskTwoTrans": "Ai mua tranh của con trai ông?",
        "AnswerTwo": "Hotels and restaurants.",
        "AnswerTwoTrans": "Khách sạn và nhà hàng.",
        "AskThree": "What kinds of paintings does the man's son do?",
        "AskThreeTrans": "Con trai người đàn ông vẽ loại tranh gì?",
        "AnswerThree": "Landscapes.",
        "AnswerThreeTrans": "Tranh phong cảnh"
    },
    {
        "srcUrl": "ITkZi.mp3",
        "contentTranslation": "Nhiều người nghĩ rằng làm bác sĩ thú y thì rất dễ dàng nhưng điều đó không đúng. Trước tiên, khóa đào tạo rất khó. Một người phải học những kiến thức y khoa căn bản dành để chữa trị cho người trước. Sau đó, người đó mới phải học về những khác biệt về vị trí cơ quan giữa động vật và con người. Cơ quan con người thì giống nhau cho tất cả mọi người. Tuy nhiên, tim của chó thì nằm khác chỗ với tim của mèo; bác sĩ thú y cần phải biết điều đó. Hơn nữa, bác sĩ thú y phải giỏi thấu hiểu động vật. Động vật không thể nói chuyện và nói cho bạn biết cái gì không ổn, cho nên bạn phải học cách hiểu mà không cần dùng đến lời nói. Tôi nghĩ rằng đây chính là phẩm chất quan trọng nhất.",
        "contentTranscript": "A lot of people think that being an animal doctor is very easy, but it is not. First, the training is very difficult. A person has to learn the same basic medical information as a doctor for people. Then, a person has to learn about how different animals have their organs in different places. Human organs are in the same position in all people. However, a dog's heart is in a different location than a cat's heart; animal doctor need to know that. Also, animal doctors need to be good at understanding animals. Animals cannot talk and tell you what is wrong, so you have to learn how to understand without words. I think that this is the most important quality.",
        "AskOne": "What job is the talk about?",
        "AskOneTrans": "Công việc nào đang được nói đến?",
        "AnswerOne": "Animal doctor.",
        "AnswerOneTrans": "Bác sĩ thú y",
        "AskTwo": "According to the talk, what is the most important quality a person in this job should have?",
        "AskTwoTrans": "Theo như cuộc nói chuyện thì đâu là phẩm chất quan trọng nhất mà một người làm công việc này cần phải có?",
        "AnswerTwo": "A good understanding of animals.",
        "AnswerTwoTrans": "Giỏi thấu hiểu động vật",
        "AskThree": "What is different about being an animal doctor?",
        "AskThreeTrans": "Đâu là sự khác biệt khi làm một bác sĩ thú y?",
        "AnswerThree": "You need to know where all the different animals' organs are.",
        "AnswerThreeTrans": "Bạn cần phải biết vị trí các cơ quan của tất cả các loài động vật khác nhau."
    },
    {
        "srcUrl": "fgvtL.mp3",
        "contentTranslation": "Kính chào quý ông và quý bà, tôi xin có đôi lời. Chúng tôi lấy làm tiếc khi phải thông báo cho quý vị biết là một cơn giông bão ở Chicago đã làm trì hoãn nhiều chuyến bay. Chuyến bay Bluebird Airlines số 963 đến Brussels, được lên lịch khởi hành vào lúc 10h30 ở cổng C-7, giờ đã được chuyển sang 11h45 từ cổng C-4. Chuyến bay Concord Airlines 226 đến Hong Kong, được lên lịch khởi hành vào lúc 11h30 ở cổng N-8, giờ được chuyển sang 2h chiều. Thêm vào đó, tất cả chuyến bay đến của hãng Midwestern Airlines đã bị trì hoãn một tiếng. Các chuyến bay đến của hãng Jet Green Air cũng bị trì hoãn không liên tục. Vui lòng kiểm tra bảng thông báo chuyến đến và chuyến khởi hành, nằm ở đại sảnh của từng ga chính để biết thêm thông tin chi tiết và cập nhật cho từng chuyến bay. Với những hành khách bị lỡ chuyến bay chuyển tiếp, vui lòng đi đến quầy dịch vụ của hãng máy bay của quý vị để được trợ giúp thêm. Chúng tôi xin lỗi vì sự bất tiện này.",
        "contentTranscript": "Ladies and gentlemen, can I have your attention please. We regret to inform you that a thunderstorm in Chicago has delayed several flights. Bluebird Airlines Flight 963 to Brussels, scheduled for departure at 10:30 from gate C-7, is now scheduled to depart at 11:45 from gate C-4. Concord Airlines Flight 226 to Hong Kong, scheduled for departure at 11:30 from gate N-8, is now scheduled to depart at 2 o'clock. In addition, all flights arriving on Midwestern Airlines have been delayed one hour. Flights arriving on Jet Green Air have been delayed intermittently. Please check the arrivals and departure boards, located on the concourses of each main terminal, for more specific information and updates on individual flights. For passengers who will miss connecting flights, please go to the customer service desk of your respective airlines for assistance. We are sorry for the inconvenience.",
        "AskOne": "Who is the intended audience for this announcement?",
        "AskOneTrans": "Thông báo này nhắm đến đối tượng khán giả là?",
        "AnswerOne": "Airline customers",
        "AnswerOneTrans": "Khách hàng hàng không",
        "AskTwo": "Where would the announcement most likely be heard?",
        "AskTwoTrans": "Có thể nghe được thông báo này ở đâu?",
        "AnswerTwo": " In an airport waiting area",
        "AnswerTwoTrans": "Trong khu chờ của sân bay",
        "AskThree": "What does the speaker suggest listeners do?",
        "AskThreeTrans": "Người nói đề nghị người nghe làm gì?",
        "AnswerThree": "Get more information",
        "AnswerThreeTrans": " Lấy thêm thông tin"
    },
    {
        "srcUrl": "mPzTo.mp3",
        "contentTranslation": "Mấy bài kiểm tra của tôi hôm nay rất khó. Tôi có 3 bài kiểm tra. Vào buổi sáng, tôi có bài kiểm tra môn tiếng Pháp. Với tôi, tiếng Pháp rất khó, đặc biệt là về chính tả. Tôi không thể nào nhớ nổi là mình có cần thêm chữ \"e\" ở cuối từ hay không, mấy thứ đại loại như vậy. Sau đó, sau giờ trưa, tôi có bài kiểm tra lịch sử. Tôi không thể nào nhớ nổi những ngày tháng mà tôi đã học trước giờ kiểm tra. Lịch sử là môn khó nhất vì tôi thấy nó chán ngắt. Cuối cùng, vào buổi chiều, tôi có bài kiểm tra toán. Nó khó nhưng toán lại là môn học yêu thích của tôi nên tôi nghĩ tôi làm nó khá tốt. Tôi giỏi toán và thường được điểm cao nên tôi chắc là mình sẽ có điểm tốt. Trong học kỳ trước, tôi đạt điểm cao nhất trong lớp đấy.",
        "contentTranscript": "My exams today were so difficult. I had three exams. In the morning, I had a French exam. French is really difficult for me, especially French spelling. I can never remember if I need an extra \"e\" at the end of words and that kind of thing. Then, after lunch I had a history exam. I couldn't remember any of the dates that I studied before the exam. History is the most difficult subject because I find it boring. Finally, in the afternoon I had a math exam. It was difficult, but math is my favorite subject, so I think I did pretty well on the exam. I'm good at math and I usually get high grades, so I'm sure I'll get a good score. Last semester, I got the best grade in my class.",
        "AskOne": "When did the speaker have the French exam?",
        "AskOneTrans": "Người nói có bài kiểm tra tiếng Pháp khi nào?",
        "AnswerOne": "In the morning.",
        "AnswerOneTrans": "Vào buổi sáng",
        "AskTwo": "Why does the speaker dislike history?",
        "AskTwoTrans": "Tại sao người nói lại ghét lịch sử?",
        "AnswerTwo": "It is boring.",
        "AnswerTwoTrans": "Nó chán ngắt.",
        "AskThree": "What subject is the speaker's favorite?",
        "AskThreeTrans": "Môn học yêu thích của người nói là gì?",
        "AnswerThree": "Math",
        "AnswerThreeTrans": "Toán"
    },
    {
        "srcUrl": "IyrnE.mp3",
        "contentTranslation": "Anh trai tôi, John, vừa mới trở thành trọng tài bóng đá. Anh ấy sẽ làm trọng tài lần đầu tiên trong tháng tới. Anh ấy đã chơi bóng đá khoảng 3 năm và luôn muốn trở thành một trọng tài. Trọng tài là một người theo dõi trận bóng đá và quyết định xem liệu là người chơi có làm gì mà họ không nên làm hay không, chẳng hạn như dùng tay, hay chơi xấu, như đá người chơi khác. Chuyện đó xảy ra nhiều hơn là bạn tưởng. Nếu trọng tài thấy người chơi làm một chuyện như vậy, trọng tài có quyền phạt người chơi. Nếu người chơi nhận 3 thẻ phạt thì buộc phải rời khỏi trận đấu. Đó là một hình phạt rất nghiêm trọng, và người chơi có thể sẽ trở nên rất tức giận. Người chơi đôi khi trở nên rất giận trọng tài nên cũng khá là căng thẳng. Trọng tài bóng đá phải biết luật chơi bóng đá rất rõ. Anh tôi thích bóng đá và tôi biết anh ấy sẽ là một trọng tài tuyệt vời.",
        "contentTranscript": "My brother John just became a soccer referee. He will referee for the first time next month. He has been playing soccer for about three years, and he has always wanted to be a referee. A referee is a person who watches the soccer game and decides if the players are doing anything that they shouldn't be doing, like using their hands, or committing a foul, like kicking another player. It happens more often than you might expect. If the referee finds a player doing anything like this, he can give the player a penalty. If a player gets three penalties, he must leave the game. It's a very serious punishment, and the players can get very upset. Players sometime get very angry with the referee, so it can be quite stressful. Soccer referees have to know the rules of soccer very well. My brother loves soccer and I know that he will be a great referee.",
        "AskOne": "What is John's job?",
        "AskOneTrans": "Công việc của John là gì?",
        "AnswerOne": "He is a soccer referee.",
        "AnswerOneTrans": "Anh ấy là trọng tài bóng đá.",
        "AskTwo": "What is true about John?",
        "AskTwoTrans": "Điều gì là đúng về John?",
        "AnswerTwo": "His first game is next month.",
        "AnswerTwoTrans": "Trận đấu đầu tiên của anh là vào tháng sau.",
        "AskThree": "How long has John been playing soccer?",
        "AskThreeTrans": "John chơi thể thao được bao lâu rồi?",
        "AnswerThree": "3 years.",
        "AnswerThreeTrans": "3 năm"
    },
    {
        "srcUrl": "P0cDC.mp3",
        "contentTranslation": "Nhiều người có ý tưởng rất hay, nhưng rất khó khăn trong việc làm cho doanh nghiệp của họ thành công. Nếu bạn thuộc tuýp người thích khởi nghiệp và hứng thú với việc tự kinh doanh, sau đây là một vài lời rất thú vị từ những người khởi nghiệp trước như Michael Bell và Susan McDonald, những người đã tự mở công ty cho chính mình. Trước hết, có thể bạn cần phải có một ý tưởng tuyệt vời, nhưng những ý tưởng tuyệt vời không vận hành được một công ty. Để vận hành được công ty, bạn chắc chắn cần phải có kế hoạch kinh doanh. Bằng cách này nếu bạn không chắc liệu có đang đi đúng hướng trong lúc kinh doanh hay không, bạn có thể quay lại kế hoạch kinh doanh ban đầu mà bạn đề ra trước khi bạn bắt đầu kinh doanh.",
        "contentTranscript": "Many people have great ideas, yet they have much difficulty in getting their own businesses off the ground. If you are the entrepreneurial type and are interested in starting your own business, here are a couple of words of interest from previous entrepreneurs such as Michael Bell and Susan McDonald, who have started their own businesses. First, you may have a great idea, but great ideas don't run a business. To run a great business, it is always recommended that you have a business plan. This way if you're not sure where you are headed during the course of your business, you can always refer to the business plan that you constructed before you started your business.",
        "AskOne": "What is the purpose of the talk?",
        "AskOneTrans": " Mục đích của bài nói là gì?",
        "AnswerOne": "To provide advice to people who are thinking of starting a business.",
        "AnswerOneTrans": "Cung cấp lời khuyên cho những người muốn khởi nghiệp.",
        "AskTwo": "Who is Michael Bell?",
        "AskTwoTrans": "Michael Bell là ai?",
        "AnswerTwo": "A business owner. ",
        "AnswerTwoTrans": "Chủ doanh nghiệp.",
        "AskThree": "What does the speaker recommend?",
        "AskThreeTrans": "Người nói khuyên điều gì?",
        "AnswerThree": "To always prepare a business plan.",
        "AnswerThreeTrans": "Luôn luôn lên kế hoạch kinh doanh."
    },
    {
        "srcUrl": "BGjNl.mp3",
        "contentTranslation": "Tôi rất vinh hạnh khi được giới thiệu với các bạn cô Paula Adams. Cô Adams đến từ Anh, nhưng đã làm việc ở Cuba trong 6 tháng qua với tư cách là phóng viên của Daily Star, tờ báo tiếng Anh duy nhất của đảo. Một số bài viết của cô ấy đã được đề cử giải thưởng nhờ vào lối viết rõ ràng. Tối nay, cô Adams sẽ nói về bài viết gần đây nhất của cô về những người làm trong ngành du lịch của đảo này.",
        "contentTranscript": "It is a pleasure to introduce to you, Paula Adams. Ms. Adams is from England, but has been working in Cuba for the past six months as a reporter for The Daily Star, the island's only English-language newspaper. Several of her articles have been recommended for awards due to her clear writing style. Tonight, Ms. Adams will talk about her most recent article about the workers in the tourism industry on this island.",
        "AskOne": "What is Ms. Adams's occupation?",
        "AskOneTrans": " Nghề nghiệp của cô Adams là gì?",
        "AnswerOne": "Reporter",
        "AnswerOneTrans": "Phóng viên",
        "AskTwo": "Where is Ms. Adams from?",
        "AskTwoTrans": "Cô Adams đến từ đâu?",
        "AnswerTwo": "England",
        "AnswerTwoTrans": "Anh",
        "AskThree": "How long has Ms. Adams been working for The Daily Star?",
        "AskThreeTrans": "Cô Adams đã làm việc cho Daily Star được bao lâu?",
        "AnswerThree": " Six months",
        "AnswerThreeTrans": "6 tháng"
    },
    {
        "srcUrl": "GZcXl.mp3",
        "contentTranslation": "Thứ Hai sẽ ấm áp đối với hầu hết các khu vực, với một chút mưa ở phía bắc đất nước. Nhiệt độ sẽ đạt đến 25 độ ở phía nam và khoảng 20 độ ở phía bắc. Thứ Ba cũng có thời tiết tương tự, với nhiệt độ hơi cao, khoảng 23 độ ở phía bắc.",
        "contentTranscript": "Monday will be warm in most areas, with some rain in the north of the country. Temperatures will reach up to 25 degrees in the south and around 20 degrees in the north. Tuesday will also have similar conditions, with slightly higher temperatures of about 23 degrees in the north.",
        "AskOne": "According to the weather report, where will the rain be?",
        "AskOneTrans": "Theo dự báo thời tiết, ở đâu sẽ có mưa?",
        "AnswerOne": "In the north",
        "AnswerOneTrans": "Ở phía bắc",
        "AskTwo": "How high will the temperatures reach in the north on Tuesday?",
        "AskTwoTrans": "Nhiệt độ ở phía bắc sẽ cao bao nhiêu trong thứ Ba?",
        "AnswerTwo": "23 degrees",
        "AnswerTwoTrans": "23 độ",
        "AskThree": "What difference will be seen between Monday and Tuesday?",
        "AskThreeTrans": "Có thể nhận thấy sự khác biệt gì giữa thứ Hai và thứ Ba?",
        "AnswerThree": "There will be some higher temperatures on Tuesday",
        "AnswerThreeTrans": "Nhiệt độ vào thứ Ba sẽ cao hơn."
    },
    {
        "srcUrl": "zcElN.mp3",
        "contentTranslation": "Cảm thấy kiệt sức? Thiếu năng lượng? Cứ như là bạn chẳng thể nào sống nổi qua ngày? Vậy đã đến lúc bạn cần đến Rev Up. Một gói Rev Up chứa đủ vitamin và khoáng chất để bổ sung năng lượng cho bạn suốt 5 tiếng liền. Và phần tốt nhất là, bạn sẽ không bị kiệt sức và gục ngã và trở nên mệt mỏi hơn lúc mới bắt đầu. Trộn Rev Up với một cốc nước lạnh, và bạn sẽ cảm thấy tràn đầy năng lượng và sẵn sàng đối mặt với một ngày bận rộn phía trước. Rev Up chứa hơn 100% dưỡng chất thiết yếu mà cơ thể bạn cần để giúp bạn suy nghĩ sáng suốt và làm việc với hiệu suất tối đa. Rev Up có 3 mùi - nho, chanh và anh đào - và có bán tại các siêu thị khắp khu vực Tri-County. Khi bạn cảm thấy mệt mỏi, cho tinh thần tăng lên, bằng Rev Up.",
        "contentTranscript": "Feeling run down? Low on energy? Like you'll never make it through the day? Then it's time for you to Rev Up. One package of Rev Up contains enough vitamins and minerals to energize you for five straight hours. And the best part is, you won't come crashing down even more tired than when you started. Mix amazing Rev Up with a glass of cold water, and you'll feel energized and ready to tackle the busy day ahead of you. Rev Up contains more than 100 percent of the vital nutrients your body needs to help you think clearly and perform at maximum efficiency. Rev Up comes in three great flavors -- grape, lime and cherry -- and is available at supermarkets throughout the Tri-County area. When you're down, Rev it Up, with Rev Up.",
        "AskOne": "What is being advertised?",
        "AskOneTrans": "Cái gì đang được quảng cáo?",
        "AnswerOne": "An energy drink",
        "AnswerOneTrans": "Đồ uống tăng lực",
        "AskTwo": "What does the speaker claim about Rev Up?",
        "AskTwoTrans": "Người nói nói gì về Rev Up?",
        "AnswerTwo": "It works for five hours. ",
        "AnswerTwoTrans": "Nó có hiệu quả trong 5 tiếng",
        "AskThree": "Where can people buy Rev Up?",
        "AskThreeTrans": "Có thể mua được Rev Up ở đâu?",
        "AnswerThree": "In supermarkets",
        "AnswerThreeTrans": "Trong siêu thị."
    },
    {
        "srcUrl": "TWFYJ.mp3",
        "contentTranslation": "Tôi đã làm việc ở vườn thú hơn 20 năm. Hàng ngày, tôi phải cho voi ăn và đảm bảo chúng có đủ nước. Vào giờ nghỉ trưa, tôi thích đi vòng quanh vườn thú và ngắm nhìn những loài vật khác. Hà mã là con vật yêu thích thứ hai của tôi sau voi.",
        "contentTranscript": "I have been working at the zoo for over twenty years now. Every day, I have to feed the elephants and make sure that they have enough water. On my break, I like to walk around the zoo and look at the other animals. The hippo is my second favorite animal, after the elephant.",
        "AskOne": "How long has the speaker been working at the zoo?",
        "AskOneTrans": "Người nói đã làm việc ở vườn thú được bao lâu?",
        "AnswerOne": "More than twenty years",
        "AnswerOneTrans": "Nhiều hơn 20 năm",
        "AskTwo": "What does the speaker like to do during her lunch break?",
        "AskTwoTrans": "Người nói thích làm gì trong giờ nghỉ trưa?",
        "AnswerTwo": "Walk around the zoo",
        "AnswerTwoTrans": "Đi vòng quanh vườn thú",
        "AskThree": "What is the speaker's favorite animal?",
        "AskThreeTrans": "Con vật yêu thích của người nói là gì?",
        "AnswerThree": "The elephant",
        "AnswerThreeTrans": "Voi"
    },
    {
        "srcUrl": "2xywv.mp3",
        "contentTranslation": "Trung tâm liên lạc của chúng tôi mang đến cho bạn rất nhiều lợi ích khi ở tại khách sạn của chúng tôi. Nằm trên tầng 3 và mở cửa 24 giờ mỗi ngày. Trung tâm bao gồm một máy photo tân tiến nhất và hai máy fax. Ngoài ra còn có một số cổng điện thoại có thể kết nối máy tính của bạn với mạng Internet. Dịch vụ phát thư nhanh cung cấp việc vận chuyển nhanh những tài liệu và bưu kiện quan trọng. Nếu cần giúp đỡ, xin vui lòng liên lạc với quản lý khách sạn.",
        "contentTranscript": "Our communications center brings you many benefits while you stay in our hotel. It is located on the third floor and can be accessed twenty-four hours a day. It includes a state-of-the-art photocopier and two fax machines. There are also several phone ports to connect your computer to the Internet. An express courier service is available for quick delivery of important documents and packages. If you require assistance, please contact the hotel manager.",
        "AskOne": "Where is this message given?",
        "AskOneTrans": "Tin nhắn này được phát ở đâu?",
        "AnswerOne": "In a hotel",
        "AnswerOneTrans": "Trong khách sạn",
        "AskTwo": "What are the hours of operation of this service?",
        "AskTwoTrans": "Thời gian hoạt động của dịch vụ này là gì?",
        "AnswerTwo": "All day and all night ",
        "AnswerTwoTrans": "Cả ngày và đêm",
        "AskThree": "Who can help guests who need additional assistance?",
        "AskThreeTrans": "Ai có thể giúp đỡ khách cần giúp đỡ?",
        "AnswerThree": "The manager",
        "AnswerThreeTrans": "Quản lý"
    },
    {
        "srcUrl": "hnobe.mp3",
        "contentTranslation": "Xin chào, tôi là Wanda Carson gọi cho James Yamaguchi. James, tôi là một phóng viên ở Tờ báo Kinh doanh Địa phương, và tôi được Kareen Christenson trong bộ phận marketing chỉ đến gặp bạn. Cô ấy nói tôi nên nói chuyện với bạn cho mẩu tin sắp tới của tôi về dự án phát triển đô thị mới, và tôi muốn sắp xếp thời gian gặp trong tuần này để chúng ta có thể gặp phỏng vấn. Tôi chỉ cần khoảng 20 phút của bạn thôi. Tôi muốn nói phần chính về Tòa tháp Đôi, và cũng như về những dự án phát triển trong năm sau. Bạn có thể vui lòng gọi cho tôi ở số 555-737-6233 được không? Một lần nữa, tên tôi là Wanda Carlson của Tờ báo Kinh doanh Địa phương. Cám ơn. Tạm biệt.",
        "contentTranscript": "Hello, this is Wanda Carson calling for James Yamaguchi. James, I'm a reporter at the Local Business Journal, and I was referred to you by Kareen Christenson of your marketing department. She said that you would be a good person to talk with for my upcoming piece on new downtown development, and I'd like to arrange a time this week that we could meet for an interview. I'll need only about 20 minutes of your time. I want to talk mostly about the Twin Towers building, and also about developments in the works for next year. Could you please call me at 555-737-6233? Again, my name's Wanda Carlson of the Local Business Journal. Thank you. Goodbye.",
        "AskOne": "Who is the message for?",
        "AskOneTrans": "Thông điệp này dành cho ai?",
        "AnswerOne": "James Yamaguchi",
        "AnswerOneTrans": "James Yamaguchi",
        "AskTwo": "What is the main purpose of the message?",
        "AskTwoTrans": "Mục đích chính của thông điệp này là gì?",
        "AnswerTwo": "To arrange a meeting",
        "AnswerTwoTrans": "Để sắp xếp một buổi gặp mặt",
        "AskThree": "What does the speaker ask the listener to do?",
        "AskThreeTrans": "Người nói yêu cầu người nghe làm gì?",
        "AnswerThree": "Return his phone call",
        "AnswerThreeTrans": "Gọi lại cho anh ta",
        "readingComprehension": "<b>bold</b> <i>italic</i> TESTING LINKED",
        "linkedWordFile": "test-linked.json"
    }
]