[
    {
        "sentence": "All temporary WORKERS are paid on an hourly basis and receive no benefits.",
        "ipa": "ɔːl ˈtɛmpərəri ˈwɜːkəz ɑː peɪd ɒn ən ˈaʊəli ˈbeɪsɪs ænd rɪˈsiːv nəʊ ˈbɛnɪfɪts.",
        "tag": "WORKERS ",
        "meaning": "Tất cả công nhân tạm thời được trả công theo giờ và không nhận bất cứ phúc lợi nào."
    },
    {
        "sentence": "Ms.Nora decided to find a solution for the PROBLEM by herself.",
        "ipa": "Ms.ˈnɔːrə dɪˈsaɪdɪd tuː faɪnd ə səˈluːʃən fɔː ðə ˈprɒbləm baɪ hɜːˈsɛlf.",
        "tag": "PROBLEM ",
        "meaning": "Bà Nora quyết định tự tìm ra giải pháp cho vấn đề."
    },
    {
        "sentence": "She always uses the best service PROVIDERS regardless of expense.",
        "ipa": "ʃiː ˈɔːlweɪz ˈjuːzɪz ðə bɛst ˈsɜːvɪs prəˈvaɪdəz rɪˈgɑːdlɪs ɒv ɪksˈpɛns.",
        "tag": "PROVIDERS ",
        "meaning": "Cô ta luôn chọn nhà cung cấp tốt nhất bất kể chi phí thế nào."
    },
    {
        "sentence": "We didn't SCHEDULE enough time for all the exhibits.",
        "ipa": "wiː dɪdnt ˈʃɛdjuːl ɪˈnʌf taɪm fɔːr ɔːl ði ɪgˈzɪbɪts.",
        "tag": "SCHEDULE ",
        "meaning": "Chúng tôi đã không lên lịch đủ thời gian cho tất cả các cuộc triễn lãm."
    },
    {
        "sentence": "It is important for the instrument to be properly tuned in ORDER to produce the intended notes.",
        "ipa": "ɪt ɪz ɪmˈpɔːtənt fɔː ði ˈɪnstrʊmənt tuː biː ˈprɒpəli tjuːnd ɪn ˈɔːdə tuː ˈprɒdjuːs ði ɪnˈtɛndɪd nəʊts.",
        "tag": "ORDER ",
        "meaning": "Việc lên dây đàn đúng rất quan trọng để tạo ra nốt nhạc như ý muốn."
    },
    {
        "sentence": "Who made my OFFICE messy?",
        "ipa": "huː meɪd maɪ ˈɒfɪs ˈmɛsi?",
        "tag": "OFFICE ",
        "meaning": "Ai đã làm văn phòng tôi lộn xộn?"
    },
    {
        "sentence": "The INTERVIEWER made the candidates feel relaxed.",
        "ipa": "ði ˈɪntəvjuːə meɪd ðə ˈkændɪdɪts fiːl rɪˈlækst.",
        "tag": "INTERVIEWER ",
        "meaning": "Người phỏng vấn khiến các ứng viên cảm thấy thư giãn."
    },
    {
        "sentence": "While she specializes in systems analysis, we sometimes call on her to speak at CLIENT workshops as well.",
        "ipa": "waɪl ʃiː ˈspɛʃəlaɪzɪz ɪn ˈsɪstɪmz əˈnæləsɪs, wiː ˈsʌmtaɪmz kɔːl ɒn hɜː tuː spiːk æt ˈklaɪənt ˈwɜːkʃɒps æz wɛl.",
        "tag": "CLIENT ",
        "meaning": "Mặc dù cô ấy chuyên về phân tích hệ thống, chúng tôi đôi khi cũng gọi cô ấy đến để nói chuyện tại hội thảo khách hàng."
    },
    {
        "sentence": "He works as a travel WRITER.",
        "ipa": "hiː wɜːks æz ə ˈtrævl ˈraɪtə.",
        "tag": "WRITER",
        "meaning": "Anh ta là một nhà văn về du lịch."
    },
    {
        "sentence": "Companies often send out their free samples with discount coupons to encourage consumers to buy their PRODUCTS.",
        "ipa": "ˈkʌmpəniz ˈɒf(ə)n sɛnd aʊt ðeə friː ˈsɑːmplz wɪð ˈdɪskaʊnt ˈkuːpɒnz tuː ɪnˈkʌrɪʤ kənˈsjuːməz tuː baɪ ðeə ˈprɒdʌkts.",
        "tag": "PRODUCTS",
        "meaning": "Các công ty thường gửi các mẫu dùng thử với phiếu mua hàng giảm giá để khuyến khích người tiêu dùng mua sản phẩm của họ."
    },
    {
        "sentence": "I expect the rate that I was quoted over the phone and I will not accept any CHANGES.",
        "ipa": "aɪ ɪksˈpɛkt ðə reɪt ðæt aɪ wɒz ˈkwəʊtɪd ˈəʊvə ðə fəʊn ænd aɪ wɪl nɒt əkˈsɛpt ˈɛni ˈʧeɪnʤɪz.",
        "tag": "CHANGES",
        "meaning": "Tôi mong giá phòng là giá mà tôi đã được biết thông qua điện thoại và tôi sẽ không chấp nhận bất kỳ sự thay đổi nào."
    },
    {
        "sentence": "They held a meeting to DISCUSS the future of the company.",
        "ipa": "ðeɪ hɛld ə ˈmiːtɪŋ tuː dɪsˈkʌs ðə ˈfjuːʧər ɒv ðə ˈkʌmpəni.",
        "tag": "DISCUSS ",
        "meaning": "Họ tổ chức một cuộc họp để thảo luận về tương lai của công ty."
    },
    {
        "sentence": "There's absolutely no WAY I can meet you on that matter.",
        "ipa": "ðeəz ˈæbsəluːtli nəʊ weɪ aɪ kæn miːt juː ɒn ðæt ˈmætə.",
        "tag": "WAY",
        "meaning": "Không có cách nào để tôi có thể đồng ý với bạn về vấn đề đó."
    },
    {
        "sentence": "I hope the company has enough money to pay for these COSTLY renovations.",
        "ipa": "aɪ həʊp ðə ˈkʌmpəni hæz ɪˈnʌf ˈmʌni tuː peɪ fɔː ðiːz ˈkɒstli ˌrɛnəʊˈveɪʃənz.",
        "tag": "COSTLY ",
        "meaning": "Tôi hi vọng là công ty có đủ tiền để chi trả cho những chi phí tu sửa tốn kém này."
    },
    {
        "sentence": "Preferred Medical Equipment, Inc. will raise PRICES and lower discounts on January 1.",
        "ipa": "prɪˈfɜːd ˈmɛdɪkəl ɪˈkwɪpmənt, Inc. wɪl reɪz ˈpraɪsɪz ænd ˈləʊə ˈdɪskaʊnts ɒn ˈʤænjʊəri 1.",
        "tag": "PRICES ",
        "meaning": "Tập đoàn thiết bị Y tế Preferred sẽ tăng giá và giảm chiết khấu vào 1 tháng Một."
    },
    {
        "sentence": "All purchases made on the company credit CARD should be listed directly on the monthly statement.",
        "ipa": "ɔːl ˈpɜːʧəsɪz meɪd ɒn ðə ˈkʌmpəni ˈkrɛdɪt kɑːd ʃʊd biː ˈlɪstɪd dɪˈrɛktli ɒn ðə ˈmʌnθli ˈsteɪtmənt.",
        "tag": "CARD ",
        "meaning": "Tất cả các thanh toán mua hàng bằng thẻ tín dụng công ty phải được liệt kê trực tiếp trên bào cáo hàng tháng."
    },
    {
        "sentence": "The company anticipates a significant increase in sales in the next YEAR.",
        "ipa": "ðə ˈkʌmpəni ænˈtɪsɪpeɪts ə sɪgˈnɪfɪkənt ˈɪnkriːs ɪn seɪlz ɪn ðə nɛkst jɪə.",
        "tag": "YEAR",
        "meaning": "Công ty dự đoán việc tăng doanh số đáng kể vào năm sau."
    },
    {
        "sentence": "Hold hands and FORM a circle.",
        "ipa": "həʊld hændz ænd fɔːm ə ˈsɜːkl.",
        "tag": "FORM ",
        "meaning": "Hãy nắm tay và tạo thành vòng tròn."
    },
    {
        "sentence": "He gave me an INCREASE in salary.",
        "ipa": "hiː geɪv miː ən ˈɪnkriːs ɪn ˈsæləri.",
        "tag": "INCREASE ",
        "meaning": "Ông ấy tăng lương cho tôi."
    },
    {
        "sentence": "Employees are reminded to turn off their computer EQUIPMENT before leaving the office.",
        "ipa": "ˌɛmplɔɪˈiːz ɑː ˈrɪmaɪndɪd tuː tɜːn ɒf ðeə kəmˈpjuːtər ɪˈkwɪpmənt bɪˈfɔː ˈliːvɪŋ ði ˈɒfɪs.",
        "tag": "EQUIPMENT ",
        "meaning": "Nhân viên được nhắc nhở tắt thiết bị máy tính của họ trước khi rời khỏi văn phòng."
    },
    {
        "sentence": "Why don't we DISCUSS your proposal over dinner?",
        "ipa": "waɪ dəʊnt wiː dɪsˈkʌs jɔː prəˈpəʊzəl ˈəʊvə ˈdɪnə?",
        "tag": "DISCUSS ",
        "meaning": "Chúng ta thảo luận về bản kiến nghị của bạn trong bữa ăn tối đi?"
    },
    {
        "sentence": "Haven't they located the PROBLEM yet?",
        "ipa": "hævnt ðeɪ ləʊˈkeɪtɪd ðə ˈprɒbləm jɛt?",
        "tag": "PROBLEM ",
        "meaning": "Họ đã tìm ra được vấn đề chưa?"
    },
    {
        "sentence": "Who get the award for the employee of the YEAR?",
        "ipa": "huː gɛt ði əˈwɔːd fɔː ði ˌɛmplɔɪˈiː ɒv ðə jɪə?",
        "tag": "YEAR",
        "meaning": "Ai là người giành được giải thưởng Nhân viên của Năm vậy?"
    },
    {
        "sentence": "I'm really not satisfied with the WAY you have handled the situation.",
        "ipa": "aɪm ˈrɪəli nɒt ˈsætɪsfaɪd wɪð ðə weɪ juː hæv ˈhændld ðə ˌsɪtjʊˈeɪʃən.",
        "tag": "WAY ",
        "meaning": "Tôi không hài lòng với cách bạn giải quyết tình huống đó."
    },
    {
        "sentence": "My CLIENT wants this project to be done in five weeks.",
        "ipa": "maɪ ˈklaɪənt wɒnts ðɪs ˈprɒʤɛkt tuː biː dʌn ɪn faɪv wiːks.",
        "tag": "CLIENT ",
        "meaning": "Khách hàng của tôi muốn dự án này được hoàn thành trong năm tuần."
    },
    {
        "sentence": "He works as a travel WRITER.",
        "ipa": "hiː wɜːks æz ə ˈtrævl ˈraɪtə.",
        "tag": "WRITER",
        "meaning": "Anh ta là một nhà văn về du lịch."
    },
    {
        "sentence": "We charge a reasonable PRICE for this fancy car.",
        "ipa": "wiː ʧɑːʤ ə ˈriːznəbl praɪs fɔː ðɪs ˈfænsi kɑː.",
        "tag": "PRICE",
        "meaning": "Chúng tôi tính giá hợp lý cho chiếc xe sang trọng này."
    },
    {
        "sentence": "You should investigate to see if there are any alternatives to COSTLY hospital stays.",
        "ipa": "juː ʃʊd ɪnˈvɛstɪgeɪt tuː siː ɪf ðeər ɑːr ˈɛni ɔːlˈtɜːnətɪvz tuː ˈkɒstli ˈhɒspɪtl steɪz.",
        "tag": "COSTLY ",
        "meaning": "Bạn nên điều tra xem liệu có cách nào khác thay cho việc phải nằm viện rất đắt đỏ không."
    }
]